{"jobs": [
    {
      "title": "ACCOUNTING CLERKS: PRODUCTION",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "Army Support Formation, Ref No: FMD/01/06/25/09A<br>Central Staff BM, Ref No: FMD/01/06/25/09B<br>SA Air Force, Air Comm, Ref No: FMD/01/06/25/09C",
      "description": "Provisioning of a budget management service for the Medium term expenditure framework (MTEF). Assist and participate in the process to develop the Annual Performance plan financial management guidelines. Assist in providing an expenditure and revenue budget control service in the area of responsibility. Provide administrative Financial Management System Budget Control functions. Provide budget control policy advice. Execute the administration of FMS Budget Control functions. Monitor the budget control aspects within the area of responsibility. Provide and reproduce financial reports as required by clients. Reproduce developed financial management reports. Distribute financial reports. Perform a variety of routine administrative duties. Administration to reserve al financial management documentation for audit. Taking minutes and recordkeeping for relevant meetings and discussions. Reproduction of all financial management documentation. Distribution of office documentation. The administering of allocated resources. Contribute to the support of the budget management capability. Comply with Occupational Health and Safety standards within allocated facilities.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Matric certificate with Finance/Accounting related subjects, post matric qualification in Finance/Accounting, a minimum of one year relevant experience and a valid RSA/Military driver’s license will be an added advantage Special requirements (Skills needed): Basic communication, analytical, innovative, problem solving and interpersonal skills. Computer literacy (MS Office) essential. Knowledge of Departmental Financial Management system (FMS), report writing system (IC), Departmental Accounting, Standard Chart of Accounts, Conventional Service Writing and staff work essential or any other financial systems and Supply Chain Management.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Tshepo.Magau@dod.mil.za.<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "SA Army (Ms T.M.Sekgobela) tel: (012) 355 1238<br>SA Airforce (Mr S.R. Molekwa) tel: (012) 312 2209<br>Central Staff (Ms E.J. Van Vuuren) tel: (012) 355 5805."
    },
    
    {
      "title": "ACCOUNTING CLERK: PRODUCTION",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "FMD/01/06/25/10",
      "description": "Rendering support and assistance in controlling and maintaining current and new Departmental debt in the DOD. Regularly implementing actions to recover outstanding debt from serving and ex-members of the SA National Defence Force (SANDF), Public Service Act Personnel (PSAP) and private institutions. Implementing and maintaining processes to effectively handle Departmental debt. Registering, preparing outgoing correspondence and processing all related accounting transactions. Liaising and corresponding with the State Attorney’s office. Implementing effective actions and processes to ensure that deadlines are met and that Departmental debt is recovered. Constant collaborating, liaising and communicating with the Finance Clerk Supervisor in control of the section. Strict application of the prescripts contained in the Public Finance Management Act (PFMA), Treasury Regulations (TR’s) and other applicable instructions. Recording, filling and safeguarding of all debtors administration related documentation and information for future reference and audit purposes.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Matric certificate with Finance/Accounting related subjects, post matric qualification in Finance/Accounting, a minimum of one year relevant experience and a valid RSA/Military driver’ license will be an added advantage. Special requirements (Skills needed): Computer literate in MS Office, MS Word and Excel. Basic knowledge of the processes and procedures of the collection, recording, and management of debt and related accounting transactions. Reasoning, mathematical and problem solving ability. Ability to effectively communicate with clients/debtors. Positive, trustworthy, loyal, sound judgemental ability and aiming for zero defect.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Tshepo.Magau@dod.mil.za.<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "Mr K.O. Nyamane, tel: (012) 392 2778"
    },
    
    {
      "title": "PERSONNEL OFFICIAL: SUPERVISOR",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "DHRCM/05/05/25",
      "description": "Provide a personnel administration support with reference to placement of PSAP Senior Management Service (SMS) in the Department of Defence (DOD) by coordinate the recruitment, selection and appointment of SMS officials. Supervise and administer the provision of efficient and effective HR administration support services with regards to diverse HR issues such as probation appointments. Facilitate verification of personal credentials (i.e. qualifications and employment history) of SMS. Drafting submission to the delegated authority to obtain approval for the appointment of candidates. Verify source documents and approve all PERSOL transactions in respect of the awarding of pay progression of SMS officials. Administer payment of acting allowance. Advice and assist Senior Management Services (SMS) members and Occupation Specific Dispensation (OSD) employees with the structuring of their salary packages. Inform SMS officials of the due dates submitting financial disclosure.",
      "requirements": "Grade 12 (NQF Level 4) or equivalent with a minimum of three to five (3-5) years relevant experience in Human Resource Management. Knowledge and courses of PERSOL mainframe or PERSAL system is a requirement. Special requirements (skills needed): Knowledge and understanding of Senior Management Services (SMS) Recruitment & Selection processes and procedures. Knowledge and insight in respect of HR legislation pertaining to (SMS) appointments. Knowledge and understanding of applicable HR prescripts and DPSA guidelines of (SMS). Good interpersonal skills and communication skills (written and verbal). Must be computer literate, i.e. MS Office Suite (Word, Excel and PowerPoint) and must have knowledge of the SMS Handbook and Executive Protocol.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, Directorate Human Resource Career Management, Private Bag X976, Pretoria, 0001.<br>or<br>Hand-deliver at Bank of Lisbon Building, 400 Paul Kruger Street, Pretoria.<br>or<br>email to dhrcmstaffing@gmail.com.",
      "enquiries": "Mr M.T. Pilane Tel No: (012) 339 5605"
    },
    
    {
      "title": "SOCIAL AUXILIARY WORKER GRADE 1 (X34 POSTS)",
      "department": "PROVINCIAL ADMINISTRATION: FREE STATE DEPARTMENT OF SOCIAL DEVELOPMENT",
      "reference_number": "Lejweleputswa District, X8 Posts: Welkom Office X6 Posts, Boshof Office X2 Posts (Ref No: DSDFS 07/25)<br>Thabo Mofutsanyana District, X17 Posts: FDC Office X3 Posts, Bethlehem Office X4 Posts, Vrede Office X4 Posts, Ficksburg Office X6 Posts: (Ref No: DSDFS 08/25)<br>Fezile Dabi District, X4 Posts: Sasolburg Office X4 (Ref No: DSDFS 09/25)<br>Xhariep District, X4 Posts: Smithfield Office X2 Posts, Jagersfontein Office X1 Post, Koffiefontein Office X1 Post: (Ref No: DSDFS 10/25)",
      "description": "Provide assistance and support to social workers with the rendering of a social work service with regard to the care, support, protection and development of vulnerable individuals, groups, families and communities through the relevant departmental programmes. Assist social workers to attend to any other matters that could result in, or stem from, social instability in any form. Keep abreast with new developments in the social work and social services field. Perform administrative support functions in support of social workers as required of the job.",
      "requirements": "An appropriate recognised NQF level 4 (Grade 12) or equivalent qualification and Social Auxiliary Certificate. Current registration with the South African Council for Social Service Professions [SACSSP]. Knowledge and Skills: Demonstrate basic understanding of the South African social welfare context, the policy and Bethlehem Office practice of developmental social welfare services and the role of social auxiliary worker within this context. Define and demonstrate understanding of the purpose of social auxiliary work and the role and functions of a social auxiliary worker in relation to a social worker within the South African context. Consistently reflect the values and principles contained in the Bill of Rights and the social work profession’s Code of Ethics in service delivery as a social auxiliary worker. Demonstrate a basic understanding of the South African judicial system and the legislation governing and impacting on social auxiliary work and social work. Demonstrate a basic understanding of human behaviour, relationship system and social issues. Implement appropriate social auxiliary work methods and techniques to address the social needs of client systems. Use appropriate resources in service delivery to client systems. Work effectively with social workers and members of multi-sectoral teams in social service delivery. Work effectively as a social auxiliary worker to address the special needs and problems experienced by at least 3 of the priority focus groups in the social welfare. Keep precise records and compile accurate reports on social needs and social auxiliary work activities and file them appropriately. Provide an efficient research and administrative support service to the social worker. Demonstrate basic knowledge of financial matters related to social auxiliary work. Demonstrate self-awareness regarding personal capacities, attitudes and skills and a willingness to develop them further under the supervision of a social worker.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Applications should be addressed to various institution as per the applicant’s need:<br><br>Mangaung Metro: Please forward your application quoting the relevant reference number, Department of Social Development, P.O. Box 695, Bloemfontein, 9300<br>or<br>hand deliver to Department of Social Development, Shop No: 46, Lemo Mall, Dr Belcher Road, Bloemfontein, 9301<br>or<br>Email to Recruitment.mangaung@fssocdev.gov.za<br><br>Lejweleputswa: Please forward your application quoting the relevant reference number hand deliver to Department of Social Development Macholo Building, 05 Elizabeth Street, Welkom, 9460<br>or<br>Email to Recruitment.lejweleputswa@fssocdev.gov.za<br><br>Thabo Mofutsanyana: Please forward your application quoting the relevant reference number, Department of Social Development, Corner of Moremoholo & Setai Street, Old FDC Building, Setsing, 9870<br>or<br>Email to Recruitment.tmofutsanyana@fssocdev.gov.za<br><br>Fezile Dabi District: Please forward your application quoting the relevant reference number, P.O. Box1122, Kroonstad, 9595<br>or<br>hand deliver to Department of Social Development, KGI Building, 20 Cross Street, Kroonstad<br>or<br>Email to Recruitment.Fdabi@fssocdev.gov.za<br><br>Xhariep District: Please forward your application quoting the relevant reference number, Department of Social Development, 15 Dawid Street Trompsburg, 9913<br>or<br>Email to Recruitment.Xhariep@fssocdev.gov.za<br><br>Thekolohelong Welfare Centre and Boiketlong Old Age Home: Please forward your application quoting the relevant reference number, The Department of Social Development, Private Bag x 20616, Bloemfontein 9300. Attention Ms. M.V. Mophethe – Human Resource Management (Recruitment Section) Old Standard Bank Building.<br>or<br>place applications in an application box at Cnr Charlotte Maxeke and West Burger Street, Old Standard Bank Building, Bloemfontein.<br>or<br>Email to Recruitment@fssocdev.gov.za",
      "enquiries": "Mangaung District: Ms M. Phori at 071 864 5734<br>Lejweleputswa District: Mr Maleme at 071 853 8481<br>Thabo Mofutsanyana District: Ms P Litabe at 066 486 6749<br>Fezile Dabi District: Ms M Martins: 083 443 8343<br>Xhariep District: Mr T Mjacu at 062 464 8445"
    },

    {
      "title": "ASSISTANT COMMUNITY DEVELOPMENT PRACTITIONER GRADE 1 (X65 POSTS)",
      "department": "PROVINCIAL ADMINISTRATION: FREE STATE DEPARTMENT OF SOCIAL DEVELOPMENT",
      "reference_number": "Mangaung District, X21 Posts: Limo Office X8 Posts, Thaba Nchu Office X7 Posts, Botshabelo Office X6 Posts: (Ref No: DSDFS 01/25)<br>Lejweleputswa District, X7 Posts: Welkom Office X5 Posts, Boshof X2 Posts: (Ref No: DSDFS 02/25)<br>Thabo Mofutsanyana District, X13 Posts: Bethlehem Office X9 Posts, FDC Office X4 Posts: (Ref No: DSDFS 03/25)<br>Fezile Dabi District, X19 Posts: Sasolburg Office X3 Posts, Frankford Office X7 Posts, Kroonstad Office X9 Posts: (Ref No: DSDFS 04/25)<br>Xhariep District, X5 Posts: Smithfield Office X3 Posts, Jagersfontein Office X1 Post, Koffiefontein Office X1 Post: (Ref No: DSDFS 05/25)",
      "description": "Assist in the identification and facilitation in the implementation of integrated community development interventions in partnership with the community and other relevant stakeholders. This would, inter alia, include the following: Establishment of social relationships: Delimit/scoping the community, gain their trust and get to know the current community services, service delivery blockages, resources, and the state of the community. Community and Households Profiling: Assess the community’s structures, households need, background information including historical, needs profile, resources, and strengths. Strengthen and build structures that can assist in this regard. Planning and prioritization: Facilitate the planning and prioritization of the activities required to develop the community by formulating goals and objectives, assessing the available resources, set time frames and compile budgets. Support communities and perform administrative support on community development and related activities. This would, inter alia, entail the following: Assist with the liaison, co-ordination and monitoring of projects and other community development ventures and report on the progress thereof. Assist with the application of the registration of emerging local structures such as Non-Profit Organisations (NPOs) with the Department of Social Development and other appropriate authorities. Assist to monitor NPOs to ensure that they are in compliance with the NPO and PFMA Acts. Provide assistance to facilitate, coordinate and participate in various awareness campaigns, and public aimed at educating communities and other stakeholders on self-empowerment.",
      "requirements": "Grade 12 qualification, Community Development Certificate (NQF Level 5). Basic knowledge of community development/work, attitudes, and values for the engagement in the social development of communities. The ability and competence to interact with community development structures. The understanding social dynamics of communities. Communication skills.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Applications should be addressed to various institution as per the applicant’s need:<br><br>Mangaung Metro: Please forward your application quoting the relevant reference number, Department of Social Development, P.O. Box 695, Bloemfontein, 9300<br>or<br>hand deliver to Department of Social Development, Shop No: 46, Lemo Mall, Dr Belcher Road, Bloemfontein, 9301<br>or<br>Email to Recruitment.mangaung@fssocdev.gov.za<br><br>Lejweleputswa: Please forward your application quoting the relevant reference number hand deliver to Department of Social Development Macholo Building, 05 Elizabeth Street, Welkom, 9460<br>or<br>Email to Recruitment.lejweleputswa@fssocdev.gov.za<br><br>Thabo Mofutsanyana: Please forward your application quoting the relevant reference number, Department of Social Development, Corner of Moremoholo & Setai Street, Old FDC Building, Setsing, 9870<br>or<br>Email to Recruitment.tmofutsanyana@fssocdev.gov.za<br><br>Fezile Dabi District: Please forward your application quoting the relevant reference number, P.O. Box1122, Kroonstad, 9595<br>or<br>hand deliver to Department of Social Development, KGI Building, 20 Cross Street, Kroonstad<br>or<br>Email to Recruitment.Fdabi@fssocdev.gov.za<br><br>Xhariep District: Please forward your application quoting the relevant reference number, Department of Social Development, 15 Dawid Street Trompsburg, 9913<br>or<br>Email to Recruitment.Xhariep@fssocdev.gov.za<br><br>Thekolohelong Welfare Centre and Boiketlong Old Age Home: Please forward your application quoting the relevant reference number, The Department of Social Development, Private Bag x 20616, Bloemfontein 9300. Attention Ms. M.V. Mophethe – Human Resource Management (Recruitment Section) Old Standard Bank Building.<br>or<br>place applications in an application box at Cnr Charlotte Maxeke and West Burger Street, Old Standard Bank Building, Bloemfontein.<br>or<br>Email to Recruitment@fssocdev.gov.za",
      "enquiries": "Mangaung District: Ms M. Phori at 071 864 5734<br>Lejweleputswa District: Mr Maleme at 071 853 8481<br>Thabo Mofutsanyana District: Ms P Litabe at 066 486 6749<br>Fezile Dabi District: Ms M Martins at 083 443 8343<br>Xhariep District: Mr T Mjacu at 062 464 8445"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION) (X3 POSTS)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Dundee Ref No: DOT 321/2025<br>Cost Centre, Estcourt Ref No: DOT 322/2025",
      "description": "Provide a support and advisory service in respect of the advertising and filling of vacant posts for the Cost Centre, Provide a support service in respect of the control, custody and care of Human Resource Records and Archives, Render a support and advisory service to Cost Centre staff in respect of general benefits and housing, leave matters, Performance Management and Development System, rank and salary related matters and capturing of PERSAL transactions, Provide administrative support and process all documentation required for PILIR and exits from service for the Cost Centre, Perform all HR duties related to Zibambele contractors.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Knowledge of PERSAL, MS Word. MS Excel. MS Access and E-mail, Knowledge of Human Resource Management Policies, Procedures, Prescripts and Regulations, Keep and maintain Act, Knowledge of channels of communication, Knowledge of filing system and National Archives Act 43 of 1996, Knowledge of record Management and Registry procedure, Organizational, decision making and problem solving, Verbal and written communication skills, Ability to interpret directives, Policies and Regulations, Ability to priorities the work, Ability to operate a PC, Ability to communicate with various role players, Problem solving skills, Ability to file correctly, Ability to maintain strict level of confidentiality, The ideal candidate should be strictly confidential, be teamwork orientated and be an innovative thinker. He/ she must also be initiative, responsible and be courteous.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms NS Ndebele Cost Centre, Dundee Tel No: (034) 299 8600<br>Ms N Magubane Cost Centre, Estcourt Tel No: (036) 342 3900"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 323/2025",
      "description": "Implement Human Resource Administration practices. Address Human Resource Administration enquiries. Provide Personnel Administration clerical support services within the component. Provide Financial Administration support services in the component.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Knowledge of registry duties, practices as well as the ability to capture. Working knowledge and understanding of the Legislative framework. Knowledge of storage and retrieval procedures in terms of the working environment. Understanding of the work in registry. Computer Literacy. Planning and organisation skills. Communication skills (Verbal and written). Interpersonal relation skills. Flexibility skills. Teamwork skills. Ability to maintain a strict level of confidentiality. Ability to work under pressure. The ideal candidate should be honest, reliable, innovative, creative, loyal, friendly, efficient and responsible.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms BW Khumalo Tel No: (034) 3284 004"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION): GENERAL BENEFITS",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 324/2025",
      "description": "Processing of all matters related to general benefits. Processing of leave and resultant payments and the maintenance of registers. Processing of all rank and salary related matters, Maintenance of computerized data, statistics and personal records. Provide information, guidance and assistance to other directorates with regard to the work in the Benefits Section and to ensure the correct application of policies and procedures.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4. Knowledge, Skills and Competencies Required: Knowledge of human resource management policies, procedures, practices and prescripts, Knowledge of computer based HR Information systems e.g PERSAL, Knowledge and ability to keep and maintain acts, regulations etc, Computer literacy (MS Word, MS Excel, E-mail), Ability to interpret and apply policy and regulations, Problem solving skills, Good communication skills (both verbal and written), The ideal candidate must be team work orientated, open minded i.e. receptive to suggestion and ideas, an innovative thinker, show initiative, be responsible and courteous.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms NP Mwelase Tel No: (033) 355 8742"
    },

    {
      "title": "ADMINISTRATION CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 325/2025",
      "description": "Provide administrative support to the Security Services Directorate. Provide support on the development on the contingency plan. Provide a clerical support service to the Security Services Directorate. Render and provide physical and operational security services.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4; plus, A valid driver’s licence (minimum Code B). Knowledge, Skills and Competencies Required: Ability to conduct security assessments, Knowledge of Minimum Information Security Standards Act of 1996, Knowledge of Minimum Physical Security Standards Act of 2009 and National Key Points Act, Knowledge of control of Access to Public Premises & Vehicles Act, Knowledge of Occupational Health and Safety Act of 1993. Knowledge of Safety at Sport and Recreational Events Act of 2010 and Occupational Health and Safety South African National Standards, Computer literacy. Good planning, organising and coordinating skills. Understanding of Security Threat and Risk Assessment, Problem solving and decision-making skills. Good communication and interpersonal skills. The ideal candidate should be trustworthy, reliable, have integrity, manage time effectively and behave ethically.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr B Tibe Tel No: (033) 355 8088"
    },

    {
      "title": "FINANCE CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 326/2025",
      "description": "Render Financial Accounting transactions. Perform Salary Administration support services. Perform Bookkeeping support services. Render a budget support service.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Basic knowledge of Financial functions, practices as well as the ability to capture data, operate a computer and collate Financial statistics. Basic knowledge of and insight of the Public Service Financial legislations, procedures and Treasury regulations (PFMA, DORA, PSA, PSR, PPPFA & Financial manual). Knowledge of basic Financial Operating systems (PERSAL, BAS & Logis etc.). Job knowledge. Communication skills (verbal and written). Interpersonal relation skills. Flexibility skills. Teamwork skills. Accuracy skills. Aptitude figures skills. Planning and organisation skills. Language skills. Basic Numeracy skills. Ability to perform routine tasks. Ability to operate office equipment. Planning and Organisation skills. Ability to interpret. Research skills. Formulating and editing skills. Analytical and Innovative thinking skills. Report writing and formulation skills. Problem solving skills. Computer Literacy. The ideal candidate should be honest, reliable, innovative, creative, trustworthy, loyal, efficient, responsible and friendly. He/ she should be able to work under pressure, maintain confidentiality and work individually and part of a team.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms N Magubane Tel No: (036) 3523 153"
    },

    {
      "title": "PRINCIPAL AUXILIARY SERVICES OFFICER",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 327/2025",
      "description": "Map accurate road and feature position for the region, Carry out road network queries, Place and replace kilometer post positions and other setting out positions as required, Advise management on technical problems, Provide training and assist with compiling procedure manuals.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4; plus, A minimum of 1 year experience in Road logging, GPS Mapping; plus, A valid driver’s license (Minimum code B). Knowledge, Skills and Competencies Required: Knowledge of the Roads Act & Regulations, Knowledge of the Provincial Road System, Extensive knowledge of all principals and methods of Road Logging, Skills in operating GPS equipment, Skills in GPS computer software including Pathfinder Office and Terra Sync, Driving skills, Map reading and navigation skills, Record and manage road logging projects skills, The ideal candidate should have perseverance, be flexible, have enthusiasm, good interpersonal skills, be reliable and innovative.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr TP Khumalo Tel No: (031) 7926 166"
    },

    {
      "title": "AUXILIARY SERVICES OFFICER: MATERIALS TESTING",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Port Shepstone Ref No: DOT 328/2025<br>Cost Centre, KwaDukuza Ref No: DOT 329/2025<br>Regional Office, Durban Ref No: DOT 330/2025",
      "description": "Coordinate and control the work of Tradesman Aids and give training. Ensure quality control by performing sampling and field control testing. Calculations and reporting of results. Maintenance and use of equipment.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4; plus, A valid driver’s licence (minimum code B). Knowledge, Skills and Competencies Required: Knowledge of standards and procedures as per TMH/TRH, & COLTO., Knowledge of Public Service Regulations, Computer Literacy, Knowledge of safety, General Knowledge of Departmental Road network, Knowledge of Laboratory Equipment, Knowledge of planning, Knowledge of General Admin Functions, Communication (verbal and written) skills, Good Human Relations skills, Problems solving skills, Report writing skills, The ideal candidate should have technical skills, be reliable, teamwork orientated, flexible and have good interpersonal relations.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr R Perumal Tel No: (031) 700 2222"
    },

    {
      "title": "SENIOR AUXILIARY SERVICES OFFICER: GROUND SURVEY",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Port Shepstone Ref No: DOT 331/2025<br>Regional Office, Durban Ref No: DOT 332/2025",
      "description": "Provide assistance with Control Surveys. Provide assistance with Topographical Survey. Provide assistance with setting out. Maintain office, stores, vehicles and other general office duties.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4; plus A valid driver’s licence (minimum code B). Knowledge, Skills and Competencies Required: Knowledge of Public Service Regulations, General Knowledge of Departmental Road network, General Knowledge of trig beacon locations and access routes, Knowledge of batter and profile construction, Writing skills, Communication skills, Interpersonal skills, Leadership skills, Lateral thinking skills, Computer skills, Map reading skills, Navigating GPS skills, The ideal candidate should have technical skills, be reliable, be teamwork orientated, put people first, understanding the practicality of Systems, be results driven, have perseverance, be flexible and be able to work without supervision.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms TM Khumalo Tel No: (031) 792 6166"
    },

    {
      "title": "HANDYMAN: AUXILIARY SERVICES",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 333/2025",
      "description": "Building maintenance. Administrative processors. Operation of tools and equipment. Safety and training.",
      "requirements": "ABET; plus, A valid driver’s licence (Minimum code B). Knowledge, Skills and Competencies Required: Knowledge of clerical duties, switchboard duties, registry duties, practices as well as the ability to capture data, operate computer and collecting statistics, Knowledge and understanding of the legislative framework governing the Public Service, Knowledge of working, storage and retrieval procedures in terms of the working environment, Understanding of work in registry, Ability to interpret legislation / policies, Computer skills, Interpersonal skills, Ability to work in a team, Ability to learn and apply, Planning and organisational skills, Analytical and innovative thinking skills, Problem solving skills, Verbal and written communication skills, The ideal candidate should be responsible, punctual, honest, accurate, reliable, loyal, innovative, be neat and tidy, adhere to Batho Pele principles and comply with code of conduct.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms TC Khumalo Tel No: (032) 437 3800"
    },

    {
      "title": "PROVISIONING ADMINISTRATION CLERK: ACQUISITION AND ASSET VERIFICATION",
      "department": "DEPARTMENT OF JUSTICE AND CONSTITUTIONAL DEVELOPMENT(National Office: Pretoria)",
      "reference_number": "25/05/FMS",
      "description": "Render clerical support; ((Covers both) Compile and maintain records/ databases and/or administrative registers; (Covers both) Check and issue furniture, equipment and accessories to components and individuals; Identify redundant, non-serviceable and obsolete equipment for disposal; Provide Secretariat support to different committees. Verify asset register.",
      "requirements": "Grade 12 certificate or equivalent Skills and Competencies; Computer literacy (MS Word; Excel, Power Point and Outlook); Planning and organizing skills; communication (written and verbal) skills; Interpersonal and organizational skills; Administrative skills; customer service orientated; Integrity.",
      "closing_date": "24 February 2025",
      "application_method": "Post",
      "application_directions": "Quoting the relevant reference number, direct your application to: The Human Resources: Department of Justice and Constitutional Development, Private Bag X81, Pretoria, 0001",
      "enquiries": "Ms. A Van Ross Tel No: (012) 315 1094"
    },
    
    {
      "title": "CLUSTER MANAGER: COURT INTERPRETING",
      "department": "DEPARTMENT OF JUSTICE AND CONSTITUTIONAL DEVELOPMENT (Magistrate Office, Worcester)",
      "reference_number": "03/2025/WC",
      "description": "Manage the cluster legal interpreting and language services; Develop and implement the legal interpreting and language services business plan for the cluster; Manage both human and non human resources of legal interpreting and language services; Manage training and development of court interpreters; Manage compliance of the code of conduct.",
      "requirements": "NQF level 4/ Grade 12; National Diploma: Legal Interpreting at NQF level 5 or any other relevant tertiary qualification at NQF level 5; Proficiency in English; Proficiency in two or more indigenous languages; Six years practical experience Interpreting of which three (3) years at supervisors’ level; Driver’s license. Skills and Competencies: Communication skills; Listening skills; Interpersonal skills; Time management; Computer literacy; Analytic thinking; Problem solving; Planning and organizing; Confidentiality; Ability to work under pressure.",
      "closing_date": "17 February 2025",
      "application_method": "Post & Hand Delivered",
      "application_directions": "Provincial Office: Private Bag X9171, Cape Town, 8000<br>or<br>physical address: 8 Riebeeck Street, 5th Floor Norton Rose House, Cape Town.",
      "enquiries": "Ms N Jacobs Tel No: (021) 462 5471"
    }
    
]
}
