{"jobs": [
    {
      "title": "PERSONNEL OFFICIAL: SUPERVISOR",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "DHRCM/05/05/25",
      "description": "Provide a personnel administration support with reference to placement of PSAP Senior Management Service (SMS) in the Department of Defence (DOD) by coordinate the recruitment, selection and appointment of SMS officials. Supervise and administer the provision of efficient and effective HR administration support services with regards to diverse HR issues such as probation appointments. Facilitate verification of personal credentials (i.e. qualifications and employment history) of SMS. Drafting submission to the delegated authority to obtain approval for the appointment of candidates. Verify source documents and approve all PERSOL transactions in respect of the awarding of pay progression of SMS officials. Administer payment of acting allowance. Advice and assist Senior Management Services (SMS) members and Occupation Specific Dispensation (OSD) employees with the structuring of their salary packages. Inform SMS officials of the due dates submitting financial disclosure.",
      "requirements": "Grade 12 (NQF Level 4) or equivalent with a minimum of three to five (3-5) years relevant experience in Human Resource Management. Knowledge and courses of PERSOL mainframe or PERSAL system is a requirement. Special requirements (skills needed): Knowledge and understanding of Senior Management Services (SMS) Recruitment & Selection processes and procedures. Knowledge and insight in respect of HR legislation pertaining to (SMS) appointments. Knowledge and understanding of applicable HR prescripts and DPSA guidelines of (SMS). Good interpersonal skills and communication skills (written and verbal). Must be computer literate, i.e. MS Office Suite (Word, Excel and PowerPoint) and must have knowledge of the SMS Handbook and Executive Protocol.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, Directorate Human Resource Career Management, Private Bag X976, Pretoria, 0001.<br>or<br>Hand-deliver at Bank of Lisbon Building, 400 Paul Kruger Street, Pretoria.<br>or<br>email to dhrcmstaffing@gmail.com.",
      "enquiries": "Mr M.T. Pilane Tel No: (012) 339 5605"
    },
    
    {
      "title": "SOCIAL AUXILIARY WORKER GRADE 1 (X34 POSTS)",
      "department": "PROVINCIAL ADMINISTRATION: FREE STATE DEPARTMENT OF SOCIAL DEVELOPMENT",
      "reference_number": "Lejweleputswa District, X8 Posts: Welkom Office X6 Posts, Boshof Office X2 Posts (Ref No: DSDFS 07/25)<br>Thabo Mofutsanyana District, X17 Posts: FDC Office X3 Posts, Bethlehem Office X4 Posts, Vrede Office X4 Posts, Ficksburg Office X6 Posts: (Ref No: DSDFS 08/25)<br>Fezile Dabi District, X4 Posts: Sasolburg Office X4 (Ref No: DSDFS 09/25)<br>Xhariep District, X4 Posts: Smithfield Office X2 Posts, Jagersfontein Office X1 Post, Koffiefontein Office X1 Post: (Ref No: DSDFS 10/25)",
      "description": "Provide assistance and support to social workers with the rendering of a social work service with regard to the care, support, protection and development of vulnerable individuals, groups, families and communities through the relevant departmental programmes. Assist social workers to attend to any other matters that could result in, or stem from, social instability in any form. Keep abreast with new developments in the social work and social services field. Perform administrative support functions in support of social workers as required of the job.",
      "requirements": "An appropriate recognised NQF level 4 (Grade 12) or equivalent qualification and Social Auxiliary Certificate. Current registration with the South African Council for Social Service Professions [SACSSP]. Knowledge and Skills: Demonstrate basic understanding of the South African social welfare context, the policy and Bethlehem Office practice of developmental social welfare services and the role of social auxiliary worker within this context. Define and demonstrate understanding of the purpose of social auxiliary work and the role and functions of a social auxiliary worker in relation to a social worker within the South African context. Consistently reflect the values and principles contained in the Bill of Rights and the social work profession’s Code of Ethics in service delivery as a social auxiliary worker. Demonstrate a basic understanding of the South African judicial system and the legislation governing and impacting on social auxiliary work and social work. Demonstrate a basic understanding of human behaviour, relationship system and social issues. Implement appropriate social auxiliary work methods and techniques to address the social needs of client systems. Use appropriate resources in service delivery to client systems. Work effectively with social workers and members of multi-sectoral teams in social service delivery. Work effectively as a social auxiliary worker to address the special needs and problems experienced by at least 3 of the priority focus groups in the social welfare. Keep precise records and compile accurate reports on social needs and social auxiliary work activities and file them appropriately. Provide an efficient research and administrative support service to the social worker. Demonstrate basic knowledge of financial matters related to social auxiliary work. Demonstrate self-awareness regarding personal capacities, attitudes and skills and a willingness to develop them further under the supervision of a social worker.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Applications should be addressed to various institution as per the applicant’s need:<br><br>Mangaung Metro: Please forward your application quoting the relevant reference number, Department of Social Development, P.O. Box 695, Bloemfontein, 9300<br>or<br>hand deliver to Department of Social Development, Shop No: 46, Lemo Mall, Dr Belcher Road, Bloemfontein, 9301<br>or<br>Email to Recruitment.mangaung@fssocdev.gov.za<br><br>Lejweleputswa: Please forward your application quoting the relevant reference number hand deliver to Department of Social Development Macholo Building, 05 Elizabeth Street, Welkom, 9460<br>or<br>Email to Recruitment.lejweleputswa@fssocdev.gov.za<br><br>Thabo Mofutsanyana: Please forward your application quoting the relevant reference number, Department of Social Development, Corner of Moremoholo & Setai Street, Old FDC Building, Setsing, 9870<br>or<br>Email to Recruitment.tmofutsanyana@fssocdev.gov.za<br><br>Fezile Dabi District: Please forward your application quoting the relevant reference number, P.O. Box1122, Kroonstad, 9595<br>or<br>hand deliver to Department of Social Development, KGI Building, 20 Cross Street, Kroonstad<br>or<br>Email to Recruitment.Fdabi@fssocdev.gov.za<br><br>Xhariep District: Please forward your application quoting the relevant reference number, Department of Social Development, 15 Dawid Street Trompsburg, 9913<br>or<br>Email to Recruitment.Xhariep@fssocdev.gov.za<br><br>Thekolohelong Welfare Centre and Boiketlong Old Age Home: Please forward your application quoting the relevant reference number, The Department of Social Development, Private Bag x 20616, Bloemfontein 9300. Attention Ms. M.V. Mophethe – Human Resource Management (Recruitment Section) Old Standard Bank Building.<br>or<br>place applications in an application box at Cnr Charlotte Maxeke and West Burger Street, Old Standard Bank Building, Bloemfontein.<br>or<br>Email to Recruitment@fssocdev.gov.za",
      "enquiries": "Mangaung District: Ms M. Phori at 071 864 5734<br>Lejweleputswa District: Mr Maleme at 071 853 8481<br>Thabo Mofutsanyana District: Ms P Litabe at 066 486 6749<br>Fezile Dabi District: Ms M Martins: 083 443 8343<br>Xhariep District: Mr T Mjacu at 062 464 8445"
    },

    {
      "title": "ASSISTANT COMMUNITY DEVELOPMENT PRACTITIONER GRADE 1 (X65 POSTS)",
      "department": "PROVINCIAL ADMINISTRATION: FREE STATE DEPARTMENT OF SOCIAL DEVELOPMENT",
      "reference_number": "Mangaung District, X21 Posts: Limo Office X8 Posts, Thaba Nchu Office X7 Posts, Botshabelo Office X6 Posts: (Ref No: DSDFS 01/25)<br>Lejweleputswa District, X7 Posts: Welkom Office X5 Posts, Boshof X2 Posts: (Ref No: DSDFS 02/25)<br>Thabo Mofutsanyana District, X13 Posts: Bethlehem Office X9 Posts, FDC Office X4 Posts: (Ref No: DSDFS 03/25)<br>Fezile Dabi District, X19 Posts: Sasolburg Office X3 Posts, Frankford Office X7 Posts, Kroonstad Office X9 Posts: (Ref No: DSDFS 04/25)<br>Xhariep District, X5 Posts: Smithfield Office X3 Posts, Jagersfontein Office X1 Post, Koffiefontein Office X1 Post: (Ref No: DSDFS 05/25)",
      "description": "Assist in the identification and facilitation in the implementation of integrated community development interventions in partnership with the community and other relevant stakeholders. This would, inter alia, include the following: Establishment of social relationships: Delimit/scoping the community, gain their trust and get to know the current community services, service delivery blockages, resources, and the state of the community. Community and Households Profiling: Assess the community’s structures, households need, background information including historical, needs profile, resources, and strengths. Strengthen and build structures that can assist in this regard. Planning and prioritization: Facilitate the planning and prioritization of the activities required to develop the community by formulating goals and objectives, assessing the available resources, set time frames and compile budgets. Support communities and perform administrative support on community development and related activities. This would, inter alia, entail the following: Assist with the liaison, co-ordination and monitoring of projects and other community development ventures and report on the progress thereof. Assist with the application of the registration of emerging local structures such as Non-Profit Organisations (NPOs) with the Department of Social Development and other appropriate authorities. Assist to monitor NPOs to ensure that they are in compliance with the NPO and PFMA Acts. Provide assistance to facilitate, coordinate and participate in various awareness campaigns, and public aimed at educating communities and other stakeholders on self-empowerment.",
      "requirements": "Grade 12 qualification, Community Development Certificate (NQF Level 5). Basic knowledge of community development/work, attitudes, and values for the engagement in the social development of communities. The ability and competence to interact with community development structures. The understanding social dynamics of communities. Communication skills.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Applications should be addressed to various institution as per the applicant’s need:<br><br>Mangaung Metro: Please forward your application quoting the relevant reference number, Department of Social Development, P.O. Box 695, Bloemfontein, 9300<br>or<br>hand deliver to Department of Social Development, Shop No: 46, Lemo Mall, Dr Belcher Road, Bloemfontein, 9301<br>or<br>Email to Recruitment.mangaung@fssocdev.gov.za<br><br>Lejweleputswa: Please forward your application quoting the relevant reference number hand deliver to Department of Social Development Macholo Building, 05 Elizabeth Street, Welkom, 9460<br>or<br>Email to Recruitment.lejweleputswa@fssocdev.gov.za<br><br>Thabo Mofutsanyana: Please forward your application quoting the relevant reference number, Department of Social Development, Corner of Moremoholo & Setai Street, Old FDC Building, Setsing, 9870<br>or<br>Email to Recruitment.tmofutsanyana@fssocdev.gov.za<br><br>Fezile Dabi District: Please forward your application quoting the relevant reference number, P.O. Box1122, Kroonstad, 9595<br>or<br>hand deliver to Department of Social Development, KGI Building, 20 Cross Street, Kroonstad<br>or<br>Email to Recruitment.Fdabi@fssocdev.gov.za<br><br>Xhariep District: Please forward your application quoting the relevant reference number, Department of Social Development, 15 Dawid Street Trompsburg, 9913<br>or<br>Email to Recruitment.Xhariep@fssocdev.gov.za<br><br>Thekolohelong Welfare Centre and Boiketlong Old Age Home: Please forward your application quoting the relevant reference number, The Department of Social Development, Private Bag x 20616, Bloemfontein 9300. Attention Ms. M.V. Mophethe – Human Resource Management (Recruitment Section) Old Standard Bank Building.<br>or<br>place applications in an application box at Cnr Charlotte Maxeke and West Burger Street, Old Standard Bank Building, Bloemfontein.<br>or<br>Email to Recruitment@fssocdev.gov.za",
      "enquiries": "Mangaung District: Ms M. Phori at 071 864 5734<br>Lejweleputswa District: Mr Maleme at 071 853 8481<br>Thabo Mofutsanyana District: Ms P Litabe at 066 486 6749<br>Fezile Dabi District: Ms M Martins at 083 443 8343<br>Xhariep District: Mr T Mjacu at 062 464 8445"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION) (X3 POSTS)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Dundee Ref No: DOT 321/2025<br>Cost Centre, Estcourt Ref No: DOT 322/2025",
      "description": "Provide a support and advisory service in respect of the advertising and filling of vacant posts for the Cost Centre, Provide a support service in respect of the control, custody and care of Human Resource Records and Archives, Render a support and advisory service to Cost Centre staff in respect of general benefits and housing, leave matters, Performance Management and Development System, rank and salary related matters and capturing of PERSAL transactions, Provide administrative support and process all documentation required for PILIR and exits from service for the Cost Centre, Perform all HR duties related to Zibambele contractors.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Knowledge of PERSAL, MS Word. MS Excel. MS Access and E-mail, Knowledge of Human Resource Management Policies, Procedures, Prescripts and Regulations, Keep and maintain Act, Knowledge of channels of communication, Knowledge of filing system and National Archives Act 43 of 1996, Knowledge of record Management and Registry procedure, Organizational, decision making and problem solving, Verbal and written communication skills, Ability to interpret directives, Policies and Regulations, Ability to priorities the work, Ability to operate a PC, Ability to communicate with various role players, Problem solving skills, Ability to file correctly, Ability to maintain strict level of confidentiality, The ideal candidate should be strictly confidential, be teamwork orientated and be an innovative thinker. He/ she must also be initiative, responsible and be courteous.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms NS Ndebele Cost Centre, Dundee Tel No: (034) 299 8600<br>Ms N Magubane Cost Centre, Estcourt Tel No: (036) 342 3900"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 323/2025",
      "description": "Implement Human Resource Administration practices. Address Human Resource Administration enquiries. Provide Personnel Administration clerical support services within the component. Provide Financial Administration support services in the component.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Knowledge of registry duties, practices as well as the ability to capture. Working knowledge and understanding of the Legislative framework. Knowledge of storage and retrieval procedures in terms of the working environment. Understanding of the work in registry. Computer Literacy. Planning and organisation skills. Communication skills (Verbal and written). Interpersonal relation skills. Flexibility skills. Teamwork skills. Ability to maintain a strict level of confidentiality. Ability to work under pressure. The ideal candidate should be honest, reliable, innovative, creative, loyal, friendly, efficient and responsible.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms BW Khumalo Tel No: (034) 3284 004"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION): GENERAL BENEFITS",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 324/2025",
      "description": "Processing of all matters related to general benefits. Processing of leave and resultant payments and the maintenance of registers. Processing of all rank and salary related matters, Maintenance of computerized data, statistics and personal records. Provide information, guidance and assistance to other directorates with regard to the work in the Benefits Section and to ensure the correct application of policies and procedures.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4. Knowledge, Skills and Competencies Required: Knowledge of human resource management policies, procedures, practices and prescripts, Knowledge of computer based HR Information systems e.g PERSAL, Knowledge and ability to keep and maintain acts, regulations etc, Computer literacy (MS Word, MS Excel, E-mail), Ability to interpret and apply policy and regulations, Problem solving skills, Good communication skills (both verbal and written), The ideal candidate must be team work orientated, open minded i.e. receptive to suggestion and ideas, an innovative thinker, show initiative, be responsible and courteous.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms NP Mwelase Tel No: (033) 355 8742"
    },

    {
      "title": "ADMINISTRATION CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 325/2025",
      "description": "Provide administrative support to the Security Services Directorate. Provide support on the development on the contingency plan. Provide a clerical support service to the Security Services Directorate. Render and provide physical and operational security services.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4; plus, A valid driver’s licence (minimum Code B). Knowledge, Skills and Competencies Required: Ability to conduct security assessments, Knowledge of Minimum Information Security Standards Act of 1996, Knowledge of Minimum Physical Security Standards Act of 2009 and National Key Points Act, Knowledge of control of Access to Public Premises & Vehicles Act, Knowledge of Occupational Health and Safety Act of 1993. Knowledge of Safety at Sport and Recreational Events Act of 2010 and Occupational Health and Safety South African National Standards, Computer literacy. Good planning, organising and coordinating skills. Understanding of Security Threat and Risk Assessment, Problem solving and decision-making skills. Good communication and interpersonal skills. The ideal candidate should be trustworthy, reliable, have integrity, manage time effectively and behave ethically.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr B Tibe Tel No: (033) 355 8088"
    },

    {
      "title": "FINANCE CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 326/2025",
      "description": "Render Financial Accounting transactions. Perform Salary Administration support services. Perform Bookkeeping support services. Render a budget support service.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Basic knowledge of Financial functions, practices as well as the ability to capture data, operate a computer and collate Financial statistics. Basic knowledge of and insight of the Public Service Financial legislations, procedures and Treasury regulations (PFMA, DORA, PSA, PSR, PPPFA & Financial manual). Knowledge of basic Financial Operating systems (PERSAL, BAS & Logis etc.). Job knowledge. Communication skills (verbal and written). Interpersonal relation skills. Flexibility skills. Teamwork skills. Accuracy skills. Aptitude figures skills. Planning and organisation skills. Language skills. Basic Numeracy skills. Ability to perform routine tasks. Ability to operate office equipment. Planning and Organisation skills. Ability to interpret. Research skills. Formulating and editing skills. Analytical and Innovative thinking skills. Report writing and formulation skills. Problem solving skills. Computer Literacy. The ideal candidate should be honest, reliable, innovative, creative, trustworthy, loyal, efficient, responsible and friendly. He/ she should be able to work under pressure, maintain confidentiality and work individually and part of a team.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms N Magubane Tel No: (036) 3523 153"
    },

    {
      "title": "PRINCIPAL AUXILIARY SERVICES OFFICER",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 327/2025",
      "description": "Map accurate road and feature position for the region, Carry out road network queries, Place and replace kilometer post positions and other setting out positions as required, Advise management on technical problems, Provide training and assist with compiling procedure manuals.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4; plus, A minimum of 1 year experience in Road logging, GPS Mapping; plus, A valid driver’s license (Minimum code B). Knowledge, Skills and Competencies Required: Knowledge of the Roads Act & Regulations, Knowledge of the Provincial Road System, Extensive knowledge of all principals and methods of Road Logging, Skills in operating GPS equipment, Skills in GPS computer software including Pathfinder Office and Terra Sync, Driving skills, Map reading and navigation skills, Record and manage road logging projects skills, The ideal candidate should have perseverance, be flexible, have enthusiasm, good interpersonal skills, be reliable and innovative.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr TP Khumalo Tel No: (031) 7926 166"
    },

    {
      "title": "AUXILIARY SERVICES OFFICER: MATERIALS TESTING",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Port Shepstone Ref No: DOT 328/2025<br>Cost Centre, KwaDukuza Ref No: DOT 329/2025<br>Regional Office, Durban Ref No: DOT 330/2025",
      "description": "Coordinate and control the work of Tradesman Aids and give training. Ensure quality control by performing sampling and field control testing. Calculations and reporting of results. Maintenance and use of equipment.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4; plus, A valid driver’s licence (minimum code B). Knowledge, Skills and Competencies Required: Knowledge of standards and procedures as per TMH/TRH, & COLTO., Knowledge of Public Service Regulations, Computer Literacy, Knowledge of safety, General Knowledge of Departmental Road network, Knowledge of Laboratory Equipment, Knowledge of planning, Knowledge of General Admin Functions, Communication (verbal and written) skills, Good Human Relations skills, Problems solving skills, Report writing skills, The ideal candidate should have technical skills, be reliable, teamwork orientated, flexible and have good interpersonal relations.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr R Perumal Tel No: (031) 700 2222"
    },

    {
      "title": "SENIOR AUXILIARY SERVICES OFFICER: GROUND SURVEY",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Port Shepstone Ref No: DOT 331/2025<br>Regional Office, Durban Ref No: DOT 332/2025",
      "description": "Provide assistance with Control Surveys. Provide assistance with Topographical Survey. Provide assistance with setting out. Maintain office, stores, vehicles and other general office duties.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4; plus A valid driver’s licence (minimum code B). Knowledge, Skills and Competencies Required: Knowledge of Public Service Regulations, General Knowledge of Departmental Road network, General Knowledge of trig beacon locations and access routes, Knowledge of batter and profile construction, Writing skills, Communication skills, Interpersonal skills, Leadership skills, Lateral thinking skills, Computer skills, Map reading skills, Navigating GPS skills, The ideal candidate should have technical skills, be reliable, be teamwork orientated, put people first, understanding the practicality of Systems, be results driven, have perseverance, be flexible and be able to work without supervision.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms TM Khumalo Tel No: (031) 792 6166"
    },

    {
      "title": "HANDYMAN: AUXILIARY SERVICES",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 333/2025",
      "description": "Building maintenance. Administrative processors. Operation of tools and equipment. Safety and training.",
      "requirements": "ABET; plus, A valid driver’s licence (Minimum code B). Knowledge, Skills and Competencies Required: Knowledge of clerical duties, switchboard duties, registry duties, practices as well as the ability to capture data, operate computer and collecting statistics, Knowledge and understanding of the legislative framework governing the Public Service, Knowledge of working, storage and retrieval procedures in terms of the working environment, Understanding of work in registry, Ability to interpret legislation / policies, Computer skills, Interpersonal skills, Ability to work in a team, Ability to learn and apply, Planning and organisational skills, Analytical and innovative thinking skills, Problem solving skills, Verbal and written communication skills, The ideal candidate should be responsible, punctual, honest, accurate, reliable, loyal, innovative, be neat and tidy, adhere to Batho Pele principles and comply with code of conduct.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms TC Khumalo Tel No: (032) 437 3800"
    },

    {
      "title": "PROVISIONING ADMINISTRATION CLERK: ACQUISITION AND ASSET VERIFICATION",
      "department": "DEPARTMENT OF JUSTICE AND CONSTITUTIONAL DEVELOPMENT(National Office: Pretoria)",
      "reference_number": "25/05/FMS",
      "description": "Render clerical support; ((Covers both) Compile and maintain records/ databases and/or administrative registers; (Covers both) Check and issue furniture, equipment and accessories to components and individuals; Identify redundant, non-serviceable and obsolete equipment for disposal; Provide Secretariat support to different committees. Verify asset register.",
      "requirements": "Grade 12 certificate or equivalent Skills and Competencies; Computer literacy (MS Word; Excel, Power Point and Outlook); Planning and organizing skills; communication (written and verbal) skills; Interpersonal and organizational skills; Administrative skills; customer service orientated; Integrity.",
      "closing_date": "24 February 2025",
      "application_method": "Post",
      "application_directions": "Quoting the relevant reference number, direct your application to: The Human Resources: Department of Justice and Constitutional Development, Private Bag X81, Pretoria, 0001",
      "enquiries": "Ms. A Van Ross Tel No: (012) 315 1094"
    },
    
    {
      "title": "DRIVER/ MESSENGER",
      "department": "DEPARTMENT OF ROADS AND TRANSPORT (Johannesburg)",
      "reference_number": "REFS/022069",
      "description": "Drive light and medium vehicle to transport passengers and items (mail and documents). Conduct routine maintenance on the allocated vehicle and report defects. Complete all the prescribe records and logbooks with regards to the vehicle and goods. Render a clerical support/ messenger services in the office. Collect and deliver documentation and related items in the Department. Copy, package documents to be scan, bind and fax documents. Keep records of delivered items or goods.",
      "requirements": "Grade 10 or equivalent qualification with at least 1-year relevant experience. A valid Driver`s License is essential. Ability to handle confidential information. Good telephone etiquette. Interpersonal and communication skills (written and Verbal).",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Apply online at http://jobs.gauteng.gov.za",
      "enquiries": "Ms. Mathapelo Makhetha Tel No: (011) 355 7521"
    },

    {
      "title": "FOOD SERVICE AID",
      "department": "DEPARTMENT OF ROADS AND TRANSPORT (Johannesburg)",
      "reference_number": "REFS/022067",
      "description": "Clean kitchen utensils and equipment. Provide catering support services. Keep stock of kitchen utensils and equipment. Apply hygiene and safety measures. Maintain quality control measures of all food provided. Removal of garbage disposal. Prepare food, snack and beverages (water, tea, coffee, milk, sugar and cold drinks). Setup and convey crockery, cutlery and equipment to dining areas. Serve food and beverages. Responsible for food supplies and report waste and losses.",
      "requirements": "NQF level 1 or (Abet level 4 certificate or equivalent). No working experience is required.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Apply online at http://jobs.gauteng.gov.za",
      "enquiries": "Ms. Mathapelo Makhetha Tel No: (011) 355 7521"
    },
    
    {
      "title": "ADMINISTRATIVE OFFICER: ENVIRONMENTAL SERVICES (SUPPORT SERVICES)",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Red Cross War Memorial Children’s Hospital, Rondebosch)",
      "reference_number": "Not specified",
      "description": "Provide efficient and effective management and supervision for the Support Services component and its resources (waste management, pest control, creche, telecommunication, hospital accommodation facilities and grounds, cleaning and hygiene, linen/laundry services and security services). Effective management of out-sourced contract services within Support Services component. Effective management of resources including people management, finance and assets Responsible for supervision of staff including staff performance and disciplinary matters. Training and development of staff.",
      "requirements": "Senior Certificate or equivalent. Experience: Appropriate supervisory experience. Appropriate knowledge and experience within support services with reference to facility management and contract management within Hospital environment. Inherent requirements of the job: Ability to work in every physical demanding environment. Valid (code B/EB) drivers’ licence Willingness to work extra hours and be on standby duties Competencies (knowledge/skills): Good communication, interpersonal and organising skills and ability to supervise multi-disciplinary teams. Independent decision making, problem solving and interpersonal skills. Knowledge of contact management. Knowledge of waste management, pest control serves, creche, telecommunication, cleaning and hygiene, linen/laundry services and security services. Computer literacy (Ms Office, Excel, Word and Outlook). Knowledge of stock control. policies, procedures, service outputs and Service Level Agreements for Outsourced Services.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Ms Z Ndevu Tel No: (021) 658-5078"
    },

    {
      "title": "ADMINISTRATIVE OFFICER: SUPPLY CHAIN MANAGEMENT",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Robertson Hospital)",
      "reference_number": "Not specified",
      "description": "Responsible for overall operational Finance and Supply Chain Management functions ensuring effective and efficient application of procurement policies and processes with the primary responsibility and focus on effective procurement, inventory and asset management. System Management (ensure system controller functions are carried out as well as the maintenance of the system) and approver duties on ePS. Accurate and timeous preparation of reports and assist with the completion of the Annual and Interim Financial statements, ensure audit compliance and handle queries related to Finance and Supply Chain Management. Render a support function to Senior Administration Officer Finance and the Langeberg Sub-district Management. Management off all People Management related functions allocated to the position of Administrative Officer within Finance and Supply Chain Management.",
      "requirements": "Senior Certificate (or equivalent) with Mathematics and/or Accounting as a passed subject and or Senior Certificate (or equivalent) with experience/ competencies that focuses on the Key Performance Areas (KRA’s) of the post Experience: Appropriate and proven experience in Finance and Supply Chain Management. Inherent requirements of the job: Valid (Code B/EB) driver’s licence and willingness to travel. Competencies (knowledge/skills): Extensive knowledge of relevant financial prescripts, departmental policies, delegations and procedures. An aptitude for working with financial figures, good organizational, management and leadership skills. Extensive knowledge and practical experience in Basic Accounting System (BAS), LOGIS/SYSPRO, Electronic Procurement Solutions (ePS) and Microsoft Package (MS Word, MS Excel, MS Outlook, PowerPoint).",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Mr B Jason Tel No: (023) 626-8525"
    },
    
    {
      "title": "ADMINISTRATIVE OFFICER: SUPPLY CHAIN MANAGEMENT",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Head Office, Cape Town)",
      "reference_number": "Not specified",
      "description": "Render an effective, efficient and economic service in all aspects of Inventory and Warehouse Management. Liaise with Chief users with regards to any queries which may arise. Manage inventory, consumable stock levels and Bi-Annual stock take process. Perform all warehouse management functions to ensure the availability of inventory and consumables. Perform disposal management functions with regards to expired/redundant stock. Liaise with end users, and other Governmental Departments regarding Supply Chain matters. Develop and train staff in Supply Chain Management. Manage the performance and development of staff.",
      "requirements": "Senior Certificate. Experience: Appropriate experience in the full spectrum of Supply Chain Management, with the main focus being on Inventory Management and Warehousing. Appropriate warehouse experience in operations. Inherent Requirement of the job: Valid (Code B/EB) driver’s licence. Competencies (knowledge/skills): Supervisory skills. Knowledge of tools for report generation (MS Word, Excel, and PowerPoint, etc.). Good managerial and supervisory skills Good written and verbal communication skills. Knowledge of PFMA, Finance instructions, Treasury regulations, inventory management procedures, warehouse management and electronic materials management system. Knowledge of SYSPRO/LOGIS/MEDSAS. Knowledge and ability to apply the disciplinary code. Computer literacy in Microsoft Package (MS Word, MS Excel, PowerPoint, MS Outlook) Uphold good warehouse practices.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Ms M Barlow, email: Margot.Barlow@westerncape.gov.za"
    },

    {
      "title": "ADMINISTRATION CLERK: HRM (PEOPLE MANAGEMENT)",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Karl Bremer Hospital, Northern/Tygerberg Sub-structure)",
      "reference_number": "Not specified",
      "description": "Provide an efficient and comprehensive personnel and administrative function in line with relevant policy and prescripts. Provide and efficient PERSAL & Salary administration function. Provide an efficient and effective Recruitment and Selection in line with relevant policies and prescripts Maintain effective record keeping. Provide an efficient support function to Supervisor, colleagues and Karl Bremer Hospital by efficient application of People Management Policies.",
      "requirements": "Minimum educational qualification: Senior Certificate (or equivalent). Experience: Appropriate experience in People Management Administration. Competencies (knowledge/skills):Written and verbal communication skills. Computer literacy (MS Word, Excel, PowerPoint, Outlook), numeracy and mathematical skills. Knowledge of the People Management prescripts in the Public Service. Good interpersonal and organisational skills and the ability to function under pressure and meet deadlines.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Mr. G Tilling Tel No: (021) 834-5892"
    },
    
    {
      "title": "ADMINISTRATION CLERK: ADMISSIONS",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Montagu CDC, Langeberg Sub-district)",
      "reference_number": "Not specified",
      "description": "Manage switchboard and Queries /Communication with patients with waiting times and procedures. Restoking of all clinical stationary administration. Precuring of stock and administration of maintenance of equipment. Correct assessment of patients as per UPFS and PGWC billing procedures, amendments and ICD10 coding capturing. Regular archiving of patient folders as per prescripts. Reconciliation, correction and submission of patient statistics.",
      "requirements": "Senior Certificate (or equivalent). Experience: Appropriate experience in a Patient Administration environment, HECTIS and CLINICOM systems. Appropriate experience of working in an emergency environment will be an advantage. Inherent requirements of the job: Willingness to work 12-hour day/night shifts and weekends. Willingness to work overtime when required. Valid (Code B/EB) driver’s licence. Competencies (knowledge/skills): Computer literacy (MS Windows, Word, Excel and Access). Knowledge of EC HECTIS System/ willingness to learn. Knowledge of applicable policies - Hospital Fees memorandum Chapter 18, the Uniform, Patient Fee Schedule (UPFS), Finance Instructions & Medical Records policies. Multitasking in a very busy unit, including emergencies.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Ms C Davids Tel No: (023) 626-8577"
    },
    
    {
      "title": "FOOD SERVICES SUPERVISOR",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Tygerberg Hospital)",
      "reference_number": "Not specified",
      "description": "Support the principal food services supervisors and food service manager or senior in the execution of their tasks. Responsible for hygiene. Supervise and administer physical resources. Assist with meal bookings, meal cards and coding. Implement standard menu, production planning and correct procedures for receipt, storage, preparation, portioning and distribution of meals. Supervise food hygiene guidelines. Allocate tasks and co-ordinate work schedules. Maintain security of kitchen unit and all physical resources and supplies. Supervise and administer activities regarding the meal plan (patients and private patients).",
      "requirements": "General Education and Training Certificate (GETC)/ Grade 9 (Std 7). Experience: Appropriate experience in food service environment. Appropriate supervisory experience. Competencies (knowledge/skills): Literacy with sound numerical skills. Ability to work according to the rules or standards and to meet deadlines. Sound interpersonal communication skills. Knowledge and ability to handle industrial equipment. Knowledge of applicable legislation and policies or nutrition and different diets or large-scale food preparation according to standard recipes. Inherent requirements of the job: Ability to do physical tasks. Be able to work shifts, weekends and public holidays. Ability to work in large scale freezers and cold rooms. The incumbent must be strong enough to lift heavy objects and be on their feet the entire day.",
      "closing_date": "14 February 2024",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Ms R Keyser Tel No: (021) 938-4135"
    },

    {
      "title": "ARTISAN ASSISTANT",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Stellenbosch Sub-district)",
      "reference_number": "Not specified",
      "description": "Assist with repairs and installation of projects, emergency breakdowns. Maintain and repair of plant equipment. Assist in preventive maintenance procedures, such as autoclave, steam generators, water tanks, calorifier and standby generators. Basic plumbing, electrical, carpentry, welding, repairs and installations. Assist with the control and requisitioning of material and parts. Strict adherence to the Occupational Health and Safety Act.",
      "requirements": "Grade 10 (or equivalent). Experience Appropriate handyman experience within a Government Department. Inherent requirements of the job: Valid (Code B/EB) driver’s license Willingness to work overtime when required. Ability to perform standby duties when required. Capability to perform strenuous physical labour. Competencies (knowledge/skills): Ability to function independently, plan (pro-active) and work in a team. Ability to adhere to safety standards.",
      "closing_date": "14 February 2024",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Mr. C. Modisie Tel No: (021) 808-6178"
    },
    
    {
      "title": "PERSONNEL OFFICIAL: PRODUCTION (MOBILITY)",
      "department": "DEPARTMENT OF DEFENCE (Pretoria)",
      "reference_number": "DHRCM/01/04/25/0",
      "description": "Administer and coordinate the appointment of Public Servant Act Personnel (PSAP) on PERSOL System. Capture Senior Management Services (SMS) Performance Management and Development System (PMDS) on PERSOL system. Administer allocation of salary progression of employees not covered by Occupational Specific Dispensation (OSD). Handle acting allowance enquiries. Handle HR issues such as SMS appointments, PSAP detached duty, service conditions, and remuneration and employment matters.",
      "requirements": "Grade 12 Certificate (NQF Level 4) or equivalent. Experience in HR administration will be an added advantage. Special requirements (skills needed): Language proficiency in English (written and verbal). Computer literate. Typing skills, Good communication skills. Good interpersonal skill and organising skills. Knowledge in HR Legislation, policies, practises and procedures. Knowledge of MS Word, Excel and Power Point. Ability to interpret, verify data on PERSOL system. Demonstrate higher level of professionalism. Good telephone etiquette. Client orientated.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Send your application to dhrcmstaffing@gmail.com<br>or<br>Department of Defence, Directorate Human Resource Career Management (PSAP), Private Bag X976, Pretoria, 0001<br>or<br> may be hand-delivered at Bank of Lisbon, 400 Paul Kruger Street, Pretoria",
      "enquiries": "Ms Z.E. Zwane Tel No: (012) 339 5462"
    },

    {
      "title": "PERSONNEL OFFICIAL: PRODUCTION (RECRUITMENT AND SELECTION)",
      "department": "DEPARTMENT OF DEFENCE (Pretoria)",
      "reference_number": "DHRCM/01/04/25/02",
      "description": "Provide an internal consultancy service to colleagues, Line management and clients iro recruitment, selection and appointments matters. Interpret rules and regulations that regulate recruitment, selection and appointment. Prepare and present submission iro filling of vacant post to higher authority. Compile letter of appointment and general staffing enquiries. Provide a personnel administration support with reference to placement of advertisements of vacant post in the Department of Defence (DOD). Conduct administration of Preliminary Vetting and Send submission to DI.",
      "requirements": "Grade 12 Certificate (NQF Level 4) or equivalent. Experience in HR Recruitment and Selection administration will be an added advantage. Special requirements (skills needed): Language proficiency in English (written and verbal). Computer literate. Typing skills. Knowledge of MS Word, Excel and Power Point., Good communication skills. Good interpersonal skill and organising skills. Knowledge in HR Legislation, policies, practises and procedures in the areas of recruitment and selection. Ability to interpret and verify data on PERSOL system. Demonstrate higher level of professionalism. Good telephone etiquette. Client orientated.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, Directorate Human Resource Career Management (PSAP), Private Bag X976, Pretoria, 0001<br>or<br>may be hand-delivered at Bank of Lisbon, 400 Paul Kruger Street, Pretoria, 0001<br>or<br>emailed to dhrcmstaffing@gmail.com",
      "enquiries": "Ms T.N. Gqunu Tel No: (012) 339 5421"
    },

    {
      "title": "SENIOR SECRETARY GRADE II",
      "department": "DEPARTMENT OF DEFENCE (Pretoria)",
      "reference_number": "CDHRM/ 01/04/25/03",
      "description": "Provide a secretarial support service to the Chief Director. Receive telephone calls and refers the calls to the correct role. Record appointments and events in the dairy of the Chief Director. Operate office equipment like fax and photocopying machine. Liaises with travelling agencies to make travelling arrangements for Chief Director. Processes travel and subsistence claims for Chief Director. Follow up the arrangements and discuss with the Chief Director when the relevant documents are received to ensure that the Chief Director endorsed the accommodation prior confirmation. Arrange meetings and events for Chief Director. Book venues, invites role player, organise refreshments and set up schedules for meetings and events. Process all invoices that emanate from activities of the work of the Chief Director. Records basic minutes of the meetings of the Chief Director. Draft routine correspondence and reports. Establish and maintain filing system in the office of the Chief Director. Administers matters like the leave for the Chief Director. Handle the procurement of standard items like stationary, refreshments etc. Collect all relevant documents to enable the Chief Director to prepare for meetings. Manage the correspondences in and out of the Chief Director’s office. Ensure that documents submitted for the Chief Director’s approval adhere to set norms and standards. Remain abreast with the procedures and processes that apply in the DOD to ensure efficient and effective support to the Chief Director. Study the relevant Public Service and departmental prescripts/policies and other documents to ensure that the application thereof is understood properly.",
      "requirements": "A minimum of Grade 12/NQF Level 4. Secretarial experience will be an advantage. Special requirements (skills needed): Language skills and the ability to communication well with people at different levels. Computer literate (MS Word, Excel and Power Point) and good telephone etiquette. Sound organisational skills. Good inter-personal skills. High level of reliability. Good communication skills. Ability to act with tact and discretion.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, Chief Directorate Human Resource Management, Private Bag X976, Pretoria, 0001<br>or<br>hand delivered to: Bank of Lisbon Building, 400 Paul Kruger Street, Pretoria, 0001<br>or<br>emailed to psocdhrm@outlook.com",
      "enquiries": "Lieutenant Colonel J.K. Rapolai Tel No: (012) 339 5246"
    },

    {
      "title": "FOOD SERVICE AID II",
      "department": "DEPARTMENT OF DEFENCE (Pretoria)",
      "reference_number": "MILACD/03/04/25/11",
      "description": "Assist in the receipt and storage of all provisions and stock in the food service unit. Preparation and production of all normal and therapeutic diets. Weighing, dishing and distribution of food. Clean all areas, utensils and equipment in the Combined Club. Follow and adhere to health and safety prescripts. Follow and adhere to elementary control measures and standard operating procedures.",
      "requirements": "Assist in the receipt and storage of all provisions and stock in the food service unit. Preparation and production of all normal and therapeutic diets. Weighing, dishing and distribution of food. Clean all areas, utensils and equipment in the Combined Club. Follow and adhere to health and safety prescripts. Follow and adhere to elementary control measures and standard operating procedures.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, defence human Resource Division, Private Bag X2, Saldanha, 7395<br>or<br>hand deliver to: HR Section Military Academy. Main Building room 12, Frans Erasmus Drive, Saldahna, 7395<br>or<br>email to ngwenya@sun.ac.za",
      "enquiries": "Major R.C. Selomo Tel No: (022) 702 3010 or 2Lt M.R. Ngwenya Tel No: (022) 702 3007"
    },

    {
      "title": "CLUSTER MANAGER: COURT INTERPRETING",
      "department": "DEPARTMENT OF JUSTICE AND CONSTITUTIONAL DEVELOPMENT (Magistrate Office, Worcester)",
      "reference_number": "03/2025/WC",
      "description": "Manage the cluster legal interpreting and language services; Develop and implement the legal interpreting and language services business plan for the cluster; Manage both human and non human resources of legal interpreting and language services; Manage training and development of court interpreters; Manage compliance of the code of conduct.",
      "requirements": "NQF level 4/ Grade 12; National Diploma: Legal Interpreting at NQF level 5 or any other relevant tertiary qualification at NQF level 5; Proficiency in English; Proficiency in two or more indigenous languages; Six years practical experience Interpreting of which three (3) years at supervisors’ level; Driver’s license. Skills and Competencies: Communication skills; Listening skills; Interpersonal skills; Time management; Computer literacy; Analytic thinking; Problem solving; Planning and organizing; Confidentiality; Ability to work under pressure.",
      "closing_date": "17 February 2025",
      "application_method": "Post & Hand Delivered",
      "application_directions": "Provincial Office: Private Bag X9171, Cape Town, 8000<br>or<br>physical address: 8 Riebeeck Street, 5th Floor Norton Rose House, Cape Town.",
      "enquiries": "Ms N Jacobs Tel No: (021) 462 5471"
    },

    {
      "title": "OFFICER: SMME POLICY AND OVERSIGHT",
      "department": "DEPARTMENT OF SMALL BUSINESS DEVELOPMENT (Pretoria)",
      "reference_number": "OSP&O",
      "description": "Conduct research on factors impacting growth and sustainability of small businesses. Contribute to the development of policies, strategies and frameworks that supports the development of SMMEs, Cooperatives and informal sector inclusive of but not limited to: SOPs, template, database management, etc. Conduct performance monitoring inspections to determine compliance with policies, strategies and frameworks. Provide general administrative support service to the business unit inclusive of but not limited to: Minutes taking, reporting writing etc. Communicate with stakeholders, clients, management & colleagues: Written, Verbal, and formal presentations/workshops/information sessions.",
      "requirements": "Bachelors Degree (NQF 7) in Public Administration / Business Management / Development Studies / Economics or equivalent / related as recognised by SAQA. 1 year administrative experience in managing meeting arrangements, taking meeting minutes, making travel arrangements, and managing claims. Training in MS Office Packages, Project Management / Office Administration / Management. A valid driver’s licence and security clearance will be considered an added advantage. Have competencies in: Communication (Verbal and Written), Standard Project Management, Client orientation and customer focus, Problem solving and analysis, Standard Service delivery and innovation, Standard Attention to detail and analytical thinking.",
      "closing_date": "14 February 2025 at 16h00",
      "application_method": "Email",
      "application_directions": "Candidates must submit applications to recruitment3@dsbd.gov.za and quote the reference number for the above mentioned position on the subject line (email) when applying i.e. “REF NO: OSP&O",
      "enquiries": "Recruitment office Tel No: (012) 394-5286/1440"
    },

    {
      "title": "REGISTRY CLERK",
      "department": "DEPARTMENT OF ROADS AND TRANSPORT (Johannesburg)",
      "reference_number": "REFS/022065",
      "description": "Provide registry counter services, Attend to clients. Handle telephonic and other enquiries received. Receive and register hand delivered mail/files. Handle incoming and outgoing correspondence by receiving all mail, sorting, registering and dispatching mails and distribute notices on registry issues. Render an effective filing and record management services by opening and closing files according to record classification system. Filing/storing, tracing (electronically/manually) and retrieval of documents and files and complete index cards for all files. Operate office machines in relation to the registry functions by opening and maintaining Franking machine register. Frank post, record money and update register daily. Undertake spot checks on post to ensure no private post is included. Lock post in postbag for messengers to deliver to Post Office. Open & maintain remittance register. Record all valuable articles as prescribed in the remittance register. Registry Clerk Production by handing delivers and signing over remittances to finance. Send wrong remittances back to sender via registered post and record reference number in register. Keep daily record of number of letters franked. Process documents for archiving and/ disposal by electronic scanning of files, sorting and packaging files for archives and distribution, compiling list of documents to be archived and submit to the supervisor and keeping records for archived documents.",
      "requirements": "A grade 12 certificate or equivalent. No experience required. Knowledge and Skills: Interpersonal relations, Flexibility and teamwork, computer, planning and organizing, good verbal and written communication skills.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Please apply online at <a>http://jobs.gauteng.gov.za</a>",
      "enquiries": "Ms. Mathapelo Makhetha Tel No: (011) 355 7521"
    },
    
    {
      "title": "",
      "department": "",
      "reference_number": "",
      "description": "",
      "requirements": "",
      "closing_date": "",
      "application_method": "",
      "application_directions": "",
      "enquiries": ""
    }

]
}
