{"jobs": [
    {
      "title": "DRIVER/ MESSENGER",
      "department": "DEPARTMENT OF ROADS AND TRANSPORT (Johannesburg)",
      "reference_number": "REFS/022069",
      "description": "Drive light and medium vehicle to transport passengers and items (mail and documents). Conduct routine maintenance on the allocated vehicle and report defects. Complete all the prescribe records and logbooks with regards to the vehicle and goods. Render a clerical support/ messenger services in the office. Collect and deliver documentation and related items in the Department. Copy, package documents to be scan, bind and fax documents. Keep records of delivered items or goods.",
      "requirements": "Grade 10 or equivalent qualification with at least 1-year relevant experience. A valid Driver`s License is essential. Ability to handle confidential information. Good telephone etiquette. Interpersonal and communication skills (written and Verbal).",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Apply online at http://jobs.gauteng.gov.za",
      "enquiries": "Ms. Mathapelo Makhetha Tel No: (011) 355 7521"
    },

    {
      "title": "FOOD SERVICE AID",
      "department": "DEPARTMENT OF ROADS AND TRANSPORT (Johannesburg)",
      "reference_number": "REFS/022067",
      "description": "Clean kitchen utensils and equipment. Provide catering support services. Keep stock of kitchen utensils and equipment. Apply hygiene and safety measures. Maintain quality control measures of all food provided. Removal of garbage disposal. Prepare food, snack and beverages (water, tea, coffee, milk, sugar and cold drinks). Setup and convey crockery, cutlery and equipment to dining areas. Serve food and beverages. Responsible for food supplies and report waste and losses.",
      "requirements": "NQF level 1 or (Abet level 4 certificate or equivalent). No working experience is required.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Apply online at http://jobs.gauteng.gov.za",
      "enquiries": "Ms. Mathapelo Makhetha Tel No: (011) 355 7521"
    },
    
    {
      "title": "ADMINISTRATIVE OFFICER: ENVIRONMENTAL SERVICES (SUPPORT SERVICES)",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Red Cross War Memorial Children’s Hospital, Rondebosch)",
      "reference_number": "Not specified",
      "description": "Provide efficient and effective management and supervision for the Support Services component and its resources (waste management, pest control, creche, telecommunication, hospital accommodation facilities and grounds, cleaning and hygiene, linen/laundry services and security services). Effective management of out-sourced contract services within Support Services component. Effective management of resources including people management, finance and assets Responsible for supervision of staff including staff performance and disciplinary matters. Training and development of staff.",
      "requirements": "Senior Certificate or equivalent. Experience: Appropriate supervisory experience. Appropriate knowledge and experience within support services with reference to facility management and contract management within Hospital environment. Inherent requirements of the job: Ability to work in every physical demanding environment. Valid (code B/EB) drivers’ licence Willingness to work extra hours and be on standby duties Competencies (knowledge/skills): Good communication, interpersonal and organising skills and ability to supervise multi-disciplinary teams. Independent decision making, problem solving and interpersonal skills. Knowledge of contact management. Knowledge of waste management, pest control serves, creche, telecommunication, cleaning and hygiene, linen/laundry services and security services. Computer literacy (Ms Office, Excel, Word and Outlook). Knowledge of stock control. policies, procedures, service outputs and Service Level Agreements for Outsourced Services.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Ms Z Ndevu Tel No: (021) 658-5078"
    },

    {
      "title": "ADMINISTRATIVE OFFICER: SUPPLY CHAIN MANAGEMENT",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Robertson Hospital)",
      "reference_number": "Not specified",
      "description": "Responsible for overall operational Finance and Supply Chain Management functions ensuring effective and efficient application of procurement policies and processes with the primary responsibility and focus on effective procurement, inventory and asset management. System Management (ensure system controller functions are carried out as well as the maintenance of the system) and approver duties on ePS. Accurate and timeous preparation of reports and assist with the completion of the Annual and Interim Financial statements, ensure audit compliance and handle queries related to Finance and Supply Chain Management. Render a support function to Senior Administration Officer Finance and the Langeberg Sub-district Management. Management off all People Management related functions allocated to the position of Administrative Officer within Finance and Supply Chain Management.",
      "requirements": "Senior Certificate (or equivalent) with Mathematics and/or Accounting as a passed subject and or Senior Certificate (or equivalent) with experience/ competencies that focuses on the Key Performance Areas (KRA’s) of the post Experience: Appropriate and proven experience in Finance and Supply Chain Management. Inherent requirements of the job: Valid (Code B/EB) driver’s licence and willingness to travel. Competencies (knowledge/skills): Extensive knowledge of relevant financial prescripts, departmental policies, delegations and procedures. An aptitude for working with financial figures, good organizational, management and leadership skills. Extensive knowledge and practical experience in Basic Accounting System (BAS), LOGIS/SYSPRO, Electronic Procurement Solutions (ePS) and Microsoft Package (MS Word, MS Excel, MS Outlook, PowerPoint).",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Mr B Jason Tel No: (023) 626-8525"
    },
    
    {
      "title": "ADMINISTRATIVE OFFICER: SUPPLY CHAIN MANAGEMENT",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Head Office, Cape Town)",
      "reference_number": "Not specified",
      "description": "Render an effective, efficient and economic service in all aspects of Inventory and Warehouse Management. Liaise with Chief users with regards to any queries which may arise. Manage inventory, consumable stock levels and Bi-Annual stock take process. Perform all warehouse management functions to ensure the availability of inventory and consumables. Perform disposal management functions with regards to expired/redundant stock. Liaise with end users, and other Governmental Departments regarding Supply Chain matters. Develop and train staff in Supply Chain Management. Manage the performance and development of staff.",
      "requirements": "Senior Certificate. Experience: Appropriate experience in the full spectrum of Supply Chain Management, with the main focus being on Inventory Management and Warehousing. Appropriate warehouse experience in operations. Inherent Requirement of the job: Valid (Code B/EB) driver’s licence. Competencies (knowledge/skills): Supervisory skills. Knowledge of tools for report generation (MS Word, Excel, and PowerPoint, etc.). Good managerial and supervisory skills Good written and verbal communication skills. Knowledge of PFMA, Finance instructions, Treasury regulations, inventory management procedures, warehouse management and electronic materials management system. Knowledge of SYSPRO/LOGIS/MEDSAS. Knowledge and ability to apply the disciplinary code. Computer literacy in Microsoft Package (MS Word, MS Excel, PowerPoint, MS Outlook) Uphold good warehouse practices.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Ms M Barlow, email: Margot.Barlow@westerncape.gov.za"
    },

    {
      "title": "ADMINISTRATION CLERK: HRM (PEOPLE MANAGEMENT)",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Karl Bremer Hospital, Northern/Tygerberg Sub-structure)",
      "reference_number": "Not specified",
      "description": "Provide an efficient and comprehensive personnel and administrative function in line with relevant policy and prescripts. Provide and efficient PERSAL & Salary administration function. Provide an efficient and effective Recruitment and Selection in line with relevant policies and prescripts Maintain effective record keeping. Provide an efficient support function to Supervisor, colleagues and Karl Bremer Hospital by efficient application of People Management Policies.",
      "requirements": "Minimum educational qualification: Senior Certificate (or equivalent). Experience: Appropriate experience in People Management Administration. Competencies (knowledge/skills):Written and verbal communication skills. Computer literacy (MS Word, Excel, PowerPoint, Outlook), numeracy and mathematical skills. Knowledge of the People Management prescripts in the Public Service. Good interpersonal and organisational skills and the ability to function under pressure and meet deadlines.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Mr. G Tilling Tel No: (021) 834-5892"
    },
    
    {
      "title": "ADMINISTRATION CLERK: ADMISSIONS",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Montagu CDC, Langeberg Sub-district)",
      "reference_number": "Not specified",
      "description": "Manage switchboard and Queries /Communication with patients with waiting times and procedures. Restoking of all clinical stationary administration. Precuring of stock and administration of maintenance of equipment. Correct assessment of patients as per UPFS and PGWC billing procedures, amendments and ICD10 coding capturing. Regular archiving of patient folders as per prescripts. Reconciliation, correction and submission of patient statistics.",
      "requirements": "Senior Certificate (or equivalent). Experience: Appropriate experience in a Patient Administration environment, HECTIS and CLINICOM systems. Appropriate experience of working in an emergency environment will be an advantage. Inherent requirements of the job: Willingness to work 12-hour day/night shifts and weekends. Willingness to work overtime when required. Valid (Code B/EB) driver’s licence. Competencies (knowledge/skills): Computer literacy (MS Windows, Word, Excel and Access). Knowledge of EC HECTIS System/ willingness to learn. Knowledge of applicable policies - Hospital Fees memorandum Chapter 18, the Uniform, Patient Fee Schedule (UPFS), Finance Instructions & Medical Records policies. Multitasking in a very busy unit, including emergencies.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Ms C Davids Tel No: (023) 626-8577"
    },
    
    {
      "title": "FOOD SERVICES SUPERVISOR",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Tygerberg Hospital)",
      "reference_number": "Not specified",
      "description": "Support the principal food services supervisors and food service manager or senior in the execution of their tasks. Responsible for hygiene. Supervise and administer physical resources. Assist with meal bookings, meal cards and coding. Implement standard menu, production planning and correct procedures for receipt, storage, preparation, portioning and distribution of meals. Supervise food hygiene guidelines. Allocate tasks and co-ordinate work schedules. Maintain security of kitchen unit and all physical resources and supplies. Supervise and administer activities regarding the meal plan (patients and private patients).",
      "requirements": "General Education and Training Certificate (GETC)/ Grade 9 (Std 7). Experience: Appropriate experience in food service environment. Appropriate supervisory experience. Competencies (knowledge/skills): Literacy with sound numerical skills. Ability to work according to the rules or standards and to meet deadlines. Sound interpersonal communication skills. Knowledge and ability to handle industrial equipment. Knowledge of applicable legislation and policies or nutrition and different diets or large-scale food preparation according to standard recipes. Inherent requirements of the job: Ability to do physical tasks. Be able to work shifts, weekends and public holidays. Ability to work in large scale freezers and cold rooms. The incumbent must be strong enough to lift heavy objects and be on their feet the entire day.",
      "closing_date": "14 February 2024",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Ms R Keyser Tel No: (021) 938-4135"
    },

    {
      "title": "ARTISAN ASSISTANT",
      "department": "WESTERN CAPE DEPARTMENT OF HEALTH AND WELLNESS(Stellenbosch Sub-district)",
      "reference_number": "Not specified",
      "description": "Assist with repairs and installation of projects, emergency breakdowns. Maintain and repair of plant equipment. Assist in preventive maintenance procedures, such as autoclave, steam generators, water tanks, calorifier and standby generators. Basic plumbing, electrical, carpentry, welding, repairs and installations. Assist with the control and requisitioning of material and parts. Strict adherence to the Occupational Health and Safety Act.",
      "requirements": "Grade 10 (or equivalent). Experience Appropriate handyman experience within a Government Department. Inherent requirements of the job: Valid (Code B/EB) driver’s license Willingness to work overtime when required. Ability to perform standby duties when required. Capability to perform strenuous physical labour. Competencies (knowledge/skills): Ability to function independently, plan (pro-active) and work in a team. Ability to adhere to safety standards.",
      "closing_date": "14 February 2024",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”).",
      "enquiries": "Mr. C. Modisie Tel No: (021) 808-6178"
    },
    
    {
      "title": "PERSONNEL OFFICIAL: PRODUCTION (MOBILITY)",
      "department": "DEPARTMENT OF DEFENCE (Pretoria)",
      "reference_number": "DHRCM/01/04/25/0",
      "description": "Administer and coordinate the appointment of Public Servant Act Personnel (PSAP) on PERSOL System. Capture Senior Management Services (SMS) Performance Management and Development System (PMDS) on PERSOL system. Administer allocation of salary progression of employees not covered by Occupational Specific Dispensation (OSD). Handle acting allowance enquiries. Handle HR issues such as SMS appointments, PSAP detached duty, service conditions, and remuneration and employment matters.",
      "requirements": "Grade 12 Certificate (NQF Level 4) or equivalent. Experience in HR administration will be an added advantage. Special requirements (skills needed): Language proficiency in English (written and verbal). Computer literate. Typing skills, Good communication skills. Good interpersonal skill and organising skills. Knowledge in HR Legislation, policies, practises and procedures. Knowledge of MS Word, Excel and Power Point. Ability to interpret, verify data on PERSOL system. Demonstrate higher level of professionalism. Good telephone etiquette. Client orientated.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Send your application to dhrcmstaffing@gmail.com<br>or<br>Department of Defence, Directorate Human Resource Career Management (PSAP), Private Bag X976, Pretoria, 0001<br>or<br> may be hand-delivered at Bank of Lisbon, 400 Paul Kruger Street, Pretoria",
      "enquiries": "Ms Z.E. Zwane Tel No: (012) 339 5462"
    },

    {
      "title": "PERSONNEL OFFICIAL: PRODUCTION (RECRUITMENT AND SELECTION)",
      "department": "DEPARTMENT OF DEFENCE (Pretoria)",
      "reference_number": "DHRCM/01/04/25/02",
      "description": "Provide an internal consultancy service to colleagues, Line management and clients iro recruitment, selection and appointments matters. Interpret rules and regulations that regulate recruitment, selection and appointment. Prepare and present submission iro filling of vacant post to higher authority. Compile letter of appointment and general staffing enquiries. Provide a personnel administration support with reference to placement of advertisements of vacant post in the Department of Defence (DOD). Conduct administration of Preliminary Vetting and Send submission to DI.",
      "requirements": "Grade 12 Certificate (NQF Level 4) or equivalent. Experience in HR Recruitment and Selection administration will be an added advantage. Special requirements (skills needed): Language proficiency in English (written and verbal). Computer literate. Typing skills. Knowledge of MS Word, Excel and Power Point., Good communication skills. Good interpersonal skill and organising skills. Knowledge in HR Legislation, policies, practises and procedures in the areas of recruitment and selection. Ability to interpret and verify data on PERSOL system. Demonstrate higher level of professionalism. Good telephone etiquette. Client orientated.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, Directorate Human Resource Career Management (PSAP), Private Bag X976, Pretoria, 0001<br>or<br>may be hand-delivered at Bank of Lisbon, 400 Paul Kruger Street, Pretoria, 0001<br>or<br>emailed to dhrcmstaffing@gmail.com",
      "enquiries": "Ms T.N. Gqunu Tel No: (012) 339 5421"
    },

    {
      "title": "SENIOR SECRETARY GRADE II",
      "department": "DEPARTMENT OF DEFENCE (Pretoria)",
      "reference_number": "CDHRM/ 01/04/25/03",
      "description": "Provide a secretarial support service to the Chief Director. Receive telephone calls and refers the calls to the correct role. Record appointments and events in the dairy of the Chief Director. Operate office equipment like fax and photocopying machine. Liaises with travelling agencies to make travelling arrangements for Chief Director. Processes travel and subsistence claims for Chief Director. Follow up the arrangements and discuss with the Chief Director when the relevant documents are received to ensure that the Chief Director endorsed the accommodation prior confirmation. Arrange meetings and events for Chief Director. Book venues, invites role player, organise refreshments and set up schedules for meetings and events. Process all invoices that emanate from activities of the work of the Chief Director. Records basic minutes of the meetings of the Chief Director. Draft routine correspondence and reports. Establish and maintain filing system in the office of the Chief Director. Administers matters like the leave for the Chief Director. Handle the procurement of standard items like stationary, refreshments etc. Collect all relevant documents to enable the Chief Director to prepare for meetings. Manage the correspondences in and out of the Chief Director’s office. Ensure that documents submitted for the Chief Director’s approval adhere to set norms and standards. Remain abreast with the procedures and processes that apply in the DOD to ensure efficient and effective support to the Chief Director. Study the relevant Public Service and departmental prescripts/policies and other documents to ensure that the application thereof is understood properly.",
      "requirements": "A minimum of Grade 12/NQF Level 4. Secretarial experience will be an advantage. Special requirements (skills needed): Language skills and the ability to communication well with people at different levels. Computer literate (MS Word, Excel and Power Point) and good telephone etiquette. Sound organisational skills. Good inter-personal skills. High level of reliability. Good communication skills. Ability to act with tact and discretion.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, Chief Directorate Human Resource Management, Private Bag X976, Pretoria, 0001<br>or<br>hand delivered to: Bank of Lisbon Building, 400 Paul Kruger Street, Pretoria, 0001<br>or<br>emailed to psocdhrm@outlook.com",
      "enquiries": "Lieutenant Colonel J.K. Rapolai Tel No: (012) 339 5246"
    },

    {
      "title": "FOOD SERVICE AID II",
      "department": "DEPARTMENT OF DEFENCE (Pretoria)",
      "reference_number": "MILACD/03/04/25/11",
      "description": "Assist in the receipt and storage of all provisions and stock in the food service unit. Preparation and production of all normal and therapeutic diets. Weighing, dishing and distribution of food. Clean all areas, utensils and equipment in the Combined Club. Follow and adhere to health and safety prescripts. Follow and adhere to elementary control measures and standard operating procedures.",
      "requirements": "Assist in the receipt and storage of all provisions and stock in the food service unit. Preparation and production of all normal and therapeutic diets. Weighing, dishing and distribution of food. Clean all areas, utensils and equipment in the Combined Club. Follow and adhere to health and safety prescripts. Follow and adhere to elementary control measures and standard operating procedures.",
      "closing_date": "14 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, defence human Resource Division, Private Bag X2, Saldanha, 7395<br>or<br>hand deliver to: HR Section Military Academy. Main Building room 12, Frans Erasmus Drive, Saldahna, 7395<br>or<br>email to ngwenya@sun.ac.za",
      "enquiries": "Major R.C. Selomo Tel No: (022) 702 3010 or 2Lt M.R. Ngwenya Tel No: (022) 702 3007"
    },

    {
      "title": "CLUSTER MANAGER: COURT INTERPRETING",
      "department": "DEPARTMENT OF JUSTICE AND CONSTITUTIONAL DEVELOPMENT (Magistrate Office, Worcester)",
      "reference_number": "03/2025/WC",
      "description": "Manage the cluster legal interpreting and language services; Develop and implement the legal interpreting and language services business plan for the cluster; Manage both human and non human resources of legal interpreting and language services; Manage training and development of court interpreters; Manage compliance of the code of conduct.",
      "requirements": "NQF level 4/ Grade 12; National Diploma: Legal Interpreting at NQF level 5 or any other relevant tertiary qualification at NQF level 5; Proficiency in English; Proficiency in two or more indigenous languages; Six years practical experience Interpreting of which three (3) years at supervisors’ level; Driver’s license. Skills and Competencies: Communication skills; Listening skills; Interpersonal skills; Time management; Computer literacy; Analytic thinking; Problem solving; Planning and organizing; Confidentiality; Ability to work under pressure.",
      "closing_date": "17 February 2025",
      "application_method": "Post & Hand Delivered",
      "application_directions": "Provincial Office: Private Bag X9171, Cape Town, 8000<br>or<br>physical address: 8 Riebeeck Street, 5th Floor Norton Rose House, Cape Town.",
      "enquiries": "Ms N Jacobs Tel No: (021) 462 5471"
    },

    {
      "title": "OFFICER: SMME POLICY AND OVERSIGHT",
      "department": "DEPARTMENT OF SMALL BUSINESS DEVELOPMENT (Pretoria)",
      "reference_number": "OSP&O",
      "description": "Conduct research on factors impacting growth and sustainability of small businesses. Contribute to the development of policies, strategies and frameworks that supports the development of SMMEs, Cooperatives and informal sector inclusive of but not limited to: SOPs, template, database management, etc. Conduct performance monitoring inspections to determine compliance with policies, strategies and frameworks. Provide general administrative support service to the business unit inclusive of but not limited to: Minutes taking, reporting writing etc. Communicate with stakeholders, clients, management & colleagues: Written, Verbal, and formal presentations/workshops/information sessions.",
      "requirements": "Bachelors Degree (NQF 7) in Public Administration / Business Management / Development Studies / Economics or equivalent / related as recognised by SAQA. 1 year administrative experience in managing meeting arrangements, taking meeting minutes, making travel arrangements, and managing claims. Training in MS Office Packages, Project Management / Office Administration / Management. A valid driver’s licence and security clearance will be considered an added advantage. Have competencies in: Communication (Verbal and Written), Standard Project Management, Client orientation and customer focus, Problem solving and analysis, Standard Service delivery and innovation, Standard Attention to detail and analytical thinking.",
      "closing_date": "14 February 2025 at 16h00",
      "application_method": "Email",
      "application_directions": "Candidates must submit applications to recruitment3@dsbd.gov.za and quote the reference number for the above mentioned position on the subject line (email) when applying i.e. “REF NO: OSP&O",
      "enquiries": "Recruitment office Tel No: (012) 394-5286/1440"
    },

    {
      "title": "REGISTRY CLERK",
      "department": "DEPARTMENT OF ROADS AND TRANSPORT (Johannesburg)",
      "reference_number": "REFS/022065",
      "description": "Provide registry counter services, Attend to clients. Handle telephonic and other enquiries received. Receive and register hand delivered mail/files. Handle incoming and outgoing correspondence by receiving all mail, sorting, registering and dispatching mails and distribute notices on registry issues. Render an effective filing and record management services by opening and closing files according to record classification system. Filing/storing, tracing (electronically/manually) and retrieval of documents and files and complete index cards for all files. Operate office machines in relation to the registry functions by opening and maintaining Franking machine register. Frank post, record money and update register daily. Undertake spot checks on post to ensure no private post is included. Lock post in postbag for messengers to deliver to Post Office. Open & maintain remittance register. Record all valuable articles as prescribed in the remittance register. Registry Clerk Production by handing delivers and signing over remittances to finance. Send wrong remittances back to sender via registered post and record reference number in register. Keep daily record of number of letters franked. Process documents for archiving and/ disposal by electronic scanning of files, sorting and packaging files for archives and distribution, compiling list of documents to be archived and submit to the supervisor and keeping records for archived documents.",
      "requirements": "A grade 12 certificate or equivalent. No experience required. Knowledge and Skills: Interpersonal relations, Flexibility and teamwork, computer, planning and organizing, good verbal and written communication skills.",
      "closing_date": "14 February 2025",
      "application_method": "Online",
      "application_directions": "Please apply online at <a>http://jobs.gauteng.gov.za</a>",
      "enquiries": "Ms. Mathapelo Makhetha Tel No: (011) 355 7521"
    },
    
    {
      "title": "",
      "department": "",
      "reference_number": "",
      "description": "",
      "requirements": "",
      "closing_date": "",
      "application_method": "",
      "application_directions": "",
      "enquiries": ""
    }

]
}
