{"jobs": [
    {
      "title": "CASHIERS: REVENUE CLERKS (X56 POSTS)",
      "department": "DEPARTMENT OF TRANSPORT SAFETY AND LIAISON<br>Registering Authority: Groblershoop (!Kheis local municipality) (X2 Posts)<br>Postmasburg (Tsantsabane local municipality) (X2 Posts)<br>Danielskuil (Kgatelopele local municipality) (X2 Posts)<br>Upington (Dawid Kruiper local municipality) (X3 Posts)<br>Keimoes (Kai !Garib local municipality) (X2 Posts)<br>Kakamas (Kai !Garib local municipality) (X2 Posts)<br>Pofadder (Khai – Ma local municipality) (X2 Posts)<br>Springbok (Namakhoi local municipality) (X2 Posts)<br>Calvinia (Hantam local municipality) (X2 Posts)<br>Loriesfontein (Hantam local municipality) (X2 Posts)<br>Colesberg (Umsobomvu local municipality) (x2 Posts)<br>De Aar (Emthanjeni local municipality) (X2 Posts)<br>Carnavon (Kareeberg local municipality) (X2 Posts)<br>Richmond (Ubuntu local municipality) (X2 Posts)<br>Hopetown (Thembelihle local municipality) (X2 Posts)<br>Fraserburg (Karoo Hoogland local municipality) (X2 Posts)<br>Sutherland (Karoo Hoogland local municipality) (X2 Posts)<br>Williston (Karoo Hoogland local municipality) (X2 Posts)<br>Kathu (Gamagara local municipality) (X2 Posts)<br>Olifantshoek (Gamagara local municipality) (X2 Posts)<br>Mothibistad (Ga-Segonyana local municipality) (X2 Posts)<br>Churchill (Joe Morolong local municipality) (X4 Posts)<br>Kimberley (Sol Plaatje local municipality) (X6 Posts)<br>Barkley West (Dikgatlong local municipality) (X2 Posts)<br>Jan Kempdorp (Phokwane local municipality) (X2 Posts)",
      "reference_number": "S4.1 /02 /12",
      "description": "Perform the Motor vehicle licensing renewal function Perform daily cash-up duties Filing and safeguarding of all revenue documents generated or received Performing Transaction on National Traffic Information System (NaTIS) Handling general and NaTIS related enquiries from clients To maintain high level of professional ethics The successful candidates will be expected to sign a contract of confidentiality, National Code of Conduct, Disciplinary Code on procedures in the Public Service and the NaTIS Undertaking (NUU).",
      "requirements": "Grade 12 Computer Literacy No criminal record The following will serve as recommendations: Good interpersonal skills, verbal and written communications skill Ability to work under pressure and display initiative, time management and innovation to promote service delivery.",
      "closing_date": "14 March 2025",
      "application_method": "Post & Email",
      "application_directions": "Applications stating the relevant reference number must be sent to: Head of Department: Department of Transport, Safety and Liaison, T&I,69 Memorial Road, Kimberley, 8300.<br>Email: dtsl_recruitment@ncpg.gov.za.<br>FOR ATTENTION : Ms.J.J.Jafta<br>-Note- in line with DPSA Circular 19 of 2022, applicants are submitting Z83 and CV Only",
      "enquiries": "Ms.K Paai at 081 2383 332<br>Ms. J Jafta at 069 224 6157"
    },
    
    {
      "title": "DRIVER/MESSENGER",
      "department": "PROVINCIAL TREASURY(Mmabatho)",
      "reference_number": "NWFIN/2025/02",
      "description": "Drive light and medium-sized motor vehicles to transport employees in the office of the executive authority and guests of the executive authority. Collect and deliver items. To collect and dispatch mail and newspapers. Delivery of documents and proper records keeping. Verify documents when collected and delivered to the Executive Authority. Ensure Proper logistical arrangements for distribution of documentation (logbook, route forms, safekeeping of keys, parking of vehicle in parking bay). Perform other duties as delegated. Routine maintenance of the allocated vehicle and report defects timely. It will be required to work overtime from time to time.",
      "requirements": "As a minimum Grade 12 or equivalent NQF 4 qualification. Valid driver’s licence minimum code 08 is compulsory. Valid Professional Driving Permit (PDP) licence will be added advantage. Knowledge of traffic rules and laws. Knowledge of applicable policies and procedures government vehicles. Time management skills, good communication and writing skills. Good interpersonal skills. Ability to maintain high level of professionalism, confidentiality, and reliability. Ability to work with a team. Exposure in administration, Computer literacy. Ability to uphold confidentiality and discipline requisite to the Executive Authority related work environment. Ability to respect Authority.",
      "closing_date": "07 March 2025 at 16h00.",
      "application_method": "Post & Email",
      "application_directions": "Applications should be forwarded to: The Director: Human Resource Management, North-West Provincial Treasury, Private Bag X2060, Mmabatho 2735, marked for attention: JM Moheta, K Chuma, or N Marengwa, 2nd Floor, Garona Building.<br>You can also email your application to ptvacancies@nwpg.gov.za.<br>The maximum limit is 35MB for applications to be transmitted successfully, otherwise you will have to send more than one email. When you submit by email, please put the reference number and post job title in the subject line. The reference number should be indicated on the application. If you apply for more than 1 post, please submit separate applications for each post that you apply for. Applications should be submitted on time.",
      "enquiries": "Mr. K Selebalo Tel No: (018) 388 2301"
    },
    
    {
      "title": "FOOD AID (CLEANER)",
      "department": "PROVINCIAL TREASURY(Mmabatho)",
      "reference_number": "NWFIN/2025/03",
      "description": "Provide cleaning services in the offices of the Executive Authority. Cleaning offices, corridors, and boardrooms. Cleaning of kitchen and restroom. Keep and maintain cleaning machines and equipment. Provide logical support services during meetings and workshops such as providing tea and coffee. Create a clean working environment. Perform other duties as delegated. It will be required to work overtime from time to time.",
      "requirements": "As a minimum a Grade 10 and/ or ABET Level 1-4. Know how to operate elementary cleaning machines and equipment. Good communications skills, writing skills, teamwork, and interpersonal relations skills. Personal attributes such as honesty, integrity, flexibility, professionalism, and team player are required. Willingness to work extra hours when required.",
      "closing_date": "07 March 2025 at 16h00.",
      "application_method": "Post & Email",
      "application_directions": "Applications should be forwarded to: The Director: Human Resource Management, North-West Provincial Treasury, Private Bag X2060, Mmabatho 2735, marked for attention: JM Moheta, K Chuma, or N Marengwa, 2nd Floor, Garona Building.<br>You can also email your application to ptvacancies@nwpg.gov.za.<br>The maximum limit is 35MB for applications to be transmitted successfully, otherwise you will have to send more than one email. When you submit by email, please put the reference number and post job title in the subject line. The reference number should be indicated on the application. If you apply for more than 1 post, please submit separate applications for each post that you apply for. Applications should be submitted on time.",
      "enquiries": "Mr. K Selebalo Tel No: (018) 388 2301"
    },
    
    {
      "title": "ADMINISTRATION CLERK",
      "department": "WESTERN CAPE WESTERN CAPE EDUCATION DEPARTMENT (WCED)(Kuils River)",
      "reference_number": "10",
      "description": "Render course administration and logistical support for programme delivery. Provide general clerical support services. Provide supply chain clerical support services. Provide financial administration support services.",
      "requirements": "Grade 12 certificate. Proficiency in at least in two or the three official languages of the Western Cape Province. Knowledge: Knowledge of administration duties, practices as well as the ability to capture data, operate computer and collecting information. Knowledge and understanding of the legislative framework governing the Public Service. Knowledge of working procedures in terms of the working environment. Skills: Numeracy | Literacy | Typing | Computer Literacy | Language skills Attention to detail (Accuracy) Planning and organisation Good verbal and written communication 5. Budgeting and finance 6. Flexibility Teamwork.",
      "closing_date": "14 March 2025",
      "application_method": "Online",
      "application_directions": "Applications must be submitted by using the following URL https://wcedonline.westerncape.gov.za/home/, via Google Chrome or Mozilla Firefox.",
      "enquiries": "Ms M September Tel No: (021) 900 5017"
    },
    
    {
      "title": "ADMINISTRATION CLERK: REGISTRY (MEDICAL RECORDS)",
      "department": "DEPARTMENT OF HEALTH AND WELLNESS(Tygerberg Hospital, Parow Valley)",
      "reference_number": "Not Applicable",
      "description": "Batching of all incoming episode folders. Issue and receive folders master file daily. Responsible for archiving all inactive folders. Ensure that folders are prepared correctly. Ensure that folders are scanned as per prescripts. Ensure that folders are being index correctly. Daily re-filing of episodes into yellow folders. File tracking on Hospital Information System and Trace misfiles. Ensure duplicate folders are being merged correctly. Handle of Microfilm as per request. Handle telephone enquiries.",
      "requirements": "Senior Certificate (or equivalent) qualification. Experience: Experience of Medical Records or Registry services. Inherent requirements of the job: Willingness to work shifts. Must be willing to rotate and/or relief personnel. Competencies (knowledge/skills): Computer literacy. Good written and verbal communication skills.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”)",
      "enquiries": "Ms M Xontana Tel No: (021) 938-4512"
    },
    
    {
      "title": "ADMINISTRATION CLERK: HUMAN RESOURCE MANAGEMENT",
      "department": "DEPARTMENT OF HEALTH AND WELLNESS(Tygerberg Hospital, Parow Valley)",
      "reference_number": "Not Applicable",
      "description": "Perform all administrative duties pertaining to personnel administration, e.g. appointments, resignations, transfers, pension administration, salary administration, leave, distribution of payslips, debt management and verify documents and qualifications. Responsible for capturing transactions on PERSAL. Audit personnel and leave records. Handle all personnel enquiries and correspondence (written and verbal). File personnel data, policies, regulations and circulars. Assist with all other administrative functions in the Personnel component.",
      "requirements": "Senior Certificate (or equivalent). Experience: Appropriate experience in Human Resource Management. Appropriate experience regarding the PERSAL salary system. Competencies (knowledge/skills): Good communication skills. Computer literacy (MS Word, Excel, PowerPoint). Basic understanding of Human Resource Management. Knowledge and experience of PERSAL and their relevant functions.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”)",
      "enquiries": "Ms. P Jansen Tel No: (021) 938-4684"
    },
    
    {
      "title": "ADMINISTRATION CLERK: ADMISSIONS",
      "department": "DEPARTMENT OF HEALTH AND WELLNESS(Hermanus Hospital, Overstrand Sub-district)",
      "reference_number": "Not Applicable",
      "description": "Assessment of patients according to the means test when admitting patients, update patient information and ensure availability of patient folders. Responsible for sound cash management for revenue control which includes the receipt of money, issue of accounts, receipt and safekeeping of money. Open and maintain patient folders and loan of patient folders to relevant departments on the Clinicom system. Responsible for handling of patient enquiries. Filing of patient folders and documents daily. Record keeping, trace old folders, compile new folders and destruction of folders. Reporting of IOD and MVA cases.",
      "requirements": "Senior Certificate (or equivalent) with Mathematics and/or Accounting as a passed subject and/or Senior certificate (or equivalent) with experience/competencies that focus on the key performance areas of the post. Experience: Appropriate experience in patient administration/ admissions at a hospital. Inherent requirements of the job: A valid (Code B/EB/C1) driver’s licence. Must be prepared to work 12-hour shifts (i.e. night duty, weekends, public holidays) and work overtime on short notice. Ability to work in a physically demanding environment. Competencies (knowledge/skills): Sound communication skills, with internal and external clients (verbal and written). Numerical skills and the ability to maintain confidentiality. Knowledge of electronic patient administration system Clinicom. Computer literacy in Microsoft (Word, Excel and Outlook). Ability to accept accountability and responsibility and to work independently.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”)",
      "enquiries": "Ms CE Langley Tel No: (028) 312-1166"
    },
    
    {
      "title": "ADMINISTRATIVE OFFICER: SUPPORT SERVICES",
      "department": "DEPARTMENT OF HEALTH AND WELLNESS(Drakenstein Sub-district)",
      "reference_number": "Not Applicable",
      "description": "Control and Manage of Support Services which include Infrastructure, Workshops. Effective Contract management of services delivered by suppliers. Effective management and control of Auxiliary Services. Efficient and effective management of Transport Services. Supervision of respective areas.",
      "requirements": "Senior Certificate (or equivalent). Experience: Appropriate experience in working in Key Performance Areas. Inherent requirement of the job: Valid (Code B/EB) driver’s license. Competencies (knowledge/skills): Excellent interpersonal, communication and organisation skills. Ability to efficiently operate computer programmes such as Microsoft Word, Excel, PowerPoint and E-mail. Knowledge of Contract Management.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”)",
      "enquiries": "Mr. S Adams Tel No: (021) 877-6400"
    },
    
    {
      "title": "HOUSEKEEPING SUPERVISOR",
      "department": "DEPARTMENT OF HEALTH AND WELLNESS(Cape Winelands TB Centre)",
      "reference_number": "Not Applicable",
      "description": "Co-ordinate operational household functions. Correct utilization of resources. Support human resource functions. Effective co-ordination and controlling of all linen in hospital.",
      "requirements": "General Education and Training Certificate (GETC) / Grade 9 (Std 7). Experience: Appropriate cleaning and household experience in a hospital environment and in the use of cleaning equipment and stock. Inherent requirements of the job: Willingness to work in a high occupational health risk environment with blood, infectious diseases, human and medical waste, contaminated linen and sharps. The ability to do physical tasks and operate heavy duty cleaning and household equipment. Ability to work shifts during day and night, weekends and public holiday and overtime when required by supervisor. Competencies (knowledge/skills): Knowledge of Infection Control and Provincial Food Service Policy and disciplinary code of conduct. Good interpersonal relations with supervisor, colleagues. Knowledge of safety and hygiene standards and inventory/stock control.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”)",
      "enquiries": "Ms. L Mampa Tel No: (023) 348-1374"
    },
    
    {
      "title": "ARTISAN ASSISTANT (MECHANICAL)",
      "department": "DEPARTMENT OF HEALTH AND WELLNESS(Head Office, Cape Town, (Metro West Hub, Zwaanswyk, Retreat))",
      "reference_number": "Not Applicable",
      "description": "Perform standby duties. Carry out minor maintenance and repairs of mechanical fixtures and components. Assist with repairs and emergency breakdowns (including after-hours repairs). Assist with the control and requisitioning of material and parts. Clean areas where work has been carried out. Ensure that all tools and materials are available before commencing any tasks. Assist the artisan Cadre in the execution of their respective duties.",
      "requirements": "NQF 3 (Grade 10 or equivalent). Experience: Appropriate experience of maintenance and repairs of mechanical components. Inherent requirements of the job: Ability to operate and use required tools and equipment skilfully and safely. Ability to perform heavy physical labour. A valid (Code B/EB) driver’s licence. Competencies (knowledge/skills): Be conversant with the requirements of the Machinery and Occupational Health and Safety Act.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs (click “online applications”)",
      "enquiries": "Mr K Matthews Tel No: (021) 715 5921"
    },
    
    {
      "title": "SECRETARY",
      "department": "DEPARTMENT OF JUSTICE AND CONSTITUTIONAL DEVELOPMENT(National Office: Pretoria)",
      "reference_number": "25/19/SG",
      "description": "Key Performance Areas: Make travel arrangements, process travel and subsistence claims for the manager and members of the Unit; Render effective and efficient secretarial services; Provide general clerical office administration; Coordinate unit activities inputs and compile various reports; Assist with provisioning requirement of the Directorate; Manage the diary of the Manager.",
      "requirements": "Grade 12 (with typing as a subject with Secretarial Certificate or any other training course/ qualification that will enable the person to perform the work satisfactorily); Knowledge of Financial provisioning and / or Administration procedure and processes; Knowledge of procedure and processes applied in Office Management; Understanding of confidentiality in Government and relevant legislation. Skills and Competencies: Computer literacy (MS Office); Communication skills (verbally and written); Planning and organizing; Intermediate typing skills (ability to do high speed typing and utilize software packages effectively to type more advanced documents which include tables, graphs); Good interpersonal relations and customer service orientation; Ability to correctly interpret relevant documentation.",
      "closing_date": "10 March 2025",
      "application_method": "Post & Online",
      "application_directions": "Interested applicants must submit their applications for employment to https://forms.office.com/r/X2XaVPasWu obtainable using Microsoft edge or the latest Chrome version<br>or<br>Quoting the relevant reference number, direct your application to: Postal address: The Human Resources: Department of Justice and Constitutional Development, Private Bag X81, Pretoria, 0001 or Physical address: Application Box, First Floor Reception, East Tower, Momentum Building, 329 Pretorius Street, Pretoria",
      "enquiries": "Ms A van Ross Tel No: (012) 315 1040"
    },
    
    {
      "title": "REGISTRY CLERK (X2 POSTS)",
      "department": "DEPARTMENT OF WOMEN, YOUTH AND PERSONS WITH DISABILITIES(Pretoria)",
      "reference_number": "DWYPD/004/2025",
      "description": "Provide efficient registry counter services by attending to client queries and handling incoming calls and inquiries; attend to clients, handle telephonic and other enquiries received, receive and register hand delivered mail/files; Manage incoming and outgoing correspondence by receiving, sorting, registering and dispatching mail and official documents; Receive all mail, sort, register and dispatch mail, distribute notices on registry issues; Maintain an and effective filing and record management system; Opening, closing, storing and retrieving files per the approved filing plan, filing/storage, tracing (electronically/manually) and retrieval of documents and files, complete index cards for all files; Operate and maintain office machines including scanners, binding equipment, photocopies for registry functions; Conduct regular file audits and spot checks to ensure compliance with registry protocols and records management policies; undertake spot checks on post to ensure no private post in included, lock post in postbag for messengers to deliver to post Office; Process documents for archiving and/disposal in accordance with the National Archives and records Service Act, including the preparation of list for records transfer; Keep updated registry records, including logs for personal files, incoming and outgoing documents and reference numbers; Assist in travel and logistical arrangements for the ICT staff as required.",
      "requirements": "Grade 12 certificate or equivalent NQF 4 qualifications, No experience required. Knowledge of registry duties, practices as well as the ability to capture data, knowledge of storage and retrieval procedures in terms of the working environment, understanding of the work in registry.",
      "closing_date": "07 March 2025 at 16:00",
      "application_method": "Email",
      "application_directions": "Recruitment02@dwypd.gov.za",
      "enquiries": "Mr John Madela Tel No: (012) 359 0250"
    },
    
    {
      "title": "DRIVER/MESSENGER (X2 POSTS)",
      "department": "DEPARTMENT OF WOMEN, YOUTH AND PERSONS WITH DISABILITIES(Pretoria)",
      "reference_number": "DWYPD/003/2025",
      "description": "Collect and deliver documents; Collect, deliver and distribute documents of the Departments; Transport employee in the Department ensure that employees and guest are transported to their destinations on time, Record kilometres when undertaking a trip; record keeping of the utilisation of the allocated motor vehicle, log sheet and petrol receipts.",
      "requirements": "Applicants must be in possession of a Grade 12 certificate or equivalent NQF 4 qualification, A valid driver’s license, 1-2 years’ experience as a driver/messenger. Knowledge: understanding of road traffic rules and regulations, Skills: Driving skills, Sound organisational skills, language skills and the ability to communicate well with people at different levels and from different backgrounds, basic written communication skills, Computer literacy (MS Office), Good interpersonal skills, General office administrative and clerical skills. Personal Attributes: high level of reliable, high sense of urgency, ability to work effectively under limited supervision, highly motivated, goal orientated and driven, Confidentiality, integrity and ability to act with tact and discretion.",
      "closing_date": "07 March 2025 at 16:00",
      "application_method": "Email",
      "application_directions": "Recruitment03@dwypd.gov.za",
      "enquiries": "Mr Vusimuzi Mahamba Tel No: (012) 359 0204"
    },
    
    {
      "title": "FOOD SERVICE AID (X2 POSTS)",
      "department": "DEPARTMENT OF WOMEN, YOUTH AND PERSONS WITH DISABILITIES(Pretoria)",
      "reference_number": "DWYPD/005/2025",
      "description": "Clean kitchen utensils and equipment, provide catering support services, keep stock of kitchen utensils and equipment, apply hygiene and safety measures, maintain quality control measures of all food provided, removal of garbage disposal, prepare food, snack and beverages (water, tea, coffee, milk sugar and cold drinks, setup and convey crockery, cutlery and equipment to dining areas, serve food and beverages, responsible for food supplies and report waste and losses",
      "requirements": "Applicants must be in possession of NQF 1 and 2 General Certificate/Elementary Certificate, No experience required. Knowledge of repetitive tasks; Basic Skills of Numeracy, Literacy, language and Operating equipment.",
      "closing_date": "07 March 2025 at 16:00",
      "application_method": "Email",
      "application_directions": "Recruitment_268@dwypd.gov.za",
      "enquiries": "Mr Vusimuzi Mahamba Tel No: (012) 359 0240"
    },
    
    {
      "title": "FARM FOREMAN",
      "department": "KWAZULU-NATAL DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(Makhathini Research Farm)",
      "reference_number": "NSC16/2025",
      "description": "Oversee the implementation of routing activities in respect of research and crop production. Ensure execution of routine activities in respect of livestock production and breeding. Perform general routine activities e.g. cleaning of farm building facilities, disposal of waste material, alien weed control etc. Execute general routing activities in respect of infrastructure e.g. maintenance/repair roads, canals, dams drinking troughs, fencing, etc.",
      "requirements": "A Senior Certificate (Matric) and a valid driver’s license. Knowledge: Basic farming activities and of health and safety measures. Skills: Use of basic farm hand tools, cleaning, operating equipment, communication, listening, reading and time management.",
      "closing_date": "07 March 2025",
      "application_method": "Post, Hand Delivered, Online & Email",
      "application_directions": "All applications must be addressed to the Head of Department and for reference numbers starting with SSC may be hand delivered or couriered to 4 Pin Oak Avenue, Hilton, 3245. Applications may also be posted to Private Bag X6005, Hilton, 3245. All applications for reference numbers starting with NSC may be hand delivered or couriered to Lot no. 11634, Corner of Via Verbena and Loop Street, Veldenvlei, Richards Bay, 3900. Applications may also be posted to Private Bag X1048, Richards Bay, 3900. Applicants are discouraged from sending applications through registered mail because the Department will not be responsible for non-collection of these applications. Applicants may also submit their completed and signed Z83 application forms and CV’s directly to the following email addresses: kznjobssouth@kzndard.gov.za for reference numbers starting with SSC OR kznjobsnorth@kzndard.gov.za for reference numbers starting with NSC. Applicants may also visit any one of our Designated Online Application Centres (DOACS) where our friendly staff will assist you with applying online or receiving your hardcopy application. You can find the list of Designated Online Application Centres (DOACS) at www.kznonline.gov.za/kznjobs. Applicants are encouraged to apply for posts through the online e-Recruitment system at www.kznonline.gov.za/kznjobs",
      "enquiries": "Mr M Magawana Tel No: (033) 355 9258"
    },
    
    {
      "title": "SUPPLY CHAIN MANAGEMENT CLERK: FLEET MANAGEMENT",
      "department": "KWAZULU-NATAL DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(North Service Centre – Richards Bay)",
      "reference_number": "NSC17/2025",
      "description": "Provide administrative support for the acquisition of state vehicles. Provide administrative support for the maintenance and repairs of state vehicles. Provide administrative support for the servicing of state vehicles. Allocate fleet and maintain database of state vehicles. Administer the distribution of traffic fines / summons / warrant of arrest.",
      "requirements": "A Senior Certificate (Matric). Knowledge: RSA Constitution, Public Service Act, Public Service Regulations, PFMA, Batho Pele Principles, Basic Conditions of Employment Act, Departmental Policies, Records Management and Filing Systems, clerical duties, practices and ability to capture data. Skills: Computer, planning and organising, language, good verbal and written communication, reliability, honesty, responsible, listening, presentation, interpersonal relations and problem solving.",
      "closing_date": "07 March 2025",
      "application_method": "Post, Hand Delivered, Online & Email",
      "application_directions": "All applications must be addressed to the Head of Department and for reference numbers starting with SSC may be hand delivered or couriered to 4 Pin Oak Avenue, Hilton, 3245. Applications may also be posted to Private Bag X6005, Hilton, 3245. All applications for reference numbers starting with NSC may be hand delivered or couriered to Lot no. 11634, Corner of Via Verbena and Loop Street, Veldenvlei, Richards Bay, 3900. Applications may also be posted to Private Bag X1048, Richards Bay, 3900. Applicants are discouraged from sending applications through registered mail because the Department will not be responsible for non-collection of these applications. Applicants may also submit their completed and signed Z83 application forms and CV’s directly to the following email addresses: kznjobssouth@kzndard.gov.za for reference numbers starting with SSC OR kznjobsnorth@kzndard.gov.za for reference numbers starting with NSC. Applicants may also visit any one of our Designated Online Application Centres (DOACS) where our friendly staff will assist you with applying online or receiving your hardcopy application. You can find the list of Designated Online Application Centres (DOACS) at www.kznonline.gov.za/kznjobs. Applicants are encouraged to apply for posts through the online e-Recruitment system at www.kznonline.gov.za/kznjobs",
      "enquiries": "Ms PC Sithole Tel No: (035) 780 6721"
    },
    
    {
      "title": "HUMAN RESOURCE OFFICER: LEAVE ADMINISTRATION (X2 POSTS)",
      "department": "KWAZULU-NATAL DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT",
      "reference_number": "South Service Centre – Hilton Ref No: SSC35/2025<br>North Service Centre – Richards Bay Ref No: NSC18/2025",
      "description": "Process leave applications. Process PILIR applications. Process payment of leave gratuity. Conduct leave audit. Provide advice, guidance and support and implement policies pertaining to leave.",
      "requirements": "A Senior Certificate (Matric). Knowledge: RSA Constitution, Public Service Act, Public Service Regulations, Batho Pele Principles, Relevant Departmental, Provincial and National HR Policies and Procedures, Relevant DPSA Directives, Relevant Bargaining Chamber Resolutions, Relevant PERSAL functions and procedures. Skills: language, listening, presentation, analytical thinking, interpersonal relations, computer, organising, time management, problem solving, reliability, responsible and verbal and written communication.",
      "closing_date": "07 March 2025",
      "application_method": "Post, Hand Delivered, Online & Email",
      "application_directions": "All applications must be addressed to the Head of Department and for reference numbers starting with SSC may be hand delivered or couriered to 4 Pin Oak Avenue, Hilton, 3245. Applications may also be posted to Private Bag X6005, Hilton, 3245. All applications for reference numbers starting with NSC may be hand delivered or couriered to Lot no. 11634, Corner of Via Verbena and Loop Street, Veldenvlei, Richards Bay, 3900. Applications may also be posted to Private Bag X1048, Richards Bay, 3900. Applicants are discouraged from sending applications through registered mail because the Department will not be responsible for non-collection of these applications. Applicants may also submit their completed and signed Z83 application forms and CV’s directly to the following email addresses: kznjobssouth@kzndard.gov.za for reference numbers starting with SSC OR kznjobsnorth@kzndard.gov.za for reference numbers starting with NSC. Applicants may also visit any one of our Designated Online Application Centres (DOACS) where our friendly staff will assist you with applying online or receiving your hardcopy application. You can find the list of Designated Online Application Centres (DOACS) at www.kznonline.gov.za/kznjobs. Applicants are encouraged to apply for posts through the online e-Recruitment system at www.kznonline.gov.za/kznjobs",
      "enquiries": "Mrs RN Ndwandwe Tel No: (033) 343 8498"
    },
    
    {
      "title": "HUMAN RESOURCE OFFICER: HUMAN RESOURCES INFORMATION SYSTEMS",
      "department": "KWAZULU-NATAL DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(Head Office - Cedara)",
      "reference_number": "SSC36/2025",
      "description": "Provide PERSAL user support services. Coordinate PERSAL training. Administration of approved organisational structure on PERSAL. Facilitate PERSAL clean up.",
      "requirements": "A Senior Certificate (Matric). Knowledge: RSA Constitution, Public Service Act, Public Service Regulations, Electronic Communication and Transactions Act, Batho Pele Principles, Relevant PERSAL functions and procedures, DPSA Public Service Handbook on the functionality of PERSAL. Skills: Language, listening, presentation, analytical thinking, interpersonal relations, computer, organising, time management, report writing, problem solving, conflict management, reliability, responsible, verbal and written communication, self-disciplined and ability to work under pressure with minimum supervision.",
      "closing_date": "07 March 2025",
      "application_method": "Post, Hand Delivered, Online & Email",
      "application_directions": "All applications must be addressed to the Head of Department and for reference numbers starting with SSC may be hand delivered or couriered to 4 Pin Oak Avenue, Hilton, 3245. Applications may also be posted to Private Bag X6005, Hilton, 3245. All applications for reference numbers starting with NSC may be hand delivered or couriered to Lot no. 11634, Corner of Via Verbena and Loop Street, Veldenvlei, Richards Bay, 3900. Applications may also be posted to Private Bag X1048, Richards Bay, 3900. Applicants are discouraged from sending applications through registered mail because the Department will not be responsible for non-collection of these applications. Applicants may also submit their completed and signed Z83 application forms and CV’s directly to the following email addresses: kznjobssouth@kzndard.gov.za for reference numbers starting with SSC OR kznjobsnorth@kzndard.gov.za for reference numbers starting with NSC. Applicants may also visit any one of our Designated Online Application Centres (DOACS) where our friendly staff will assist you with applying online or receiving your hardcopy application. You can find the list of Designated Online Application Centres (DOACS) at www.kznonline.gov.za/kznjobs. Applicants are encouraged to apply for posts through the online e-Recruitment system at www.kznonline.gov.za/kznjobs",
      "enquiries": "Mrs RN Ndwandwe Tel No: (033) 343 8498"
    },
    
    {
      "title": "GENERAL ADMINISTRATION CLERK",
      "department": "KWAZULU-NATAL DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(Makhathini Research Station – Agricultural Livestock Research Services)",
      "reference_number": "NSC19/2025",
      "description": "Render general clerical support services. Provide supply chain management clerical support services. Provide asset support services. Provide financial administration support services. Provide human resources administration clerical support services.",
      "requirements": "A Senior Certificate (Matric). Knowledge: RSA Constitution, Public Service Act, Public Service Regulations, PFMA, Batho Pele Principles, Basic Conditions of Employment Act, Departmental Policies, Records Management / Filing Systems, knowledge of clerical duties and practices. Skills: Data capturing, computer, planning and organising, language, communication (verbal and written), reliability, honesty, responsible, listening, presentation, interpersonal relations and problem solving.",
      "closing_date": "07 March 2025",
      "application_method": "Post, Hand Delivered, Online & Email",
      "application_directions": "All applications must be addressed to the Head of Department and for reference numbers starting with SSC may be hand delivered or couriered to 4 Pin Oak Avenue, Hilton, 3245. Applications may also be posted to Private Bag X6005, Hilton, 3245. All applications for reference numbers starting with NSC may be hand delivered or couriered to Lot no. 11634, Corner of Via Verbena and Loop Street, Veldenvlei, Richards Bay, 3900. Applications may also be posted to Private Bag X1048, Richards Bay, 3900. Applicants are discouraged from sending applications through registered mail because the Department will not be responsible for non-collection of these applications. Applicants may also submit their completed and signed Z83 application forms and CV’s directly to the following email addresses: kznjobssouth@kzndard.gov.za for reference numbers starting with SSC OR kznjobsnorth@kzndard.gov.za for reference numbers starting with NSC. Applicants may also visit any one of our Designated Online Application Centres (DOACS) where our friendly staff will assist you with applying online or receiving your hardcopy application. You can find the list of Designated Online Application Centres (DOACS) at www.kznonline.gov.za/kznjobs. Applicants are encouraged to apply for posts through the online e-Recruitment system at www.kznonline.gov.za/kznjobs",
      "enquiries": "Mr M Magawana Tel No: (033) 355 9258"
    },
    
    {
      "title": "ANIMAL HEALTH ASSISTAN (X2 POSTS)",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(LDARD (Placement will be done according to the needs of the department))",
      "reference_number": "LDARD 15/02/2025",
      "description": "Assist to implement disease control measures. Assist to improve animal health through biosecurity, vaccination and surveillance for disease and treatment of animals. Assist in collecting specimen, examination and dispatch samples of animal diseases. Assist in the provision of extension services on animal health to animal owners.",
      "requirements": "Grade 12 or equivalent qualification as recognized by SAQA. No experience required. A valid driver’s license (with exception of people with disabilities). Knowledge, Competencies and skills: Good communication skills. Ability of mixing dip stuff, cleaning and re-assemble syringes, handling of veterinary tools and equipment. Experience in handling of cattle, small stock and poultry. Ability to read and write. Interpersonal, communication, evaluation persuasion, time management, conflict management.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },
    
    {
      "title": "DATA CAPTURER (X2 POSTS)",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(Head Office: Polokwane)",
      "reference_number": "LDARD 16/02/2025",
      "description": "To render data capturing services. Transcription of data from source documents and verification. Maintain accurate and up to date records on the system for authenticity. Update monthly project performance data i.e expenditure and outputs. Ensure that confidentiality of collected and stored data is maintained. To accurately capture data from available records into the required formats e.g. databases, table, spreadsheet and EPWP Reporting System. Verify query missing data and errors observed during data entry. Review and validate all data from the records. Submit data. Make regular backups of data. Update registers and statistics. Keep and maintain records and files. Ensure records and files are properly sorted and secured. Provide information to components.",
      "requirements": "Grade 12 or equivalent qualification as recognized by SAQA. No experience is required. Knowledge, Competencies and skills: Knowledge of clerical duties, practices as well as the ability to capture data, operate computer and collecting statistics. Knowledge and understanding of the legislative framework governing the Public Service. Knowledge of working procedures in terms of the working environment Computer literacy and data capturing knowledge. Good communication skills. Good interpersonal relations. Ability to work as a team and willing to work under pressure. Job Knowledge. Computer skills. Planning and organization skills. Interpersonal relations skills. Language. Flexibility. Good verbal and written communication skills. Teamwork.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },
    
    {
      "title": "ENGINEERING ASSISTANT",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(Head Office: Polokwane)",
      "reference_number": "LDARD 17/02/2025",
      "description": "Assist Sustainable Resource Management engineering officials in the execution of their duties. Support Engineering Officials with engineering duties. Support the Engineering Official with the training of interns. Office Administration.",
      "requirements": "Basic literacy and numeracy (ABET level 3) or equivalent qualification as recognized by SAQA. No experience is required. Knowledge, Competencies and skills: Basic numeracy skills, literacy, operating equipment skills.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },
    
    {
      "title": "TRACTOR DRIVER (X2 POSTS)",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(Tompi Seleka and Madzivhandila College)",
      "reference_number": "LDARD 18/02/2025",
      "description": "Loading, transportation and offloading of goods. Refuse removal within the farm. Operation and maintenance of farm machinery, farm equipment, research trails, firebreaks, and access roads. Maintenance of farm infrastructure. Routine inspection on water reservoirs and livestock drinking troughs on farm. Perform routine activities in respect of livestock and general farm activities.",
      "requirements": "Grade 10/ABET/AET or equivalent qualification as recognised by SAQA (equivalent qualification in diesel mechanics as recognised by SAQA will be an added advantage). A minimum 3 years’ experience in operation of farm machinery and maintenance of water infrastructure. A valid driver’s License (with exception of people with disabilities Knowledge, Competencies, and Skills: Knowledge of Agricultural Equipment. Ability to Operate the Tractor. Basic diesel mechanic skills. Water/Diesel Engine maintenance skills. Knowledge of various types of farm equipment. Knowledge of Batho Pele Principles. Discing, planting, and harvesting of crop fields. Driving skills.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },
    
    {
      "title": "HANDYMAN (X2 POSTS)",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(LDARD (Placement will be done according to the needs of the department))",
      "reference_number": "LDARD 19/02/2025",
      "description": "Maintenance of office buildings and furniture. Conduct regular building inspections. Attend to minor electrical, plumbing and carpentry problems. Maintenance of office equipments. Repair broken furniture and equipments. Safekeeping of maintenance tools and supplies. Report defects.",
      "requirements": "ABET L4 or equivalent qualification as recognised by SAQA. No experience is required. Knowledge, Competencies, and Skills: Knowledge of maintenance tools and equipment. Safety regulations. Communication skills. Good interpersonal relation and knowledge of Batho Pele Principles. Buildings and related farm infrastructure maintenance experience and knowledge of various types of farm infrastructure and maintenance tools will be an added advantage. Driver`s licence (with exception of people with disabilities) will be an added advantage.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },
    
    {
      "title": "DRIVER OPERATOR (X4 POSTS)",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(LDARD (Placement will be done according to the needs of the department))",
      "reference_number": "LDARD 20/02/2025",
      "description": "Operate specialized equipment. Load and offload goods/equipment. Inspection and maintenance of equipment and report defects. Keep log sheets of vehicles and machineries. Application of safety and precautionary measures. Cleaning and lubrication of machinery equipment. Grading of gravel roads and re-ravelling/shoulder maintenance. Render driving services. Transportation of work teams and materials/equipments. Detect and repair minor mechanical problems on the vehicles and take steps to have it repaired (check level and condition of oil, fuel, tyres and water). Inspection of the vehicles/equipment and report defects. Complete vehicle logbook, trip authorization for the vehicle.",
      "requirements": "NQF level 3 or equivalent qualification as recognised by SAQA. A driver’s licence Code EC and operating certificate (PDP) (with exception of people with disabilities). Knowledge, Competencies, and Skills: Knowledge of driving and operating specialized equipment. Communication Skills. Ability to operate the equipment. Ability to read and write. Good eyesight. Teamwork. Physical inspection of vehicles and interpret instructions for proper use of all controls for safe operation of vehicles. Interpret and follow operating manuals, maintenance manuals and service charts.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },
    
    {
      "title": "FARM AID (X6 POSTS)",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(LDARD (Placement will be done according to the needs of the department))",
      "reference_number": "LDARD 21/02/2025",
      "description": "Apply chemical crop protection. Soil cultivation and preparation. Irrigation of crops. Care for sick livestock. Dipping, vaccination and dosing. Count livestock daily. Tending of crops/orchards/vineyards. Cleaning of facilities and disposal of farm waste materials. Firefighting and prevention. Maintain windmills and water supply system.",
      "requirements": "Grade 10 / ABET / AET or equivalent qualification as recognised by SAQA. Knowledge, Competencies and Skills: Basic literacy and numeracy. Able to read and write. Communication skills. Good interpersonal relation and knowledge of Batho Pele Principles. Farm work experience and knowledge of various types of farm activities will be an added advantage.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },
    
    {
      "title": "FIELD RANGER (X2 POSTS)",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(Mara and Towoomba Research Centre)",
      "reference_number": "LDARD 22/02/2025",
      "description": "Farm patrol. Arrest of poachers and trespassers. Searching and dismantling of snares. Searching for the missing animals. Crime prevention. Culling of animals and maintenance of farm infrastructures like fences. Guarding of farm assets and control of veld fires.",
      "requirements": "Grade 10 / ABET / AET or equivalent qualification as recognised by SAQA. Firearm competency and licence. Farm work experience and knowledge of various types of farm activities will be an added advantage. A valid driver’s licence (with exception of people with disabilities) will be an added advantage. Knowledge, competencies, and skills: Basic literacy and numeracy. Able to read and write. Communication Skills. Report writing. Knowledge of security services. Firearm competency. Communication skills. Good interpersonal relation skills. Knowledge of Batho Pele Principles.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },

    {
      "title": "GENERAL WORKER (REDLINE GATE/ GUARD/FENCE PATROLER) (X10 POSTS)",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(LDARD, Vhembe District, Vhembe Far North and Vhembe Central)",
      "reference_number": "LDARD 23/02/2025",
      "description": "To perform routine manual farming activities. Control over Movement of cloven hooved animals. Stop, register, and search vehicle from the redline area. Check meat, dairy product, dung, grass, hides, skins, etc. Confiscate all product listed in (ii) above. Open and close the gate. Report confiscated products to the supervisor for further attention. Conduct fence patrol. Routine check of the redline fence. Repair of fence breakage. Trace animal track along the redline fence. Clear bushes along the redline fence. Control over quarantined animals. Check permit for animal quarantined. Liaise with the Animal Health Technician for inspection. Keep records. Keep permits register. Keep register for quarantined animals. Keep register for vehicle movement.",
      "requirements": "Grade 10/ABET/AET or equivalent qualification. Security qualification will be an added advantage. No experience is required. Knowledge, competencies, and skills: Basic literacy and numeracy. Able to read and write. Knowledge of security services. Communication Skills. Good interpersonal relations. Report writing.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },

    {
      "title": "GENERAL WORKER",
      "department": "LIMPOPO DEPARTMENT OF AGRICULTURE AND RURAL DEVELOPMENT(Vhembe Central)",
      "reference_number": "LDARD 24/02/2025",
      "description": "Maintenance of grounds and gardens. Maintenance and safekeeping of gardening equipment. Cleaning and maintenance of laboratory equipment and stores. Removing garbage and empty boxes. Moving furniture and equipment as required. Cleaning of laboratory service vehicles. Assist in receiving stock and goods. Reporting of losses/damages to equipment.",
      "requirements": "Grade 10 / ABET / AET or equivalent qualification as recognised by SAQA. No experience is required. Knowledge, Competencies, and Skills: Basic numeracy. Knowledge of cleaning procedures and gardening principles. Ability to operate basic garden equipment and machinery. Knowledge of maintenance of relevant equipment. Good interpersonal relations.",
      "closing_date": "07 March 2025",
      "application_method": "Online",
      "application_directions": "https://erecruitment.limpopo.gov.za",
      "enquiries": "Ms Modiba MM Tel No: (015) 294 3170<br>Ms. Mtswene PV Tel No: (015) 294 3395<br>Ms. Mothapo RL Tel No: (015) 294 3235<br>Ms. Kgobe MA Tel No: (015) 294 3347."
    },
    
    {
      "title": "CHIEF SECURITY OFFICER",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Olifantsfontein)",
      "reference_number": "DHET68/02/2025",
      "description": "Provide effective and efficient security services, Manage and ensure effective implementation of access control procedures, Manage and provide effective security services to business units and management support services, Manage and control client services to visitors and stakeholders, Control and manage the leave policy of the Department, Compile monthly report and submit to the Manager of the section, Perform administrative tasks, attend meetings of Occupational and Safety, Manage all assets and consumables, Conduct investigations and produce a preliminary report on all incidents.",
      "requirements": "An appropriate national senior certificate/grade 12 certificate plus a national diploma in Security Management. The candidate must have a PSIRA. Certificate Grade C and a valid driver’s license. A minimum of three years of supervisory experience in security. Knowledge of legislation relevant to the post, Departmental Policies and procedures, Batho Pele Principles. and good knowledge of MISS and MPSS. Good knowledge of administration and report writing skills. Good knowledge of the control of the Access to Public Premises and Vehicle Act. Computer literacy (MS Word, Excel, PowerPoint). Report writing, planning, organizing, verbal and written communication skills, and problem-solving skills. Administrative skills.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "ADMINISTRATION CLERK",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Pretoria)",
      "reference_number": "DHET72/02/2025",
      "description": "The incumbent will be responsible for rendering general clerical support services: record, organize, store, capture and retrieve correspondence and data (line function); update registers statistics; handle routine enquiries; make photocopies and receive or send facsimiles; distribute documents/ packages to various stakeholders as required; keep and maintain the filing system for the component; type letters and/or other correspondence when required; keep and maintain the incoming and outgoing document register of the component. Provide supply chain clerical support services within the component; liaise with the external and internal stakeholders in relation to the procurement of goods and services; obtain quotations, and complete procurement forms for the purchasing of standard office items; stock control of office stationery. Keep and maintain an asset register of the component: maintain a leave register; keep and maintain personnel records; keep and maintain an attendance register; arrange travelling and accommodation. Provide financial administration support services in the component: Capture and update expenditure in the component; check the correctness of substance and travel claims of the officials and submit for approval; handle telephone accounts and petty cash for the component.",
      "requirements": "An appropriate National Certificate/ Senior Certificate/Grade 12 certificate (Vocational) (NCV) level 4 certificate. A minimum of one (1) to two (2) years of relevant Clerical/ Administrative work experience is required. An appropriate national diploma in Public Management or Public Administration will be an added advantage. Knowledge of administrative and/or clerical duties in the Deputy Director-General’s office or higher office; ability to capture data; operating a computer; collecting statistics. Knowledge of procedure in terms of the working environment and the legislative framework governing the Public Service; Computer literacy and the use of the following computer applications: MS Word, Excel, PowerPoint, and Outlook. Planning and organizing; Good verbal and written communication; client orientation and customer focus, working independently or with limited supervision, accountability, ethical conduct, and professional writing and report writing skills.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "ADMINISTRATION CLERK: PLANNING, MONITORING, EVALUATION AND REPORTING",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Pretoria)",
      "reference_number": "DHET73/02/2025",
      "description": "Provide administration, logistical, and operational support to the smooth functioning of the HRDC Strategic planning and review sessions. Assist in managing the reporting function of the HRDC Secretariat. Participate in preparation to produce the annual performance and operational plans. Assist in the management activities and functions of, Monitoring and Evaluation of the work of HRDC.",
      "requirements": "An appropriate national senior certificate/ Grade 12 and/or NCV certificate (Level 4). A minimum of one (1) year to two years of relevant work experience in rendering administrative functions. An appropriate bachelor’s degree/national diploma in Public Administration/Management or related qualification will be an added advantage. An understanding of planning, reporting, monitoring, and evaluation of programmes. competencies required: planning and organizational skills, report writing, good interpersonal skills, computer skills; knowledge of monitoring and evaluation issues in the country, knowledge of public service regulations, systems and processes, good communication skills, and ability to interact professionally and work as a team. Good oral and written communication skills.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "SECRETARY TO THE DIRECTOR CET CURRICULUM AND INSTITUTIONAL SUPPORT",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Polokwane)",
      "reference_number": "DHET74/02/2025",
      "description": "Provide secretarial/receptionist support services to the Director, including support in the planning and managing of day-to-day office activities. Schedule meetings and workshops; Manage and administer the Director’s diary and itinerary; Prepare all necessary documentation for the Director. Perform routine duties in the office of the Director including telephone, travel arrangements, hotel bookings; and arranging appointments and meetings with stakeholders; Render office management support services including the keeping of records of all documents received and processed; obtain inputs, collate and compile reports, e.g. progress, monthly and management reports; scrutinize routine submissions/ reports and make notes and/or recommendations for the Director; Provide communication support services to the Director, including handle all correspondence and queries requiring the attention of the Director. Respond to inquiries received from internal and external stakeholders; and interface with internal and external clients; Handle the procurement of standard items like stationery, refreshments etc. Provide document management support including records, safekeeping, and file all documentation and records in line with the relevant legislation and policies. Provide personnel administrative support to the Director including leave, planning, reporting, and scheduling of meetings. Provide financial administration support to the Director, including handling and managing budgets, cash flow, and petty cash.",
      "requirements": "An appropriate national senior certificate/grade 12 and/or / NCV certificate (Level 4). A minimum of one (1) to two (2) years of employment experience in rendering administrative and secretarial support services. An appropriate bachelor’s Degree/National Diploma (NQF Level 6) in Secretarial, Administration, or equivalent qualification in secretarial functions will be an added advantage. Knowledge of relevant legislation, prescripts, policies, and procedures, Basic Financial Management, and understanding of supply chain processes. Knowledge of Records Management of documents. Good interpersonal and communication skills to interface with people at different levels and diverse backgrounds. Good telephone etiquette and experience in using computer applications MS Word, Excel, PowerPoint, and Outlook. Maintain confidentiality at all times. Good organizational and basic events management skills. Ability to create spreadsheets and manage basic databases and presentations. Basic knowledge of financial administration, including budgets, and managing cash flow.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "ADMINISTRATION CLERK",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Pretoria)",
      "reference_number": "DHET76/02/2025",
      "description": "Provide administrative support pertaining to strategic planning and performance reporting by TVET colleges. Provide administrative support pertaining to the implementation of the maturity model for TVET colleges. Administratively support student admission, registration, and enrolment management at TVET colleges, and deploying for site visits may be required. Administratively support all monitoring and evaluation activities performed by the directorate. These include but are not limited to data and information management, receiving and tracking of performance report submissions within the current systems and data surveys; generating and communicating reports, executing analysis and review of reports and compilation of related correspondence and reports. Execute general office administration duties.",
      "requirements": "An appropriate national senior certificate/grade 12/NCV certificate (Level 4). An appropriate bachelor’s degree/national diploma (NQF level 6) in Office or Public Administration or equivalent qualifications will be an added advantage. A minimum of one (1) to two (2) employment experience in monitoring, evaluation, and planning in government as well as performance reporting by TVET colleges is an advantage. Applicants must have good interpersonal and communication competencies and be able to write minutes, reports, and submissions. Effective problem-solving skills and operational knowledge of data administration skills are essential. Applicants must be computer literate with working competence in Microsoft Office 365 programmes such as Word, Excel (especially), Access, PowerPoint, and Outlook. Experience and competence in general office administration and events management are also required.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "SECRETARY TO THE DIRECTOR TO TVET MONITORING AND EVALUATION",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Pretoria)",
      "reference_number": "DHET77/02/2025",
      "description": "The successful candidate will be responsible for the following duties: Provide administrative support in the Director’s office. Manage and administer the Director’s diary and itinerary. Type and prepare all the necessary documentation and records in the office of the Director in line with the relevant legislation and policies. Ensure the smooth running of the Director’s office by handling all correspondence and queries requiring the attention of the Director. Respond to inquiries received from internal and external stakeholders. Obtain inputs, collate, and compile reports and minutes. Clarify instructions and notes on behalf of the Director. Perform routine duties in the office of the Director, including telephone, travel arrangements, accommodation bookings, arranging appointments and meetings with stakeholders and procurement. Interface with internal and external clients. Support key functions of the directorate and participate in related activities.",
      "requirements": "An appropriate national senior certificate/ Grade 12 and/or NCV certificate (Level 4. An appropriate bachelor’s degree/national diploma in public or business administration or a related qualification will be an added advantage. A minimum of one (1) to two (2) employment experience in rendering administrative and secretarial support. Good interpersonal and communication skills to interface with people from diverse backgrounds. Reasonable experience in using computer applications Ms Word, Excel, PowerPoint, Outlook, and Access. Good organizational and basic events management skills. The capability to create systems to manage data and information, presentations, and financial matters, will be an added advantage.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "ADMINISTRATION CLERKS (ADMINISTRATION SUPPORT AND REGISTRATIONS OF CENTRES, AND CLAIMS (X2 POSTS)",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Pretoria)",
      "reference_number": "DHET78/02/2025",
      "description": "Facilitation and Coordination of IT procurement and provisioning of goods and services within the Directorate. Facilitate and coordinate the processing of invoices for transversal contracts i.e. courier and photocopying services. Render administrative support with regard to bookings of flights, accommodation, and Shuttle for the Directorate. Checking and finalization of the S&T Claims, and telephone account. Administration of the Chief Directorate’s GG vehicles, registry, and other support services. Compiling weekly statistics and maintaining an electronic database. Processing of examination concessions for colleges in provinces. Registration of examination centres. Provide administrative support to colleges with regard to examination concession, registration and monitoring of examinations. Liaising with Provincial Officials and College officials with regard to registration and concessions. Filing and preparation of the files with the compliance tools related to monitoring and evaluation visits for inspection and verification by the Quality Council Assurors. Perform administrative duties to ensure that payment for moderation and marking processes are efficient and proceed within stipulated timeframes for the NCV, Report 190/191, and CET examinations per year. Ensure correctness of claims that were processed/quality control of claims. Maintain claims control register. Interact with moderators, markers and marking centre managers to ensure that claims for marking of answer books are submitted within stipulated timeframes and regulations.",
      "requirements": "An appropriate national senior certificate/grade 12/NCV certificate (Level 4). An appropriate bachelor’s degree/national diploma (NQF level 6) in Office or Public Administration or equivalent qualifications will be an added advantage. A minimum of one (1) to two (2) employment experience in Administration. Relevant experience in examinations will be an added advantage. The applicants must also have the following skills: Good interpersonal and communication skills – liaising with college officials. General correspondence – extracting, compiling, recording data and responding to queries. Computer literacy, especially the use of MS Word and Excel. Excellent organizational, record-keeping and electronic and manual filing skills. Good Financial skills, and analytical thinking. Knowledge of the Public Financial Management Act (PFMA). General Public service procurement frameworks and policies will be required. Must be able to work independently as well as in a team; as well as being willing to work extra hours.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "HUMAN RESOURCE CLERK: HRM SUPPORT",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Olifantsfontein)",
      "reference_number": "DHET79/02/2025",
      "description": "Coordinate training of all staff within Chief Directorate: INDLELA. Management of Internship Programme for the Chief Directorate: INDLELA. Implementation of the Performance Management Development System (PMDS). Verify employee information on the PERSAL System. Maintain staff records.",
      "requirements": "An appropriate national senior certificate/grade 12/NCV certificate (Level 4). An appropriate bachelor’s degree/national diploma (NQF Level 6) in Human Resources Management/Public Administration/Management or related qualification will be an advantage. A minimum of one (1) to two (2) years of work experience in rendering HR administrative functions. Knowledge of the PERSAL System and understanding of HR prescripts and policies. Experience in human resource management in the recruitment and conditions of service in the Public Service. Skills: Computer literacy (MS Word, Excel, PowerPoint). Report writing, planning, organizing, verbal and written communication skills. Problem-solving, administration, filing, and time management skills.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "HUMAN RESOURCE CLERK: CORPORATE SERVICES",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Pietermaritzburg)",
      "reference_number": "DHET80/02/2025",
      "description": "Implementation of Human Resource practices i.e., Recruitment and Selection, Conditions of service- attend employee benefits. Serve as secretariat during selection and interview periods. Administration of Performance and Development system, Probationary periods adhered to and to assist on Pillar processes. Render registry services. Adhere to Government Prescripts. Assist in leave management. Coordinate and facilitate training and induction programmes. Liaise with external training providers. Conduct training needs analysis. Advise employees regarding career development. Assist with skills development audits. Administer Internships/Learnerships programmes. Facilitate needs-directed courses, seminars, and workshops. Serve as a secretary during training committee meetings. Perform other related functions as requested by the supervisor.",
      "requirements": "An appropriate national senior certificate/grade 12 (Vocational) (NCV) certificate (Level 4) certificate. An appropriate bachelor’s degree/national diploma in Human Resource Management/ Public Management will be an added advantage. A minimum of one (1) to two (2) years of working experience in a Human Resource Management environment. Knowledge of Human resources or Public Administration processes. Computer Literacy. Knowledge of Human Resource functions as well as the ability to capture data, operate computers and collate administration statistics. Basic knowledge and insight into human resource prescripts. Knowledge and understanding of PERSAL. Knowledge of registry duties and importance. Flexibility and teamwork. To have good interpersonal and communication skills, listening skills, and analytical skills. Be customer-orientated and client-focused. Be able to conduct him/herself ethically and accountably. Able to work under pressure and be able to deal with confidential information and apply good judgement. To work independently and to meet deadlines.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "TRADESMAN AIDS: ASSESSMENT (X3 POSTS)",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Olifantsfontein)",
      "reference_number": "DHET81/02/2025",
      "description": "Provide candidates with necessary tools, materials, and/or other services where needed. Properly prepare material and tools for assessment tasks a day before assessment. Safeguard workshop/assessment area, machines, tools, and consumable material. Maintain cleanliness and general good housekeeping within the workshop/assessment area. Perform minor maintenance and repairs on assessment aids and machinery and carry out safety activities in the workshop/assessment area. Transport allocated assets etc. from asset management to the workshop when required as well as transporting redundant assets etc. from the workshop to asset management when required.",
      "requirements": "An appropriate national senior certificate/grade 12 and/or NCV certificate (Level 4) or a related qualification. Six (6) months of trade-related experience. Knowledge of the Occupational Health and Safety Act. Basic knowledge of cleaning material. Knowledge to prepare material and tools for assessment tasks. Communication, reading, and writing skills. Technical background knowledge of the trade. Skill to use cleaning material. Good knowledge of performing minor maintenance and repairs on assessment aids and machinery.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "PHOTOCOPIER OPERATOR",
      "department": "DEPARTMENT OF HIGHER EDUCATION AND TRAINING(Pretoria)",
      "reference_number": "DHET82/02/2025",
      "description": "Responsible for making copies of documents, Duplicate documents, and operating high-volume photocopier machines; Binding and sorting of documents; performing minor maintenance and reporting malfunctioning of the photocopier; Making requisitions for photocopier material and keeping stationery for copies; providing counter services.",
      "requirements": "An appropriate national senior/grade 12/ NCV Certificate (Level 4). Knowledge of the places in which the function will be performed. Knowledge to capture forms on the database. Knowledge of equipment; Planning and organizing. Basic level knowledge of repetitive tasks and knowledge of facilities policies. Basic level of organizational and time management skills. Communication (Verbal and written), people management, office management and administration, analytical, computer literacy, problem- solving, and discipline. Basic level of interpersonal relations, administration, and communication skills. Computer literacy. Filing and recordkeeping.",
      "closing_date": "10 March 2025",
      "application_method": "Online",
      "application_directions": "http://z83.ngnscan.co.za/apply",
      "enquiries": "Ms X Rikhotso Tel No: (012) 213 5513<br>Mr R Kgare Tel No: (012) 312 5442<br>Ms N Liwane Tel No: (012) 312 6365"
    },
    
    {
      "title": "DRIVER",
      "department": "KWAZULU-NATAL DEPARTMENT OF COMMUNITY SAFETY AND LIAISON(Pietermaritzburg)",
      "reference_number": "CSL14/2025",
      "description": "Drive light and medium motor vehicles to transport passengers and deliver other items (mail and documents). Do routine maintenance on the allocated vehicle and report defects timely. Complete all the required and prescribed records and logs books regarding the vehicle and the goods handled.",
      "requirements": "Matric and a valid driver’s licence (Code C1 with valid PDP), coupled with a minimum of 3 years’ driving experience since obtaining the relevant driver’s license. 1 year work experience as a driver. Applicants must be prepared to work extended and irregular working hours. Applicants who were previously employed as a driver by reputable employers and with clear and traceable references will be given an added advantage. Knowledge of the procedures to operate the motor vehicle e.g. procedures to obtain trip authorities, complete the logbooks of the motor vehicle, to obtain consumables (e.g. petrol) and obtain basic services (e.g. fixing a flat tyre). Knowledge of the prescripts for the correct utilisation of the motor vehicle e.g. how and for what purposes can the motor vehicle be utilised, what is the requirements for the storage of the vehicle. Knowledge of the procedures to ensure that the motor vehicle is maintained properly.",
      "closing_date": "07 March 2025",
      "application_method": "Post, Hand Delivered & Online",
      "application_directions": "KZN Online recruitment portal at (https://www.eservices.gov.za)<br>or<br>Post their Z83 and CV directly to the department to The Head: Community Safety and Liaison, Human Resource Management, Private Bag, X 9143, Pietermaritzburg, 3200<br>or<br>Hand deliver to 179 Jabu Ndlovu Street, Pietermaritzburg.",
      "enquiries": "Mr. V.V Khumalo, Tel No. 035 – 3419348"
    },
    
    {
      "title": "ACCOUNTING CLERK",
      "department": "LIMPOPO PROVINCE DEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT AND TOURISM(Head Office: Polokwane)",
      "reference_number": "C1/25/12",
      "description": "Receive and record all invoices and claims in the claims / invoice register. Reconcile and verify all claims / supplier invoices received before payments. Capture LOGIS, BAS and PERSAL payments. Ensure that all payments are processed within prescribed timelines. Clear all salary related suspense accounts. Clear all PERSAL exceptions on a daily basis. Reconcile payroll and key accounts on monthly basis. Prepare accruals and payables. Administer payment stubs. Ensure readiness of documents for audit purposes. Perform filling of all documents in the section.",
      "requirements": "An NQF 4 qualification (grade 12) as recognized by SAQA. An undergraduate NQF 6 qualification in Financial Management / Accounting / Cost Management Accounting / Economics as recognized by SAQA will be an added advantage. One (1) to two (2) years’ experience in Financial Accounting Services will be an added advantage. Valid driver’s license (with exception of persons with disability). Skills And Knowledge: Extensive knowledge and understanding of the legislative framework governing the Public Service, i.e. policies, budget processes and practices and related Acts and Regulations, such as PFMA, Treasury Regulations & Division of Revenue Act. Basic understanding of LOGIS, BAS and PERSAL. Computer literacy (MS Outlook, Word, Excel and PowerPoint). Virtual meeting platform literacy. Communication skills and personal relations. Ability to accept responsibility and to work independently. Ability to work under pressure. Financial management skills. People management and empowerment skills. Knowledge management skills. Problem solving skills. Client orientation and customer focus skills.",
      "closing_date": "28 February 2025 at 16h30",
      "application_method": "Post, Hand Delivered & Online",
      "application_directions": "https://erecruitment.limpopo.gov.za<br>or<br>Hand delivered to: Evridiki Towers, Registry Office No. B1-73, 19 Biccard Street, Polokwane, 0700<br>or<br>Post to Head of Department: Department of Economic Development, Environment and Tourism, Private Bag X9484, Polokwane, 0700",
      "enquiries": "Ms WA Klaassen Tel No: (015) 293 8691"
    },
    
    {
      "title": "REGISTRY CLERK",
      "department": "LIMPOPO PROVINCE DEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT AND TOURISM(Sekhukhune District: Lebowakgomo)",
      "reference_number": "C1/25/13",
      "description": "Handling of Registry counter services. Handling telephonic and other enquiries. Receive and register hand delivered and electronic mail. Opening and closing of files/records. Open and maintain franking register, frank mail, lock post in the mailbag and keep daily record of franked mail. Open postbag. Supervision of Messenger/Driver services. Filling and retrieval of records.",
      "requirements": "An NQF 4 qualification (grade 12) as recognized by SAQA. Knowledge of Registry duties, practices as well as ability to capture data and operate a computer. One (1) to two (2) years’ experience in Records Management / Archives / Administration will be an added advantage. Skills And Knowledge: Planning and organizing skills. Working knowledge and understanding of legislative framework in the government service. Client services. Punctuality. Independent thinking and ability to work without supervision. Computer literacy.",
      "closing_date": "28 February 2025 at 16h30",
      "application_method": "Post, Hand Delivered & Online",
      "application_directions": "https://erecruitment.limpopo.gov.za<br>or<br>Hand delivered to: Evridiki Towers, Registry Office No. B1-73, 19 Biccard Street, Polokwane, 0700<br>or<br>Post to Head of Department: Department of Economic Development, Environment and Tourism, Private Bag X9484, Polokwane, 0700",
      "enquiries": "Ms WA Klaassen Tel No: (015) 293 8691"
    },
    
    {
      "title": "MESSENGER / DRIVER",
      "department": "LIMPOPO PROVINCE DEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT AND TOURISM(Head Office: Polokwane)",
      "reference_number": "C1/25/14",
      "description": "Drive light/medium motor vehicles as required. Do routine maintenance on the allocated vehicle and report defects timely. Complete all the relevant and prescribed records and log books with regard to the vehicle and the goods handled. Run errands for the MEC for the office and for the residence on a daily basis. Collect mail and documents from all over as requested to collect to the department. Collect and deliver correspondences for the office and the MEC to all departments and Parastatals. Collect mail from the post office including heavy boxes. Deliver invitations to stakeholders e.g. business groups. Collect stationary and goods from stores. Collect and deliver documentation and related items in the department. Copy and fax documents. Assist in the registry activities. Attend to the MEC’s logistical support services. Provide transport services for the office of the MEC. Relive the MEC’s chauffeur to transport the MEC. Provide transport for the MEC’s children.",
      "requirements": "An NQF 4 qualification (Grade 12 / ABET/AET level 4 certificate) as recognized by SAQA. Seven (7) to twelve (12) months experience in Driving will be an added advantage. Valid driver’s license. Skills And Knowledge: Knowledge of messenger services. Knowledge of roads and places. Planning and organizing skills. Ability to operate photocopier machine. Language skills and the ability to communicate well with people at different levels and from different backgrounds. Computer literacy. Sound organizational skills. Good people skills. High level of reliability. Basic written communication skills. Ability to act with tact and discretion. Good grooming and presentation. Driving skills.",
      "closing_date": "28 February 2025 at 16h30",
      "application_method": "Post, Hand Delivered & Online",
      "application_directions": "https://erecruitment.limpopo.gov.za<br>or<br>Hand delivered to: Evridiki Towers, Registry Office No. B1-73, 19 Biccard Street, Polokwane, 0700<br>or<br>Post to Head of Department: Department of Economic Development, Environment and Tourism, Private Bag X9484, Polokwane, 0700",
      "enquiries": "Ms WA Klaassen Tel No: (015) 293 8691"
    },
    
    {
      "title": "FOOD AID",
      "department": "LIMPOPO PROVINCE DEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT AND TOURISM(Head Office: Polokwane)",
      "reference_number": "C1/25/15",
      "description": "Clean kitchen utensils and equipment. Provide catering support services. Keep stock of kitchen utensils and equipment. Apply hygiene and safety measures. Maintain quality control measures of all food provided. Removal of garbage disposal. Prepare food, snacks and beverages (water, tea, coffee, milk, sugar and cold drinks). Setup and convey crockery, cutlery and equipment in dining areas. Serve food and beverages. Responsible for food supplies and report waste and losses.",
      "requirements": "An NQF 1 or 2 qualification / ABET / AET level 2 certificate or equivalent as recognized by SAQA. No working experience is required. Skills And Knowledge: Knowledge in food safety and sanitation. Food presentation skills. Knife skills. Menu knowledge. Knowledge of order-taking and point-of-sale (POS) systems. Beverage presentation skills.",
      "closing_date": "28 February 2025 at 16h30",
      "application_method": "Post, Hand Delivered & Online",
      "application_directions": "https://erecruitment.limpopo.gov.za<br>or<br>Hand delivered to: Evridiki Towers, Registry Office No. B1-73, 19 Biccard Street, Polokwane, 0700<br>or<br>Post to Head of Department: Department of Economic Development, Environment and Tourism, Private Bag X9484, Polokwane, 0700",
      "enquiries": "Ms WA Klaassen Tel No: (015) 293 8691"
    },
    
    {
      "title": "GENERAL ASSISTANT",
      "department": "LIMPOPO PROVINCE DEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT AND TOURISM(Nwanedi Nature Reserve: Hospitality Management)",
      "reference_number": "C1/25/16",
      "description": "Well maintained resort facilities and equipment. Cleaning of resort and camping site grounds and surroundings. Waste management. Maintenance of swimming pool.",
      "requirements": "An NQF 4 qualification (Grade 12 / ABET level 4 certificate) as recognized by SAQA. One (1) to six (6) months experience in Hospitality Management will be an added advantage. Skills And Knowledge: Planning and organizing skills. Sound and in-depth knowledge of relevant prescripts and understanding of the legislative framework governing the Public Service, such as the Occupational Health and Safety Act. Interpersonal skills. Time management skills. Good communication skills. Teamwork skills. Group dynamics. Professionalism. Independent.",
      "closing_date": "28 February 2025 at 16h30",
      "application_method": "Post, Hand Delivered & Online",
      "application_directions": "https://erecruitment.limpopo.gov.za<br>or<br>Hand delivered to: Evridiki Towers, Registry Office No. B1-73, 19 Biccard Street, Polokwane, 0700<br>or<br>Post to Head of Department: Department of Economic Development, Environment and Tourism, Private Bag X9484, Polokwane, 0700",
      "enquiries": "Ms WA Klaassen Tel No: (015) 293 8691"
    },
    
    {
      "title": "CLEANER",
      "department": "LIMPOPO PROVINCE DEPARTMENT OF ECONOMIC DEVELOPMENT, ENVIRONMENT AND TOURISM(Mopani District: Giyani)",
      "reference_number": "C1/25/17",
      "description": "Cleaning of offices, reception area, corridors, elevators, boardrooms, kitchen, restrooms, equipment, state property and assets on a daily basis. Keep and maintain cleaning materials and equipment. Empty office dustbins daily and dispose of all refuse appropriately in the refuse bins for collection. Check bathrooms twice a day and clean accordingly. Clean windows on the inside at least quarterly on a rotational basis. Store all cleaning equipment and products neatly in the designed cupboards. Provide assistance in the preparation of meetings in the boardroom. Serving water/tea/coffee. Request cleaning materials.",
      "requirements": "An NQF 4 qualification (Grade 12 / AET certificate) as recognized by SAQA. No experience needed. Skills And Knowledge: Must be able to function in a team. Willing to receive guidance and instructions. Basic knowledge of cleaning techniques. Ability to use cleaning equipment and products, application thereof according to specified cleaning techniques to ensure acceptable clean and neat appearance of building. Understanding of basic hygiene practices. Chemical handling skills. Knowledge of cleaning products and applications. Ability to read and write. Communication and listening skills. Planning, organizing and people skills.",
      "closing_date": "28 February 2025 at 16h30",
      "application_method": "Post, Hand Delivered & Online",
      "application_directions": "https://erecruitment.limpopo.gov.za<br>or<br>Hand delivered to: Evridiki Towers, Registry Office No. B1-73, 19 Biccard Street, Polokwane, 0700<br>or<br>Post to Head of Department: Department of Economic Development, Environment and Tourism, Private Bag X9484, Polokwane, 0700",
      "enquiries": "Ms WA Klaassen Tel No: (015) 293 8691"
    },
    
    {
      "title": "ADMINISTRATION CLERK: SUPPORT (QUALITY ASSURANCE) (5-Month Contract)",
      "department": "WESTERN CAPE, PROVINCIAL GOVERNMENT DEPARTMENT OF HEALTH AND WELLNESS(Oral Health Centre, Tygerberg/Mitchell’s Plain Platform)",
      "reference_number": "Not Provided",
      "description": "Effectively provide office and administrative support services to Quality Assurance Department. Capture all required data and maintain relevant statistical data. Provide meeting secretarial support to relevant components. Assist with Complaint, Compliment, and Suggestion management. Assist with relevant surveys, audits and awareness campaigns.",
      "requirements": "Senior Certificate (or equivalent). Experience: Appropriate administrative support services experience. Appropriate experience within a Quality Assurance Department. Competencies (knowledge/skills): Competencies (knowledge/skills): Computer literacy (Microsoft Office, Clinicom, SINJANI, Ideal Clinic, LOGIS) and typing proficiency. Good planning, organisational, and data management skills.",
      "closing_date": "28 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs",
      "enquiries": "Mr. J. Hopp-Abrahams (021) 937 3197"
    },
    
    {
      "title": "ADMINISTRATION CLERK: SUPPORT (MEDICAL & ANCILIARY)",
      "department": "WESTERN CAPE, PROVINCIAL GOVERNMENT DEPARTMENT OF HEALTH AND WELLNESS(Worcester Regional Hospital)",
      "reference_number": "Not Provided",
      "description": "Render a service in the Radiology department by delivering a professional, confidential, effective, and efficient patient administration service, (i.e., Clinicom attendances, disposals and capturing of ICD 9 & 10 codes). Be responsible for all aspects of radiology workflow management including both the PACS/RIS, HIS and CR/DR processing management. Maintain effective and efficient general office administration and ad-hoc duties. Be responsible for: all folder management, statistics and all aspects of linen and stock management within radiology. Answer all telephonic enquiries effectively and professionally. Arrange appointments for Computerized Tomography, Fluoroscopy, Mammography, Ultrasounds, and X-ray appointments for district health services. Adhering to radiation legislation ensuring personal protection.",
      "requirements": "Senior Certificate (or equivalent). Experience: Appropriate experience in Radiology administration, Hospital Information System (HIS), Picture archiving communication system (PACS), Radiology information system (RIS), Computed Radiography system (CR) and radiology workflow. Inherent requirement of the job: Ability to work overtime if needed. Competencies (knowledge/skills): Professional telephone etiquette. Knowledge of HIS, PACS/RIS, CR and radiology statistics, with Computer literacy in MS Office (Word & Excel) and Outlook. The ability to adapt to a changing environment and cope with a high volume of work and be able to follow instructions and procedures. Good interpersonal relations, organisational skills, and the ability to deal with information in a confidential manner as part of a team and independently.",
      "closing_date": "28 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs",
      "enquiries": "Ms E Dreyden, tel no. 023-3481129"
    },
    
    {
      "title": "ADMINISTRATION CLERK: FINANCE (BUDGET AND EXPENDITURE)",
      "department": "WESTERN CAPE, PROVINCIAL GOVERNMENT DEPARTMENT OF HEALTH AND WELLNESS(Groote Schuur Hospital, Observatory)",
      "reference_number": "Not Provided",
      "description": "Filing of documentation. Capture BAS payments, Journal entries and Debt take on’s Allocate Cash Receipts. Control, manage and clear various Assets and Liabilities accounts. Render clerical assistance to the Senior Admin Officer in the Finance Control section.",
      "requirements": "Senior Certificate (or equivalent) with Mathematics or Accountancy as a passed subject and/or Senior Certificate (or equivalent) with experience/competencies that focuses on the Key Performance Areas (KRA’s) of the post. Experience: Appropriate experience in a Finance Department. Competencies (knowledge/skills): Good communication skills (verbal and written). Computer literacy (MS Word & Excel). Knowledge of BAS and knowledge of Persal. Knowledge of Public Finance Management Act. Knowledge of Assets and Liabilities accounts.",
      "closing_date": "28 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs",
      "enquiries": "Ms C Munnik, tel no. (021) 404-2214"
    },
    
    {
      "title": "ADMINISTRATION CLERK: SUPPORT",
      "department": "WESTERN CAPE, PROVINCIAL GOVERNMENT DEPARTMENT OF HEALTH AND WELLNESS(Alan Blyth Hospital, Ladismith, Oudtshoorn and Kannaland Sub-districts)",
      "reference_number": "Not Provided",
      "description": "Render a secretarial service to the Medical Manager (Sub District Manager). Provide a receptionist support service to the office of the Sub District Manager including answering and directing telephone calls as well as visitors and proper scheduling of meetings. Ensure adequate, timeous preparation for meetings. Render administrative support to the Office of the Sub District Manager including typing of minutes in meetings and certain documents when required and ensure accuracy of documents and ensuring good record keeping including effective and efficient filling system. Effectively and efficiently manage the diary of the Sub District Manager and ensure prioritizing of important meetings. Ensure responsible co-ordination of the Sub District Manager’s meetings i.e., logistics arrangements, venues etc.",
      "requirements": "Senior certificate / Grade 12. Experience: Appropriate experience in rendering a support service to Senior Management. Appropriate experience in office management. Inherent requirement of the job: Valid driver’s license and willingness to travel. Competencies (knowledge/skills): Computer skills-intermediate to advance (MS Office). Excellent verbal and written communication skills. Excellent interpersonal, time management, office management and organisational skills. Ability to maintain high levels of confidentiality.",
      "closing_date": "28 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs",
      "enquiries": "Dr CA Dreyer, tel. no. (044) 203- 7204"
    },
    
    {
      "title": "ADMINISTRATION CLERK: SUPPLY CHAIN MANAGEMENT",
      "department": "WESTERN CAPE, PROVINCIAL GOVERNMENT DEPARTMENT OF HEALTH AND WELLNESS(Lentegeur Hospital)",
      "reference_number": "Not Provided",
      "description": "Ensure accurate stock control. ie. verify stock levels and maintain minimum and maximum levels. Manage inventory effectively in terms of the storage, cleanliness and safe keeping of items. Ensure proper Asset Management i.e. Planning, Maintaining, Movements, Disposals and Stocktaking are performed. Work on LOGIS & Institutions systems. Assist with compiling and management of Annual Procurement Plan.",
      "requirements": "Senior Certificate (or equivalent) with Mathematics and/or Accountancy as a passed subject and/or Senior Certificate (or equivalent) with experience/competencies that focuses on the Key Performance Areas (KRA’s) of the post. Inherent requirements of the job: Willingness to rotate within Supply Chain Section and relieve colleagues when required. Computer literacy in MS Excel and Word. Competencies (knowledge/skills): Applied knowledge of the Accounting Officer’s System and SCM Delegations of the Department Computer literacy (MS Office). Knowledge of the PFMA, National and Provincial Treasury Instructions and Accounting Officer System.",
      "closing_date": "28 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs",
      "enquiries": "Mr J Sheraton, tel. no. (021) 370-1423"
    },
    
    {
      "title": "TRADESMAN AID (ELECTRICAL)",
      "department": "WESTERN CAPE, PROVINCIAL GOVERNMENT DEPARTMENT OF HEALTH AND WELLNESS((Bellville Mobile Workshop) Head Office, Cape Town)",
      "reference_number": "Not Provided",
      "description": "Carry out minor maintenance tasks. Assist with repairs and emergency breakdowns (including after-hour’s repairs). Assist with the installation of plant, equipment and alterations. Clear areas where work has been carried out. Ensure that tools and material are available when needed. Assist the Artisans in the execution of their duties.",
      "requirements": "NQF level 3 (Grade 10 certificate or equivalent). Experience: Appropriate experience within the electrical field within a workshop environment. Inherent requirements of the job: Willingness to travel throughout the Western Cape Province. Physically fit to do manual labour. Competencies (knowledge/skills): Ability to handle tools. Good interpersonal skills.",
      "closing_date": "28 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs",
      "enquiries": "Mr L Semono, tel. no. (021) 830-3770"
    },
    
    {
      "title": "CLEANER",
      "department": "WESTERN CAPE, PROVINCIAL GOVERNMENT DEPARTMENT OF HEALTH AND WELLNESS(Calitzdorp Clinic, Oudtshoorn and Kannaland Sub-districts)",
      "reference_number": "Not Provided",
      "description": "General cleaning, housekeeping and maintenance (i.e dust/sweep/ polish/ scrub/ mop/ clean windows/ walls/equipment/machinery and refuse removal). Ensure effective Waste management, Linen Management etc. Effective and efficient utilization and storage of cleaning materials and equipment. Provide optimal support to the supervisor and colleagues with general housekeeping duties and services. Adhere to general hygienic and safe environment in terms of standards and procedures.",
      "requirements": "Basic literacy and numeracy. Experience: Appropriate Experience in the field of domestic and clinic cleaning services. Inherent requirements of the job: Physical able to lift and/or move heavy objects and supplies. Ability to operate machinery and equipment used in domestic and clinic cleaning services. Competencies (knowledge/skills): Good interpersonal and communication skills (written and verbal). Knowledge of the correct methods of handling and disposal of refuse/waste products and to adhere to policies and cleaning procedures. Ability to operate machinery and equipment. Knowledge of legislation and policies of the Department of Health and Wellness relevant to cleaning practise.",
      "closing_date": "28 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs",
      "enquiries": "Ms S Labuschagne, tel. no. (058) 551-1010"
    },
    
    {
      "title": "DRIVER (LIGHT DUTY VEHICLE)",
      "department": "WESTERN CAPE, PROVINCIAL GOVERNMENT DEPARTMENT OF HEALTH AND WELLNESS(Groote Schuur Hospital)",
      "reference_number": "Not Provided",
      "description": "Schedule and plan transport routes to ensure responsible driving. Transport and load goods and safely transport clients and staff members. Inspect vehicles and timely reporting of minor and major defects. Responsible for the completion of trip authorization and logbook. Assist the Transport Officer to maintain the transport fleet in a clean and roadworthy condition. Prepare reports for the supervisor when needed.",
      "requirements": "General Education and Training Certificate (GETC)/Grade 9 (Std 7). Experience: Appropriate experience in transporting passengers and goods. Inherent requirement of the job: Valid PDP Must be of sober habits Must be willing to work overtime. A Valid driver`s licence. Competencies (knowledge/skills): Sound knowledge of transport regulations Sound knowledge of elementary fleet maintenance.",
      "closing_date": "28 February 2025",
      "application_method": "Online",
      "application_directions": "Applications are submitted online via www.westerncape.gov.za/health-jobs",
      "enquiries": "Mr E Cassiem, tel. no. (021) 404-3237"
    },
    
    {
      "title": "ACCOUNTING CLERKS: PRODUCTION",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "Army Support Formation, Ref No: FMD/01/06/25/09A<br>Central Staff BM, Ref No: FMD/01/06/25/09B<br>SA Air Force, Air Comm, Ref No: FMD/01/06/25/09C",
      "description": "Provisioning of a budget management service for the Medium term expenditure framework (MTEF). Assist and participate in the process to develop the Annual Performance plan financial management guidelines. Assist in providing an expenditure and revenue budget control service in the area of responsibility. Provide administrative Financial Management System Budget Control functions. Provide budget control policy advice. Execute the administration of FMS Budget Control functions. Monitor the budget control aspects within the area of responsibility. Provide and reproduce financial reports as required by clients. Reproduce developed financial management reports. Distribute financial reports. Perform a variety of routine administrative duties. Administration to reserve al financial management documentation for audit. Taking minutes and recordkeeping for relevant meetings and discussions. Reproduction of all financial management documentation. Distribution of office documentation. The administering of allocated resources. Contribute to the support of the budget management capability. Comply with Occupational Health and Safety standards within allocated facilities.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Matric certificate with Finance/Accounting related subjects, post matric qualification in Finance/Accounting, a minimum of one year relevant experience and a valid RSA/Military driver’s license will be an added advantage Special requirements (Skills needed): Basic communication, analytical, innovative, problem solving and interpersonal skills. Computer literacy (MS Office) essential. Knowledge of Departmental Financial Management system (FMS), report writing system (IC), Departmental Accounting, Standard Chart of Accounts, Conventional Service Writing and staff work essential or any other financial systems and Supply Chain Management.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Tshepo.Magau@dod.mil.za.<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "SA Army (Ms T.M.Sekgobela) tel: (012) 355 1238<br>SA Airforce (Mr S.R. Molekwa) tel: (012) 312 2209<br>Central Staff (Ms E.J. Van Vuuren) tel: (012) 355 5805."
    },
    
    {
      "title": "ACCOUNTING CLERK: PRODUCTION",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "FMD/01/06/25/10",
      "description": "Rendering support and assistance in controlling and maintaining current and new Departmental debt in the DOD. Regularly implementing actions to recover outstanding debt from serving and ex-members of the SA National Defence Force (SANDF), Public Service Act Personnel (PSAP) and private institutions. Implementing and maintaining processes to effectively handle Departmental debt. Registering, preparing outgoing correspondence and processing all related accounting transactions. Liaising and corresponding with the State Attorney’s office. Implementing effective actions and processes to ensure that deadlines are met and that Departmental debt is recovered. Constant collaborating, liaising and communicating with the Finance Clerk Supervisor in control of the section. Strict application of the prescripts contained in the Public Finance Management Act (PFMA), Treasury Regulations (TR’s) and other applicable instructions. Recording, filling and safeguarding of all debtors administration related documentation and information for future reference and audit purposes.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Matric certificate with Finance/Accounting related subjects, post matric qualification in Finance/Accounting, a minimum of one year relevant experience and a valid RSA/Military driver’ license will be an added advantage. Special requirements (Skills needed): Computer literate in MS Office, MS Word and Excel. Basic knowledge of the processes and procedures of the collection, recording, and management of debt and related accounting transactions. Reasoning, mathematical and problem solving ability. Ability to effectively communicate with clients/debtors. Positive, trustworthy, loyal, sound judgemental ability and aiming for zero defect.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Tshepo.Magau@dod.mil.za.<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "Mr K.O. Nyamane, tel: (012) 392 2778"
    },
    
    {
      "title": "ACCOUNTING CLERK: PRODUCTION",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "FMD/01/06/25/10",
      "description": "Rendering support and assistance in controlling and maintaining current and new Departmental debt in the DOD. Regularly implementing actions to recover outstanding debt from serving and ex-members of the SA National Defence Force (SANDF), Public Service Act Personnel (PSAP) and private institutions. Implementing and maintaining processes to effectively handle Departmental debt. Registering, preparing outgoing correspondence and processing all related accounting transactions. Liaising and corresponding with the State Attorney’s office. Implementing effective actions and processes to ensure that deadlines are met and that Departmental debt is recovered. Constant collaborating, liaising and communicating with the Finance Clerk Supervisor in control of the section. Strict application of the prescripts contained in the Public Finance Management Act (PFMA), Treasury Regulations (TR’s) and other applicable instructions. Recording, filling and safeguarding of all debtors administration related documentation and information for future reference and audit purposes.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Matric certificate with Finance/Accounting related subjects, post matric qualification in Finance/Accounting, a minimum of one year relevant experience and a valid RSA/Military driver’ license will be an added advantage. Special requirements (Skills needed): Computer literate in MS Office, MS Word and Excel. Basic knowledge of the processes and procedures of the collection, recording, and management of debt and related accounting transactions. Reasoning, mathematical and problem solving ability. Ability to effectively communicate with clients/debtors. Positive, trustworthy, loyal, sound judgemental ability and aiming for zero defect.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Precious.Musoliwa@dod.mil.za<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "Mr K.O. Nyamane, tel: (012) 392 2778"
    },
    
    {
      "title": "ACCOUNTING CLERK: PRODUCTION",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "FMD/01/06/25/11",
      "description": "Render Financial Accounting transactions: Receive and acknowledge invoices, Check invoices for correctness and validity. Process all medical payments timeously. Utilise the Finance Management System (FMS) to correctly process valid payment. Ensure that the medical practitioner has a supplier code. Ensure that the account/invoice has not been paid before. Clear suspense accounts and compile journals. Assists in attending to audit queries and providing copies of documents when necessary. Safekeeping and proper filing of financial records. Attend enquiries regarding payment of medical accounts/invoices. Perform enquiries on PERSOL regarding the medical details of SANDF members. Correctly apply all policy prescripts and regulations on the processing of medical accounts. Assist in general office administration, taking minutes, procuring of office items, collecting and delivering of documents.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Matric certificate with Finance/Accounting related subjects, post matric qualification in Finance/Accounting, a minimum of one year relevant experience and a valid RSA/Military driver’ license will be an added advantage. Special requirements (Skills needed): Basic knowledge of financial and accounting processes and understanding of the Public Finance Management Act, Treasury Regulations and other prescripts. Computer literate (MS Office software packages). Ability to work independently and team oriented. Ability to effectively communicate with internal and external stakeholders.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Tshepo.Magau@dod.mil.za.<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "Ms N. Bhengu, tel: (012) 392 3110"
    },
    
    {
      "title": "ACCOUNTING CLERK: PRODUCTION",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "FMD/01/06/25/12",
      "description": "Timely processing of documents for payment. Verification of cash purchase and sundry transactions in accordance with policy prescripts. Drawing of Accountant and Sub-Accountant Approval Schedules. Compilation of Journal transactions, capturing it and verifying it on the Financial Management System. Performing enquiries on the Central Advance System. Assisting with the administration of replenishments of Sub-Advance Accounts on a daily basis. Assist in compiling accounting reports/statistics. Administration of payments with regard to local air and bus tickets for the travel agent (AB Logistics) of the Department. Ensuring that all payments for the travel agent are paid on time and follow up on any deviations. Answering of queries concerning accounting aspects with regard to Main Advance Accounts and Sub-Advance Accounts. Obtain and provide relative feedback to involved role players. Assisting with general administrative functions and archiving, filing, and safekeeping of all accounting documentation.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Matric certificate with Finance/Accounting related subjects, post matric qualification in Finance/Accounting, a minimum of one year relevant experience and a valid RSA/Military driver’ license will be an added advantage. Special requirements (Skills needed): Ability of understanding, interpreting and correctly applying financial policy and prescripts. Basic Accounting skills and knowledge of contract management and supply chain management process. Must be computer literate and have knowledge of Microsoft Packages and Financial Systems. Sound knowledge of the Public Finance Management Act (PMFA) and Treasury Regulations will serve as a strong recommendation. Basic knowledge of the financial and accounting processes. Well-developed verbal, written communication skills with good interpersonal relations. Team-player, receptive to suggestions and focused on zero defect. Positive, loyal, creative and trustworthy. Decisive and persevering in respect of task finalisation. Sound reasoning, mathematical and problem solving ability as well as being trustworthy honest and loyal, positive and innovative. The successful candidate will be required to complete all relevant courses.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Tshepo.Magau@dod.mil.za.<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "Ms D.D. Nchabeleng, tel, (012) 392 2916"
    },
    
    {
      "title": "ACCOUNTING CLERK: PRODUCTION",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "FMD/01/06/25/13",
      "description": "Execution of the prescribed accounting processes related to payments of benefits, leave gratuity and prorate bonus due to DOD personnel that exit DOD, salaries and allowances to DOD personnel out of service. Executing of the constant collaboration and communication with supervisors, management of self-discipline, data capturing on DOD accounting and salary systems, administration of DOD payments files and related documents. Assisting in the coordination and execution of administrative related tasks.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Matric certificate with Finance/Accounting related subjects, post matric qualification in Finance/Accounting, a minimum of one year relevant experience and a valid RSA/Military driver’ license will be an added advantage. Special requirements (Skills needed): Computer Literate (MS Office packages). Well-developed verbal and written communication skills. Very conscientious and motivated towards producing effective, correct work and aiming for zero defects environment. Ability to effectively function as part of a team, receptive to work related suggestions/ideas, decisive/persevering in regard to task finalization and able to effectively function under pressure. Knowledge of the calculation and processing of salaries and allowances, final payments when persons exit their work, registration of file and documents, data capturing on financial and salary systems.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Tshepo.Magau@dod.mil.za.<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "Mr J.G. Lottering, tel, (012) 392 2417"
    },
    
    {
      "title": "SENIOR SECRETARY",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "FMD/01/06/25/14",
      "description": "Render effective and efficient secretarial services to the director. Take minutes in Director’s meetings. Type a variety of documents, including agendas, memos, letters and reports. Handle and maintain the Director’s diary, correspondence, control files, process telephone calls and take messages. Arrange entry authorisation, receiving visitors and serve tea/refreshments. Arrange meetings, appointments, flights, accommodation and transport. Ensure the director receives agendas and minutes timeously. Update and store the director’s personal information. Remind the Director of the scheduled meetings, appointments and submission of documents. Ensure the office is tidy and inventory is maintained and updated. Receive, register, route and file correspondence accordingly (i.e. agendas, minutes etc.). Applicant will also be responsible for the procurement of office requirements in the Director’s office.",
      "requirements": "Grade 12 certificate (NQF 4) or equivalent. Post matric qualification in general administration related field, and exposure to general administrative/secretarial duties including management of office assets stationery, procurement will be an added advantage. etc. Special requirements (Skills needed): Computer literate (MS Office software packages). Good telephone etiquette, and able to work under pressure. Ability to handle variety of tasks Good inter-personal skills, adaptability and resourcefulness. Applicant must have good communication skills and time management. Be presentable, reliable and punctual.",
      "closing_date": "28 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Financial Management Division, DFSS, Career Management Section, Private Bag X137, Pretoria, 0001<br>or<br>email to Tshepo.Magau@dod.mil.za.<br>or<br>In case where applicants are stationed in the Pretoria area, applications may be hand-delivered to: Poynton building, 195 Bosman Street, Pretoria where it must be placed in wooden post box number 5 at Reception.",
      "enquiries": "Ms A. Nkomo Tel, (012) 355 5795"
    },
    
    {
      "title": "PERSONNEL OFFICIAL: SUPERVISOR",
      "department": "DEPARTMENT OF DEFENCE(Pretoria)",
      "reference_number": "DHRCM/05/05/25",
      "description": "Provide a personnel administration support with reference to placement of PSAP Senior Management Service (SMS) in the Department of Defence (DOD) by coordinate the recruitment, selection and appointment of SMS officials. Supervise and administer the provision of efficient and effective HR administration support services with regards to diverse HR issues such as probation appointments. Facilitate verification of personal credentials (i.e. qualifications and employment history) of SMS. Drafting submission to the delegated authority to obtain approval for the appointment of candidates. Verify source documents and approve all PERSOL transactions in respect of the awarding of pay progression of SMS officials. Administer payment of acting allowance. Advice and assist Senior Management Services (SMS) members and Occupation Specific Dispensation (OSD) employees with the structuring of their salary packages. Inform SMS officials of the due dates submitting financial disclosure.",
      "requirements": "Grade 12 (NQF Level 4) or equivalent with a minimum of three to five (3-5) years relevant experience in Human Resource Management. Knowledge and courses of PERSOL mainframe or PERSAL system is a requirement. Special requirements (skills needed): Knowledge and understanding of Senior Management Services (SMS) Recruitment & Selection processes and procedures. Knowledge and insight in respect of HR legislation pertaining to (SMS) appointments. Knowledge and understanding of applicable HR prescripts and DPSA guidelines of (SMS). Good interpersonal skills and communication skills (written and verbal). Must be computer literate, i.e. MS Office Suite (Word, Excel and PowerPoint) and must have knowledge of the SMS Handbook and Executive Protocol.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Department of Defence, Directorate Human Resource Career Management, Private Bag X976, Pretoria, 0001.<br>or<br>Hand-deliver at Bank of Lisbon Building, 400 Paul Kruger Street, Pretoria.<br>or<br>email to dhrcmstaffing@gmail.com.",
      "enquiries": "Mr M.T. Pilane Tel No: (012) 339 5605"
    },
    
    {
      "title": "SOCIAL AUXILIARY WORKER GRADE 1 (X34 POSTS)",
      "department": "PROVINCIAL ADMINISTRATION: FREE STATE DEPARTMENT OF SOCIAL DEVELOPMENT",
      "reference_number": "Lejweleputswa District, X8 Posts: Welkom Office X6 Posts, Boshof Office X2 Posts (Ref No: DSDFS 07/25)<br>Thabo Mofutsanyana District, X17 Posts: FDC Office X3 Posts, Bethlehem Office X4 Posts, Vrede Office X4 Posts, Ficksburg Office X6 Posts: (Ref No: DSDFS 08/25)<br>Fezile Dabi District, X4 Posts: Sasolburg Office X4 (Ref No: DSDFS 09/25)<br>Xhariep District, X4 Posts: Smithfield Office X2 Posts, Jagersfontein Office X1 Post, Koffiefontein Office X1 Post: (Ref No: DSDFS 10/25)",
      "description": "Provide assistance and support to social workers with the rendering of a social work service with regard to the care, support, protection and development of vulnerable individuals, groups, families and communities through the relevant departmental programmes. Assist social workers to attend to any other matters that could result in, or stem from, social instability in any form. Keep abreast with new developments in the social work and social services field. Perform administrative support functions in support of social workers as required of the job.",
      "requirements": "An appropriate recognised NQF level 4 (Grade 12) or equivalent qualification and Social Auxiliary Certificate. Current registration with the South African Council for Social Service Professions [SACSSP]. Knowledge and Skills: Demonstrate basic understanding of the South African social welfare context, the policy and Bethlehem Office practice of developmental social welfare services and the role of social auxiliary worker within this context. Define and demonstrate understanding of the purpose of social auxiliary work and the role and functions of a social auxiliary worker in relation to a social worker within the South African context. Consistently reflect the values and principles contained in the Bill of Rights and the social work profession’s Code of Ethics in service delivery as a social auxiliary worker. Demonstrate a basic understanding of the South African judicial system and the legislation governing and impacting on social auxiliary work and social work. Demonstrate a basic understanding of human behaviour, relationship system and social issues. Implement appropriate social auxiliary work methods and techniques to address the social needs of client systems. Use appropriate resources in service delivery to client systems. Work effectively with social workers and members of multi-sectoral teams in social service delivery. Work effectively as a social auxiliary worker to address the special needs and problems experienced by at least 3 of the priority focus groups in the social welfare. Keep precise records and compile accurate reports on social needs and social auxiliary work activities and file them appropriately. Provide an efficient research and administrative support service to the social worker. Demonstrate basic knowledge of financial matters related to social auxiliary work. Demonstrate self-awareness regarding personal capacities, attitudes and skills and a willingness to develop them further under the supervision of a social worker.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Applications should be addressed to various institution as per the applicant’s need:<br><br>Mangaung Metro: Please forward your application quoting the relevant reference number, Department of Social Development, P.O. Box 695, Bloemfontein, 9300<br>or<br>hand deliver to Department of Social Development, Shop No: 46, Lemo Mall, Dr Belcher Road, Bloemfontein, 9301<br>or<br>Email to Recruitment.mangaung@fssocdev.gov.za<br><br>Lejweleputswa: Please forward your application quoting the relevant reference number hand deliver to Department of Social Development Macholo Building, 05 Elizabeth Street, Welkom, 9460<br>or<br>Email to Recruitment.lejweleputswa@fssocdev.gov.za<br><br>Thabo Mofutsanyana: Please forward your application quoting the relevant reference number, Department of Social Development, Corner of Moremoholo & Setai Street, Old FDC Building, Setsing, 9870<br>or<br>Email to Recruitment.tmofutsanyana@fssocdev.gov.za<br><br>Fezile Dabi District: Please forward your application quoting the relevant reference number, P.O. Box1122, Kroonstad, 9595<br>or<br>hand deliver to Department of Social Development, KGI Building, 20 Cross Street, Kroonstad<br>or<br>Email to Recruitment.Fdabi@fssocdev.gov.za<br><br>Xhariep District: Please forward your application quoting the relevant reference number, Department of Social Development, 15 Dawid Street Trompsburg, 9913<br>or<br>Email to Recruitment.Xhariep@fssocdev.gov.za<br><br>Thekolohelong Welfare Centre and Boiketlong Old Age Home: Please forward your application quoting the relevant reference number, The Department of Social Development, Private Bag x 20616, Bloemfontein 9300. Attention Ms. M.V. Mophethe – Human Resource Management (Recruitment Section) Old Standard Bank Building.<br>or<br>place applications in an application box at Cnr Charlotte Maxeke and West Burger Street, Old Standard Bank Building, Bloemfontein.<br>or<br>Email to Recruitment@fssocdev.gov.za",
      "enquiries": "Mangaung District: Ms M. Phori at 071 864 5734<br>Lejweleputswa District: Mr Maleme at 071 853 8481<br>Thabo Mofutsanyana District: Ms P Litabe at 066 486 6749<br>Fezile Dabi District: Ms M Martins: 083 443 8343<br>Xhariep District: Mr T Mjacu at 062 464 8445"
    },

    {
      "title": "ASSISTANT COMMUNITY DEVELOPMENT PRACTITIONER GRADE 1 (X65 POSTS)",
      "department": "PROVINCIAL ADMINISTRATION: FREE STATE DEPARTMENT OF SOCIAL DEVELOPMENT",
      "reference_number": "Mangaung District, X21 Posts: Limo Office X8 Posts, Thaba Nchu Office X7 Posts, Botshabelo Office X6 Posts: (Ref No: DSDFS 01/25)<br>Lejweleputswa District, X7 Posts: Welkom Office X5 Posts, Boshof X2 Posts: (Ref No: DSDFS 02/25)<br>Thabo Mofutsanyana District, X13 Posts: Bethlehem Office X9 Posts, FDC Office X4 Posts: (Ref No: DSDFS 03/25)<br>Fezile Dabi District, X19 Posts: Sasolburg Office X3 Posts, Frankford Office X7 Posts, Kroonstad Office X9 Posts: (Ref No: DSDFS 04/25)<br>Xhariep District, X5 Posts: Smithfield Office X3 Posts, Jagersfontein Office X1 Post, Koffiefontein Office X1 Post: (Ref No: DSDFS 05/25)",
      "description": "Assist in the identification and facilitation in the implementation of integrated community development interventions in partnership with the community and other relevant stakeholders. This would, inter alia, include the following: Establishment of social relationships: Delimit/scoping the community, gain their trust and get to know the current community services, service delivery blockages, resources, and the state of the community. Community and Households Profiling: Assess the community’s structures, households need, background information including historical, needs profile, resources, and strengths. Strengthen and build structures that can assist in this regard. Planning and prioritization: Facilitate the planning and prioritization of the activities required to develop the community by formulating goals and objectives, assessing the available resources, set time frames and compile budgets. Support communities and perform administrative support on community development and related activities. This would, inter alia, entail the following: Assist with the liaison, co-ordination and monitoring of projects and other community development ventures and report on the progress thereof. Assist with the application of the registration of emerging local structures such as Non-Profit Organisations (NPOs) with the Department of Social Development and other appropriate authorities. Assist to monitor NPOs to ensure that they are in compliance with the NPO and PFMA Acts. Provide assistance to facilitate, coordinate and participate in various awareness campaigns, and public aimed at educating communities and other stakeholders on self-empowerment.",
      "requirements": "Grade 12 qualification, Community Development Certificate (NQF Level 5). Basic knowledge of community development/work, attitudes, and values for the engagement in the social development of communities. The ability and competence to interact with community development structures. The understanding social dynamics of communities. Communication skills.",
      "closing_date": "21 February 2025",
      "application_method": "Post, Hand Delivered & Email",
      "application_directions": "Applications should be addressed to various institution as per the applicant’s need:<br><br>Mangaung Metro: Please forward your application quoting the relevant reference number, Department of Social Development, P.O. Box 695, Bloemfontein, 9300<br>or<br>hand deliver to Department of Social Development, Shop No: 46, Lemo Mall, Dr Belcher Road, Bloemfontein, 9301<br>or<br>Email to Recruitment.mangaung@fssocdev.gov.za<br><br>Lejweleputswa: Please forward your application quoting the relevant reference number hand deliver to Department of Social Development Macholo Building, 05 Elizabeth Street, Welkom, 9460<br>or<br>Email to Recruitment.lejweleputswa@fssocdev.gov.za<br><br>Thabo Mofutsanyana: Please forward your application quoting the relevant reference number, Department of Social Development, Corner of Moremoholo & Setai Street, Old FDC Building, Setsing, 9870<br>or<br>Email to Recruitment.tmofutsanyana@fssocdev.gov.za<br><br>Fezile Dabi District: Please forward your application quoting the relevant reference number, P.O. Box1122, Kroonstad, 9595<br>or<br>hand deliver to Department of Social Development, KGI Building, 20 Cross Street, Kroonstad<br>or<br>Email to Recruitment.Fdabi@fssocdev.gov.za<br><br>Xhariep District: Please forward your application quoting the relevant reference number, Department of Social Development, 15 Dawid Street Trompsburg, 9913<br>or<br>Email to Recruitment.Xhariep@fssocdev.gov.za<br><br>Thekolohelong Welfare Centre and Boiketlong Old Age Home: Please forward your application quoting the relevant reference number, The Department of Social Development, Private Bag x 20616, Bloemfontein 9300. Attention Ms. M.V. Mophethe – Human Resource Management (Recruitment Section) Old Standard Bank Building.<br>or<br>place applications in an application box at Cnr Charlotte Maxeke and West Burger Street, Old Standard Bank Building, Bloemfontein.<br>or<br>Email to Recruitment@fssocdev.gov.za",
      "enquiries": "Mangaung District: Ms M. Phori at 071 864 5734<br>Lejweleputswa District: Mr Maleme at 071 853 8481<br>Thabo Mofutsanyana District: Ms P Litabe at 066 486 6749<br>Fezile Dabi District: Ms M Martins at 083 443 8343<br>Xhariep District: Mr T Mjacu at 062 464 8445"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION) (X3 POSTS)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Dundee Ref No: DOT 321/2025<br>Cost Centre, Estcourt Ref No: DOT 322/2025",
      "description": "Provide a support and advisory service in respect of the advertising and filling of vacant posts for the Cost Centre, Provide a support service in respect of the control, custody and care of Human Resource Records and Archives, Render a support and advisory service to Cost Centre staff in respect of general benefits and housing, leave matters, Performance Management and Development System, rank and salary related matters and capturing of PERSAL transactions, Provide administrative support and process all documentation required for PILIR and exits from service for the Cost Centre, Perform all HR duties related to Zibambele contractors.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Knowledge of PERSAL, MS Word. MS Excel. MS Access and E-mail, Knowledge of Human Resource Management Policies, Procedures, Prescripts and Regulations, Keep and maintain Act, Knowledge of channels of communication, Knowledge of filing system and National Archives Act 43 of 1996, Knowledge of record Management and Registry procedure, Organizational, decision making and problem solving, Verbal and written communication skills, Ability to interpret directives, Policies and Regulations, Ability to priorities the work, Ability to operate a PC, Ability to communicate with various role players, Problem solving skills, Ability to file correctly, Ability to maintain strict level of confidentiality, The ideal candidate should be strictly confidential, be teamwork orientated and be an innovative thinker. He/ she must also be initiative, responsible and be courteous.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms NS Ndebele Cost Centre, Dundee Tel No: (034) 299 8600<br>Ms N Magubane Cost Centre, Estcourt Tel No: (036) 342 3900"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 323/2025",
      "description": "Implement Human Resource Administration practices. Address Human Resource Administration enquiries. Provide Personnel Administration clerical support services within the component. Provide Financial Administration support services in the component.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Knowledge of registry duties, practices as well as the ability to capture. Working knowledge and understanding of the Legislative framework. Knowledge of storage and retrieval procedures in terms of the working environment. Understanding of the work in registry. Computer Literacy. Planning and organisation skills. Communication skills (Verbal and written). Interpersonal relation skills. Flexibility skills. Teamwork skills. Ability to maintain a strict level of confidentiality. Ability to work under pressure. The ideal candidate should be honest, reliable, innovative, creative, loyal, friendly, efficient and responsible.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms BW Khumalo Tel No: (034) 3284 004"
    },

    {
      "title": "HUMAN RESOURCE CLERK (PRODUCTION): GENERAL BENEFITS",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 324/2025",
      "description": "Processing of all matters related to general benefits. Processing of leave and resultant payments and the maintenance of registers. Processing of all rank and salary related matters, Maintenance of computerized data, statistics and personal records. Provide information, guidance and assistance to other directorates with regard to the work in the Benefits Section and to ensure the correct application of policies and procedures.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4. Knowledge, Skills and Competencies Required: Knowledge of human resource management policies, procedures, practices and prescripts, Knowledge of computer based HR Information systems e.g PERSAL, Knowledge and ability to keep and maintain acts, regulations etc, Computer literacy (MS Word, MS Excel, E-mail), Ability to interpret and apply policy and regulations, Problem solving skills, Good communication skills (both verbal and written), The ideal candidate must be team work orientated, open minded i.e. receptive to suggestion and ideas, an innovative thinker, show initiative, be responsible and courteous.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms NP Mwelase Tel No: (033) 355 8742"
    },

    {
      "title": "ADMINISTRATION CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 325/2025",
      "description": "Provide administrative support to the Security Services Directorate. Provide support on the development on the contingency plan. Provide a clerical support service to the Security Services Directorate. Render and provide physical and operational security services.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4; plus, A valid driver’s licence (minimum Code B). Knowledge, Skills and Competencies Required: Ability to conduct security assessments, Knowledge of Minimum Information Security Standards Act of 1996, Knowledge of Minimum Physical Security Standards Act of 2009 and National Key Points Act, Knowledge of control of Access to Public Premises & Vehicles Act, Knowledge of Occupational Health and Safety Act of 1993. Knowledge of Safety at Sport and Recreational Events Act of 2010 and Occupational Health and Safety South African National Standards, Computer literacy. Good planning, organising and coordinating skills. Understanding of Security Threat and Risk Assessment, Problem solving and decision-making skills. Good communication and interpersonal skills. The ideal candidate should be trustworthy, reliable, have integrity, manage time effectively and behave ethically.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr B Tibe Tel No: (033) 355 8088"
    },

    {
      "title": "FINANCE CLERK (PRODUCTION)",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 326/2025",
      "description": "Render Financial Accounting transactions. Perform Salary Administration support services. Perform Bookkeeping support services. Render a budget support service.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4. Knowledge, Skills and Competencies Required: Basic knowledge of Financial functions, practices as well as the ability to capture data, operate a computer and collate Financial statistics. Basic knowledge of and insight of the Public Service Financial legislations, procedures and Treasury regulations (PFMA, DORA, PSA, PSR, PPPFA & Financial manual). Knowledge of basic Financial Operating systems (PERSAL, BAS & Logis etc.). Job knowledge. Communication skills (verbal and written). Interpersonal relation skills. Flexibility skills. Teamwork skills. Accuracy skills. Aptitude figures skills. Planning and organisation skills. Language skills. Basic Numeracy skills. Ability to perform routine tasks. Ability to operate office equipment. Planning and Organisation skills. Ability to interpret. Research skills. Formulating and editing skills. Analytical and Innovative thinking skills. Report writing and formulation skills. Problem solving skills. Computer Literacy. The ideal candidate should be honest, reliable, innovative, creative, trustworthy, loyal, efficient, responsible and friendly. He/ she should be able to work under pressure, maintain confidentiality and work individually and part of a team.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms N Magubane Tel No: (036) 3523 153"
    },

    {
      "title": "PRINCIPAL AUXILIARY SERVICES OFFICER",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 327/2025",
      "description": "Map accurate road and feature position for the region, Carry out road network queries, Place and replace kilometer post positions and other setting out positions as required, Advise management on technical problems, Provide training and assist with compiling procedure manuals.",
      "requirements": "A Senior Certificate / National Certificate (Vocational) NQF Level 4; plus, A minimum of 1 year experience in Road logging, GPS Mapping; plus, A valid driver’s license (Minimum code B). Knowledge, Skills and Competencies Required: Knowledge of the Roads Act & Regulations, Knowledge of the Provincial Road System, Extensive knowledge of all principals and methods of Road Logging, Skills in operating GPS equipment, Skills in GPS computer software including Pathfinder Office and Terra Sync, Driving skills, Map reading and navigation skills, Record and manage road logging projects skills, The ideal candidate should have perseverance, be flexible, have enthusiasm, good interpersonal skills, be reliable and innovative.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr TP Khumalo Tel No: (031) 7926 166"
    },

    {
      "title": "AUXILIARY SERVICES OFFICER: MATERIALS TESTING",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Port Shepstone Ref No: DOT 328/2025<br>Cost Centre, KwaDukuza Ref No: DOT 329/2025<br>Regional Office, Durban Ref No: DOT 330/2025",
      "description": "Coordinate and control the work of Tradesman Aids and give training. Ensure quality control by performing sampling and field control testing. Calculations and reporting of results. Maintenance and use of equipment.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4; plus, A valid driver’s licence (minimum code B). Knowledge, Skills and Competencies Required: Knowledge of standards and procedures as per TMH/TRH, & COLTO., Knowledge of Public Service Regulations, Computer Literacy, Knowledge of safety, General Knowledge of Departmental Road network, Knowledge of Laboratory Equipment, Knowledge of planning, Knowledge of General Admin Functions, Communication (verbal and written) skills, Good Human Relations skills, Problems solving skills, Report writing skills, The ideal candidate should have technical skills, be reliable, teamwork orientated, flexible and have good interpersonal relations.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Mr R Perumal Tel No: (031) 700 2222"
    },

    {
      "title": "SENIOR AUXILIARY SERVICES OFFICER: GROUND SURVEY",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "Cost Centre, Port Shepstone Ref No: DOT 331/2025<br>Regional Office, Durban Ref No: DOT 332/2025",
      "description": "Provide assistance with Control Surveys. Provide assistance with Topographical Survey. Provide assistance with setting out. Maintain office, stores, vehicles and other general office duties.",
      "requirements": "A Senior Certificate/ National Certificate (Vocational) NQF level 4; plus A valid driver’s licence (minimum code B). Knowledge, Skills and Competencies Required: Knowledge of Public Service Regulations, General Knowledge of Departmental Road network, General Knowledge of trig beacon locations and access routes, Knowledge of batter and profile construction, Writing skills, Communication skills, Interpersonal skills, Leadership skills, Lateral thinking skills, Computer skills, Map reading skills, Navigating GPS skills, The ideal candidate should have technical skills, be reliable, be teamwork orientated, put people first, understanding the practicality of Systems, be results driven, have perseverance, be flexible and be able to work without supervision.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms TM Khumalo Tel No: (031) 792 6166"
    },

    {
      "title": "HANDYMAN: AUXILIARY SERVICES",
      "department": "DEPARTMENT OF TRANSPORT(KZN)",
      "reference_number": "DOT 333/2025",
      "description": "Building maintenance. Administrative processors. Operation of tools and equipment. Safety and training.",
      "requirements": "ABET; plus, A valid driver’s licence (Minimum code B). Knowledge, Skills and Competencies Required: Knowledge of clerical duties, switchboard duties, registry duties, practices as well as the ability to capture data, operate computer and collecting statistics, Knowledge and understanding of the legislative framework governing the Public Service, Knowledge of working, storage and retrieval procedures in terms of the working environment, Understanding of work in registry, Ability to interpret legislation / policies, Computer skills, Interpersonal skills, Ability to work in a team, Ability to learn and apply, Planning and organisational skills, Analytical and innovative thinking skills, Problem solving skills, Verbal and written communication skills, The ideal candidate should be responsible, punctual, honest, accurate, reliable, loyal, innovative, be neat and tidy, adhere to Batho Pele principles and comply with code of conduct.",
      "closing_date": "21 February 2025 (at 16h00)",
      "application_method": "Post & Online",
      "application_directions": "FOR ATTENTION : Mr B Hornsby<br>E-Recruitment system at www.kznonline.gov.za/kznjobs. Applicants may also visit any one of our Designated Online Application Centres (DOACs) where our friendly staff will assist you with applying for jobs on the KZN online e-Recruitment system<br>or<br>Recruitment & Selection Section, Human Resource Administration Directorate, Private Bag X9043, Pietermaritzburg, 3200.<br>or<br>Hand-delivered to the Office of the Department of Transport, Inkosi Mhlabunzima Maphumulo House, 172 Burger Street, Pietermaritzburg.",
      "enquiries": "Ms TC Khumalo Tel No: (032) 437 3800"
    },

    {
      "title": "PROVISIONING ADMINISTRATION CLERK: ACQUISITION AND ASSET VERIFICATION",
      "department": "DEPARTMENT OF JUSTICE AND CONSTITUTIONAL DEVELOPMENT(National Office: Pretoria)",
      "reference_number": "25/05/FMS",
      "description": "Render clerical support; ((Covers both) Compile and maintain records/ databases and/or administrative registers; (Covers both) Check and issue furniture, equipment and accessories to components and individuals; Identify redundant, non-serviceable and obsolete equipment for disposal; Provide Secretariat support to different committees. Verify asset register.",
      "requirements": "Grade 12 certificate or equivalent Skills and Competencies; Computer literacy (MS Word; Excel, Power Point and Outlook); Planning and organizing skills; communication (written and verbal) skills; Interpersonal and organizational skills; Administrative skills; customer service orientated; Integrity.",
      "closing_date": "24 February 2025",
      "application_method": "Post",
      "application_directions": "Quoting the relevant reference number, direct your application to: The Human Resources: Department of Justice and Constitutional Development, Private Bag X81, Pretoria, 0001",
      "enquiries": "Ms. A Van Ross Tel No: (012) 315 1094"
    }
    
]
}
